/* automatically generated by rust-bindgen 0.68.1 */

unsafe impl Sync for root::JSClass {}
unsafe impl Sync for root::JSFunctionSpec {}
unsafe impl Sync for root::JSNativeWrapper {}
unsafe impl Sync for root::JSPropertySpec {}
unsafe impl Sync for root::JSTypedMethodJitInfo {}

#[allow(non_snake_case, non_camel_case_types, non_upper_case_globals)]
pub mod root {
    #[repr(C)]
    #[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
    pub struct __BindgenBitfieldUnit<Storage> {
        storage: Storage,
    }
    impl<Storage> __BindgenBitfieldUnit<Storage> {
        #[inline]
        pub const fn new(storage: Storage) -> Self {
            Self { storage }
        }
    }
    impl<Storage> __BindgenBitfieldUnit<Storage>
    where
        Storage: AsRef<[u8]> + AsMut<[u8]>,
    {
        #[inline]
        pub fn get_bit(&self, index: usize) -> bool {
            debug_assert!(index / 8 < self.storage.as_ref().len());
            let byte_index = index / 8;
            let byte = self.storage.as_ref()[byte_index];
            let bit_index = if cfg!(target_endian = "big") {
                7 - (index % 8)
            } else {
                index % 8
            };
            let mask = 1 << bit_index;
            byte & mask == mask
        }
        #[inline]
        pub fn set_bit(&mut self, index: usize, val: bool) {
            debug_assert!(index / 8 < self.storage.as_ref().len());
            let byte_index = index / 8;

    pub const JS_SCERR_TRANSFERABLE: u32 = 1;
    pub const JS_SCERR_DUP_TRANSFERABLE: u32 = 2;
    pub const JS_SCERR_UNSUPPORTED_TYPE: u32 = 3;
    pub const JS_SCERR_SHMEM_TRANSFERABLE: u32 = 4;
    pub const JS_SCERR_TYPED_ARRAY_DETACHED: u32 = 5;
    pub const JS_SCERR_WASM_NO_TRANSFER: u32 = 6;
    pub const JS_SCERR_NOT_CLONABLE: u32 = 7;
    pub const JS_SCERR_NOT_CLONABLE_WITH_COOP_COEP: u32 = 8;
    pub const JSITER_PRIVATE: u32 = 4;
    pub const JSITER_OWNONLY: u32 = 8;
    pub const JSITER_HIDDEN: u32 = 16;
    pub const JSITER_SYMBOLS: u32 = 32;
    pub const JSITER_SYMBOLSONLY: u32 = 64;
    pub const JSITER_FORAWAITOF: u32 = 128;
    pub type __off_t = ::std::os::raw::c_long;
    pub type __off64_t = ::std::os::raw::c_long;
    pub type uint_fast8_t = ::std::os::raw::c_uchar;
    pub type va_list = root::__builtin_va_list;
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct _IO_marker {
        _unused: [u8; 0],
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct _IO_codecvt {
        _unused: [u8; 0],
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct _IO_wide_data {
        _unused: [u8; 0],
    }
    pub type _IO_lock_t = ::std::os::raw::c_void;
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct _IO_FILE {
        pub _flags: ::std::os::raw::c_int,
        pub _IO_read_ptr: *mut ::std::os::raw::c_char,
        pub _IO_read_end: *mut ::std::os::raw::c_char,
        pub _IO_read_base: *mut ::std::os::raw::c_char,
        pub _IO_write_base: *mut ::std::os::raw::c_char,
        pub _IO_write_ptr: *mut ::std::os::raw::c_char,
        pub _IO_write_end: *mut ::std::os::raw::c_char,
        pub _IO_buf_base: *mut ::std::os::raw::c_char,
        pub _IO_buf_end: *mut ::std::os::raw::c_char,
        pub _IO_save_base: *mut ::std::os::raw::c_char,
        pub _IO_backup_base: *mut ::std::os::raw::c_char,
        pub _IO_save_end: *mut ::std::os::raw::c_char,
        pub _markers: *mut root::_IO_marker,
        pub _chain: *mut root::_IO_FILE,
        pub _fileno: ::std::os::raw::c_int,
        pub _flags2: ::std::os::raw::c_int,
        pub _old_offset: root::__off_t,
        pub _cur_column: ::std::os::raw::c_ushort,
        pub _vtable_offset: ::std::os::raw::c_schar,
        pub _shortbuf: [::std::os::raw::c_char; 1usize],
        pub _lock: *mut root::_IO_lock_t,
        pub _offset: root::__off64_t,
        pub _codecvt: *mut root::_IO_codecvt,
        pub _wide_data: *mut root::_IO_wide_data,
        pub _freeres_list: *mut root::_IO_FILE,
        pub _freeres_buf: *mut ::std::os::raw::c_void,
        pub __pad5: usize,
        pub _mode: ::std::os::raw::c_int,
        pub _unused2: [::std::os::raw::c_char; 20usize],
    }
    #[test]
    fn bindgen_test_layout__IO_FILE() {
        const UNINIT: ::std::mem::MaybeUninit<_IO_FILE> = ::std::mem::MaybeUninit::uninit();
        let ptr = UNINIT.as_ptr();
        assert_eq!(
            ::std::mem::size_of::<_IO_FILE>(),
            216usize,
            concat!("Size of: ", stringify!(_IO_FILE))
        );
        assert_eq!(
            ::std::mem::align_of::<_IO_FILE>(),
            8usize,
            concat!("Alignment of ", stringify!(_IO_FILE))
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr)._flags) as usize - ptr as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_flags)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr)._IO_read_ptr) as usize - ptr as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_read_ptr)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr)._IO_read_end) as usize - ptr as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_read_end)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr)._IO_read_base) as usize - ptr as usize },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_read_base)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr)._IO_write_base) as usize - ptr as usize },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_write_base)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr)._IO_write_ptr) as usize - ptr as usize },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_write_ptr)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr)._IO_write_end) as usize - ptr as usize },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_write_end)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr)._IO_buf_base) as usize - ptr as usize },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_buf_base)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr)._IO_buf_end) as usize - ptr as usize },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_buf_end)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr)._IO_save_base) as usize - ptr as usize },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_save_base)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr)._IO_backup_base) as usize - ptr as usize },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_backup_base)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr)._IO_save_end) as usize - ptr as usize },
            88usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_save_end)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr)._markers) as usize - ptr as usize },
            96usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_markers)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr)._chain) as usize - ptr as usize },
            104usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_chain)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr)._fileno) as usize - ptr as usize },
            112usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_fileno)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr)._flags2) as usize - ptr as usize },
            116usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_flags2)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr)._old_offset) as usize - ptr as usize },
            120usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_old_offset)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr)._cur_column) as usize - ptr as usize },
            128usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_cur_column)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr)._vtable_offset) as usize - ptr as usize },
            130usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_vtable_offset)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr)._shortbuf) as usize - ptr as usize },
            131usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_shortbuf)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr)._lock) as usize - ptr as usize },
            136usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_lock)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr)._offset) as usize - ptr as usize },
            144usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_offset)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr)._codecvt) as usize - ptr as usize },
            152usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_codecvt)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr)._wide_data) as usize - ptr as usize },
            160usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_wide_data)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr)._freeres_list) as usize - ptr as usize },
            168usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_freeres_list)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr)._freeres_buf) as usize - ptr as usize },
            176usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_freeres_buf)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).__pad5) as usize - ptr as usize },
            184usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(__pad5)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr)._mode) as usize - ptr as usize },
            192usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_mode)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr)._unused2) as usize - ptr as usize },
            196usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_unused2)
            )
        );
    }
    pub mod std {
        #[allow(unused_imports)]
        use self::super::super::root;
        pub type integral_constant_value_type<_Tp> = _Tp;
        pub type integral_constant_type = u8;
        pub type false_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct remove_const {
            pub _address: u8,
        }
        pub type remove_const_type<_Tp> = _Tp;
        pub type remove_const_t = root::std::remove_const;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct remove_reference {
            pub _address: u8,
        }
        pub type remove_reference_type<_Tp> = _Tp;
        pub type remove_reference_t = root::std::remove_reference;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct make_unsigned {
            pub _address: u8,
        }
        pub type make_unsigned_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct make_signed {
            pub _address: u8,
        }
        pub type make_signed_type = u8;
        pub type make_signed_t = root::std::make_signed;
        pub type make_unsigned_t = root::std::make_unsigned;
        pub type __add_pointer_helper_type<_Tp> = _Tp;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct add_pointer {
            pub _address: u8,
        }
        pub type add_pointer_t = root::std::add_pointer;
        pub type conditional_type<_Iftrue> = _Iftrue;
        pub type __underlying_type_impl_type<_Tp> = _Tp;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct underlying_type {
            pub _address: u8,
        }
        pub type enable_if_t = u8;
        pub type conditional_t = u8;
        pub type underlying_type_t = root::std::underlying_type;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct input_iterator_tag {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_input_iterator_tag() {
            assert_eq!(
                ::std::mem::size_of::<input_iterator_tag>(),
                1usize,
                concat!("Size of: ", stringify!(input_iterator_tag))
            );
            assert_eq!(
                ::std::mem::align_of::<input_iterator_tag>(),
                1usize,
                concat!("Alignment of ", stringify!(input_iterator_tag))
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct forward_iterator_tag {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_forward_iterator_tag() {
            assert_eq!(
                ::std::mem::size_of::<forward_iterator_tag>(),
                1usize,
                concat!("Size of: ", stringify!(forward_iterator_tag))
            );
            assert_eq!(
                ::std::mem::align_of::<forward_iterator_tag>(),
                1usize,
                concat!("Alignment of ", stringify!(forward_iterator_tag))
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct bidirectional_iterator_tag {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_bidirectional_iterator_tag() {
            assert_eq!(
                ::std::mem::size_of::<bidirectional_iterator_tag>(),
                1usize,
                concat!("Size of: ", stringify!(bidirectional_iterator_tag))
            );
            assert_eq!(
                ::std::mem::align_of::<bidirectional_iterator_tag>(),
                1usize,
                concat!("Alignment of ", stringify!(bidirectional_iterator_tag))
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct random_access_iterator_tag {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_random_access_iterator_tag() {
            assert_eq!(
                ::std::mem::size_of::<random_access_iterator_tag>(),
                1usize,
                concat!("Size of: ", stringify!(random_access_iterator_tag))
            );
            assert_eq!(
                ::std::mem::align_of::<random_access_iterator_tag>(),
                1usize,
                concat!("Alignment of ", stringify!(random_access_iterator_tag))
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct iterator {
            pub _address: u8,
        }
        pub type iterator_iterator_category<_Category> = _Category;
        pub type iterator_value_type<_Tp> = _Tp;
        pub type iterator_difference_type<_Distance> = _Distance;
        pub type iterator_pointer<_Pointer> = _Pointer;
        pub type iterator_reference<_Reference> = _Reference;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __iterator_traits {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct iterator_traits {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct reverse_iterator<_Iterator> {
            pub current: _Iterator,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Iterator>>,
        }
        pub type reverse_iterator___traits_type = root::std::iterator_traits;
        pub type reverse_iterator_iterator_type<_Iterator> = _Iterator;
        pub type reverse_iterator_pointer = root::std::reverse_iterator___traits_type;
        pub type reverse_iterator_difference_type = root::std::reverse_iterator___traits_type;
        pub type reverse_iterator_reference = root::std::reverse_iterator___traits_type;
        pub mod __detail {
            #[allow(unused_imports)]
            use self::super::super::super::root;
        }
        #[repr(i32)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub enum float_round_style {
            round_indeterminate = -1,
            round_toward_zero = 0,
            round_to_nearest = 1,
            round_toward_infinity = 2,
            round_toward_neg_infinity = 3,
        }
        #[repr(i32)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub enum float_denorm_style {
            denorm_indeterminate = -1,
            denorm_absent = 0,
            denorm_present = 1,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __numeric_limits_base {
            pub _address: u8,
        }
        pub const __numeric_limits_base_is_specialized: bool = false;
        pub const __numeric_limits_base_digits: ::std::os::raw::c_int = 0;
        pub const __numeric_limits_base_digits10: ::std::os::raw::c_int = 0;
        pub const __numeric_limits_base_max_digits10: ::std::os::raw::c_int = 0;
        pub const __numeric_limits_base_is_signed: bool = false;
        pub const __numeric_limits_base_is_integer: bool = false;
        pub const __numeric_limits_base_is_exact: bool = false;
        pub const __numeric_limits_base_radix: ::std::os::raw::c_int = 0;
        pub const __numeric_limits_base_min_exponent: ::std::os::raw::c_int = 0;
        pub const __numeric_limits_base_min_exponent10: ::std::os::raw::c_int = 0;
        pub const __numeric_limits_base_max_exponent: ::std::os::raw::c_int = 0;
        pub const __numeric_limits_base_max_exponent10: ::std::os::raw::c_int = 0;
        pub const __numeric_limits_base_has_infinity: bool = false;
        pub const __numeric_limits_base_has_quiet_NaN: bool = false;
        pub const __numeric_limits_base_has_signaling_NaN: bool = false;
        extern "C" {
            #[link_name = "\u{1}_ZNSt21__numeric_limits_base10has_denormE"]
            pub static __numeric_limits_base_has_denorm: root::std::float_denorm_style;
        }
        pub const __numeric_limits_base_has_denorm_loss: bool = false;
        pub const __numeric_limits_base_is_iec559: bool = false;
        pub const __numeric_limits_base_is_bounded: bool = false;
        pub const __numeric_limits_base_is_modulo: bool = false;
        pub const __numeric_limits_base_traps: bool = false;
        pub const __numeric_limits_base_tinyness_before: bool = false;
        extern "C" {
            #[link_name = "\u{1}_ZNSt21__numeric_limits_base11round_styleE"]
            pub static __numeric_limits_base_round_style: root::std::float_round_style;
        }
        #[test]
        fn bindgen_test_layout___numeric_limits_base() {
            assert_eq!(
                ::std::mem::size_of::<__numeric_limits_base>(),
                1usize,
                concat!("Size of: ", stringify!(__numeric_limits_base))
            );
            assert_eq!(
                ::std::mem::align_of::<__numeric_limits_base>(),
                1usize,
                concat!("Alignment of ", stringify!(__numeric_limits_base))
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct numeric_limits {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug)]
        pub struct atomic<_Tp> {
            pub _M_i: _Tp,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Tp>>,
        }
        pub type atomic_value_type<_Tp> = _Tp;
    }
    pub mod __gnu_cxx {
        #[allow(unused_imports)]
        use self::super::super::root;
    }
    pub mod mozilla {
        #[allow(unused_imports)]
        use self::super::super::root;
        pub mod detail {
            #[allow(unused_imports)]
            use self::super::super::super::root;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct AssertionConditionType {
                pub _address: u8,
            }
            pub type AssertionConditionType_ValueT = root::std::remove_reference_t;
            #[repr(u32)]
            #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
            pub enum ToSignedness {
                ToIsSigned = 0,
                ToIsUnsigned = 1,
            }
            #[repr(u32)]
            #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
            pub enum FromSignedness {
                FromIsSigned = 0,
                FromIsUnsigned = 1,
            }
            #[repr(u32)]
            #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
            pub enum UUComparison {
                FromIsBigger = 0,
                FromIsNotBigger = 1,
            }
            #[repr(u32)]
            #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
            pub enum USComparison {
                FromIsSmaller = 0,
                FromIsNotSmaller = 1,
            }
            #[repr(u32)]
            #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
            pub enum StorageType {
                AsBase = 0,
                AsMember = 1,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct HasPointerTypeHelper {
                pub _address: u8,
            }
            #[test]
            fn bindgen_test_layout_HasPointerTypeHelper() {
                assert_eq!(
                    ::std::mem::size_of::<HasPointerTypeHelper>(),
                    1usize,
                    concat!("Size of: ", stringify!(HasPointerTypeHelper))
                );
                assert_eq!(
                    ::std::mem::align_of::<HasPointerTypeHelper>(),
                    1usize,
                    concat!("Alignment of ", stringify!(HasPointerTypeHelper))
                );
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct HasPointerType {
                pub _address: u8,
            }
            pub type PointerTypeImpl_Type = [u8; 0usize];
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct PointerType {
                pub _address: u8,
            }
            pub type PointerType_Type = u8;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct UniqueSelector {
                pub _address: u8,
            }
            #[doc = " UniquePtr is a smart pointer that wholly owns a resource.  Ownership may be\n transferred out of a UniquePtr through explicit action, but otherwise the\n resource is destroyed when the UniquePtr is destroyed.\n\n UniquePtr is similar to C++98's std::auto_ptr, but it improves upon auto_ptr\n in one crucial way: it's impossible to copy a UniquePtr.  Copying an auto_ptr\n obviously *can't* copy ownership of its singly-owned resource.  So what\n happens if you try to copy one?  Bizarrely, ownership is implicitly\n *transferred*, preserving single ownership but breaking code that assumes a\n copy of an object is identical to the original.  (This is why auto_ptr is\n prohibited in STL containers.)\n\n UniquePtr solves this problem by being *movable* rather than copyable.\n Instead of passing a |UniquePtr u| directly to the constructor or assignment\n operator, you pass |Move(u)|.  In doing so you indicate that you're *moving*\n ownership out of |u|, into the target of the construction/assignment.  After\n the transfer completes, |u| contains |nullptr| and may be safely destroyed.\n This preserves single ownership but also allows UniquePtr to be moved by\n algorithms that have been made move-safe.  (Note: if |u| is instead a\n temporary expression, don't use |Move()|: just pass the expression, because\n it's already move-ready.  For more information see Move.h.)\n\n UniquePtr is also better than std::auto_ptr in that the deletion operation is\n customizable.  An optional second template parameter specifies a class that\n (through its operator()(T*)) implements the desired deletion policy.  If no\n policy is specified, mozilla::DefaultDelete<T> is used -- which will either\n |delete| or |delete[]| the resource, depending whether the resource is an\n array.  Custom deletion policies ideally should be empty classes (no member\n fields, no member fields in base classes, no virtual methods/inheritance),\n because then UniquePtr can be just as efficient as a raw pointer.\n\n Use of UniquePtr proceeds like so:\n\n   UniquePtr<int> g1; // initializes to nullptr\n   g1.reset(new int); // switch resources using reset()\n   g1 = nullptr; // clears g1, deletes the int\n\n   UniquePtr<int> g2(new int); // owns that int\n   int* p = g2.release(); // g2 leaks its int -- still requires deletion\n   delete p; // now freed\n\n   struct S { int x; S(int x) : x(x) {} };\n   UniquePtr<S> g3, g4(new S(5));\n   g3 = std::move(g4); // g3 owns the S, g4 cleared\n   S* p = g3.get(); // g3 still owns |p|\n   assert(g3->x == 5); // operator-> works (if .get() != nullptr)\n   assert((*g3).x == 5); // also operator* (again, if not cleared)\n   std::swap(g3, g4); // g4 now owns the S, g3 cleared\n   g3.swap(g4);  // g3 now owns the S, g4 cleared\n   UniquePtr<S> g5(std::move(g3)); // g5 owns the S, g3 cleared\n   g5.reset(); // deletes the S, g5 cleared\n\n   struct FreePolicy { void operator()(void* p) { free(p); } };\n   UniquePtr<int, FreePolicy> g6(static_cast<int*>(malloc(sizeof(int))));\n   int* ptr = g6.get();\n   g6 = nullptr; // calls free(ptr)\n\n Now, carefully note a few things you *can't* do:\n\n   UniquePtr<int> b1;\n   b1 = new int; // BAD: can only assign another UniquePtr\n   int* ptr = b1; // BAD: no auto-conversion to pointer, use get()\n\n   UniquePtr<int> b2(b1); // BAD: can't copy a UniquePtr\n   UniquePtr<int> b3 = b1; // BAD: can't copy-assign a UniquePtr\n\n (Note that changing a UniquePtr to store a direct |new| expression is\n permitted, but usually you should use MakeUnique, defined at the end of this\n header.)\n\n A few miscellaneous notes:\n\n UniquePtr, when not instantiated for an array type, can be move-constructed\n and move-assigned, not only from itself but from \"derived\" UniquePtr<U, E>\n instantiations where U converts to T and E converts to D.  If you want to use\n this, you're going to have to specify a deletion policy for both UniquePtr\n instantations, and T pretty much has to have a virtual destructor.  In other\n words, this doesn't work:\n\n   struct Base { virtual ~Base() {} };\n   struct Derived : Base {};\n\n   UniquePtr<Base> b1;\n   // BAD: DefaultDelete<Base> and DefaultDelete<Derived> don't interconvert\n   UniquePtr<Derived> d1(std::move(b));\n\n   UniquePtr<Base> b2;\n   UniquePtr<Derived, DefaultDelete<Base>> d2(std::move(b2)); // okay\n\n UniquePtr is specialized for array types.  Specializing with an array type\n creates a smart-pointer version of that array -- not a pointer to such an\n array.\n\n   UniquePtr<int[]> arr(new int[5]);\n   arr[0] = 4;\n\n What else is different?  Deletion of course uses |delete[]|.  An operator[]\n is provided.  Functionality that doesn't make sense for arrays is removed.\n The constructors and mutating methods only accept array pointers (not T*, U*\n that converts to T*, or UniquePtr<U[]> or UniquePtr<U>) or |nullptr|.\n\n It's perfectly okay for a function to return a UniquePtr. This transfers\n the UniquePtr's sole ownership of the data, to the fresh UniquePtr created\n in the calling function, that will then solely own that data. Such functions\n can return a local variable UniquePtr, |nullptr|, |UniquePtr(ptr)| where\n |ptr| is a |T*|, or a UniquePtr |Move()|'d from elsewhere.\n\n UniquePtr will commonly be a member of a class, with lifetime equivalent to\n that of that class.  If you want to expose the related resource, you could\n expose a raw pointer via |get()|, but ownership of a raw pointer is\n inherently unclear.  So it's better to expose a |const UniquePtr&| instead.\n This prohibits mutation but still allows use of |get()| when needed (but\n operator-> is preferred).  Of course, you can only use this smart pointer as\n long as the enclosing class instance remains live -- no different than if you\n exposed the |get()| raw pointer.\n\n To pass a UniquePtr-managed resource as a pointer, use a |const UniquePtr&|\n argument.  To specify an inout parameter (where the method may or may not\n take ownership of the resource, or reset it), or to specify an out parameter\n (where simply returning a |UniquePtr| isn't possible), use a |UniquePtr&|\n argument.  To unconditionally transfer ownership of a UniquePtr\n into a method, use a |UniquePtr| argument.  To conditionally transfer\n ownership of a resource into a method, should the method want it, use a\n |UniquePtr&&| argument."]
            pub type UniqueSelector_SingleObject = u8;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct AlignasHelper<T> {
                pub mT: T,
                pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<T>>,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct AlignedChecker {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct AllowDeprecatedAbsFixed {
                pub _base: root::std::false_type,
            }
            #[test]
            fn __bindgen_test_layout_AllowDeprecatedAbsFixed_open0_int_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::AllowDeprecatedAbsFixed>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::AllowDeprecatedAbsFixed)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::AllowDeprecatedAbsFixed>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::AllowDeprecatedAbsFixed)
                    )
                );
            }
            #[test]
            fn __bindgen_test_layout_AllowDeprecatedAbsFixed_open0_long_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::AllowDeprecatedAbsFixed>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::AllowDeprecatedAbsFixed)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::AllowDeprecatedAbsFixed>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::AllowDeprecatedAbsFixed)
                    )
                );
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct AllowDeprecatedAbs {
                pub _base: root::mozilla::detail::AllowDeprecatedAbsFixed,
            }
            #[test]
            fn __bindgen_test_layout_AllowDeprecatedAbs_open0_int_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::AllowDeprecatedAbs>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::AllowDeprecatedAbs)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::AllowDeprecatedAbs>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::AllowDeprecatedAbs)
                    )
                );
            }
            #[test]
            fn __bindgen_test_layout_AllowDeprecatedAbs_open0_long_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::AllowDeprecatedAbs>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::AllowDeprecatedAbs)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::AllowDeprecatedAbs>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::AllowDeprecatedAbs)
                    )
                );
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct AbsReturnType {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct DoIsDestructibleImpl {
                pub _address: u8,
            }
            #[test]
            fn bindgen_test_layout_DoIsDestructibleImpl() {
                assert_eq!(
                    ::std::mem::size_of::<DoIsDestructibleImpl>(),
                    1usize,
                    concat!("Size of: ", stringify!(DoIsDestructibleImpl))
                );
                assert_eq!(
                    ::std::mem::align_of::<DoIsDestructibleImpl>(),
                    1usize,
                    concat!("Alignment of ", stringify!(DoIsDestructibleImpl))
                );
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct IsDestructibleImpl {
                pub _address: u8,
            }
            pub type IsDestructibleImpl_Type<T> = T;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct VectorTesting {
                _unused: [u8; 0],
            }
            pub type supports_os<T> = T;
            #[doc = " LinkedList supports refcounted elements using this adapter class. Clients\n using LinkedList<RefPtr<T>> will get a data structure that holds a strong\n reference to T as long as T is in the list."]
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct LinkedListElementTraits {
                pub _address: u8,
            }
            pub type LinkedListElementTraits_RawType<T> = *mut T;
            pub type LinkedListElementTraits_ConstRawType<T> = *const T;
            pub type LinkedListElementTraits_ClientType<T> = *mut T;
            pub type LinkedListElementTraits_ConstClientType<T> = *const T;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct MaybePoisoner {
                pub _address: u8,
            }
            #[repr(i32)]
            #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
            pub enum PackingStrategy {
                Variant = 0,
                NullIsOk = 1,
                LowBitTagIsError = 2,
                PackedVariant = 3,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct EmptyWrapper<V> {
                pub _base: V,
                pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<V>>,
            }
            pub type AlignedStorageOrEmpty = root::std::conditional_t;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct ResultImplementationNullIsOkBase {
                pub mValue: root::mozilla::CompactPair,
            }
            pub type ResultImplementationNullIsOkBase_ErrorStorageType =
                root::mozilla::detail::UnusedZero;
            pub type UnsignedIntType = root::std::conditional_t;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct IsPackableVariant {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct IsPackableVariant_VEbool<V, E> {
                pub v: V,
                pub e: E,
                pub ok: bool,
                pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<V>>,
                pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<E>>,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct IsPackableVariant_EVbool<V, E> {
                pub e: E,
                pub v: V,
                pub ok: bool,
                pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<V>>,
                pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<E>>,
            }
            pub type IsPackableVariant_Impl = root::std::conditional_t;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct UnusedZero {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct UnusedZeroEnum {
                pub _address: u8,
            }
            pub type UnusedZeroEnum_StorageType = root::std::underlying_type_t;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct HasFreeLSB {
                pub _address: u8,
            }
            #[test]
            fn __bindgen_test_layout_HasFreeLSB_open0_ptr_void_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::HasFreeLSB>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::HasFreeLSB)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::HasFreeLSB>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::HasFreeLSB)
                    )
                );
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct SelectResultImpl {
                pub _address: u8,
            }
            pub type SelectResultImpl_Type = u8;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct IsResult {
                pub _base: root::std::false_type,
            }
            #[test]
            fn __bindgen_test_layout_UnusedZero_open0_Error_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::UnusedZero>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::UnusedZero)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::UnusedZero>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::UnusedZero)
                    )
                );
            }
            #[test]
            fn __bindgen_test_layout_UnusedZero_open0_OOM_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::UnusedZero>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::UnusedZero)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::UnusedZero>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::UnusedZero)
                    )
                );
            }
            #[test]
            fn __bindgen_test_layout_HasFreeLSB_open0_Error_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::HasFreeLSB>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::HasFreeLSB)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::HasFreeLSB>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::HasFreeLSB)
                    )
                );
            }
            #[test]
            fn __bindgen_test_layout_HasFreeLSB_open0_OOM_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::HasFreeLSB>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::HasFreeLSB)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::HasFreeLSB>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::HasFreeLSB)
                    )
                );
            }
            pub type IntrinsicBase_ValueType<T> = root::std::atomic<T>;
            pub type IntrinsicBase_OrderedOp = u8;
            pub type IntrinsicMemoryOps_Base = u8;
            pub type IntrinsicAddSub_Base = u8;
            pub type IntrinsicIncDec_Base = u8;
            pub type AtomicIntrinsics_Base = u8;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct ToStorageTypeArgument {
                pub _address: u8,
            }
            pub type AtomicBase_Intrinsics = u8;
            pub type AtomicBase_ValueType = root::mozilla::detail::AtomicBase_Intrinsics;
            pub type AtomicBaseIncDec_Base = u8;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct WrapToSignedHelper {
                pub _address: u8,
            }
            pub type WrapToSignedHelper_SignedType = root::std::make_signed_t;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct WrappingAddHelper {
                pub _address: u8,
            }
            pub type WrappingAddHelper_UnsignedT = root::std::make_unsigned_t;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct WrappingSubtractHelper {
                pub _address: u8,
            }
            pub type WrappingSubtractHelper_UnsignedT = root::std::make_unsigned_t;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct WrappingMultiplyHelper {
                pub _address: u8,
            }
            pub type WrappingMultiplyHelper_UnsignedT = root::std::make_unsigned_t;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct HashTableEntry {
                pub _address: u8,
            }
            pub type HashTableEntry_NonConstT = u8;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct EntrySlot {
                pub mEntry: *mut root::mozilla::detail::EntrySlot_Entry,
                pub mKeyHash: *mut root::mozilla::HashNumber,
            }
            pub type EntrySlot_NonConstT = root::std::remove_const_t;
            pub type EntrySlot_Entry = u8;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct HashTable {
                pub _address: u8,
            }
            pub type HashTable_NonConstT = u8;
            pub type HashTable_Key = u8;
            pub type HashTable_Lookup = u8;
            pub type HashTable_Entry = u8;
            pub type HashTable_Slot = u8;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct HashTable_Ptr {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct HashTable_AddPtr {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct HashTable_Iterator {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct HashTable_ModIterator {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct HashTable_Range {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct HashTable_Enum {
                pub _address: u8,
            }
            impl root::mozilla::detail::HashTable_FailureBehavior {
                pub const ReportFailure: root::mozilla::detail::HashTable_FailureBehavior =
                    HashTable_FailureBehavior::DontReportFailure;
            }
            #[repr(i32)]
            #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
            pub enum HashTable_FailureBehavior {
                DontReportFailure = 0,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct HashTable_FakeSlot {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct HashTable_DoubleHash {
                pub _address: u8,
            }
            impl root::mozilla::detail::HashTable_LookupReason {
                pub const ForAdd: root::mozilla::detail::HashTable_LookupReason =
                    HashTable_LookupReason::ForNonAdd;
            }
            #[repr(i32)]
            #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
            pub enum HashTable_LookupReason {
                ForNonAdd = 0,
            }
            impl root::mozilla::detail::HashTable_RebuildStatus {
                pub const Rehashed: root::mozilla::detail::HashTable_RebuildStatus =
                    HashTable_RebuildStatus::NotOverloaded;
            }
            impl root::mozilla::detail::HashTable_RebuildStatus {
                pub const RehashFailed: root::mozilla::detail::HashTable_RebuildStatus =
                    HashTable_RebuildStatus::NotOverloaded;
            }
            #[repr(i32)]
            #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
            pub enum HashTable_RebuildStatus {
                NotOverloaded = 0,
            }
            #[doc = " SelectVariantTypeHelper is used in the implementation of SelectVariantType."]
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct SelectVariantTypeHelper {
                pub _address: u8,
            }
            #[doc = " SelectVariantType takes a type T and a list of variant types Variants and\n yields a type Type, selected from Variants, that can store a value of type T\n or a reference to type T. If no such type was found, Type is not defined.\n SelectVariantType also has a `count` member that contains the total number of\n selectable types (which will be used to check that a requested type is not\n ambiguously present twice.)"]
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct SelectVariantType {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct VariantTag {
                pub _address: u8,
            }
            pub type VariantTag_Type = root::std::conditional_t;
            #[doc = " AsVariantTemporary stores a value of type T to allow construction of a\n Variant value via type inference. Because T is copied and there's no\n guarantee that the copy can be elided, AsVariantTemporary is best used with\n primitive or very small types."]
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct AsVariantTemporary {
                pub mValue: root::std::remove_const_t,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct FloatingPointTrait {
                pub _address: u8,
            }
            #[test]
            fn __bindgen_test_layout_FloatingPointTrait_open0_float_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::FloatingPointTrait>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::FloatingPointTrait)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::FloatingPointTrait>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::FloatingPointTrait)
                    )
                );
            }
            #[test]
            fn __bindgen_test_layout_FloatingPointTrait_open0_double_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::FloatingPointTrait>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::FloatingPointTrait)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::FloatingPointTrait>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::FloatingPointTrait)
                    )
                );
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct FuzzyEqualsEpsilon {
                pub _address: u8,
            }
            #[test]
            fn __bindgen_test_layout_FuzzyEqualsEpsilon_open0_float_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::FuzzyEqualsEpsilon>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::FuzzyEqualsEpsilon)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::FuzzyEqualsEpsilon>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::FuzzyEqualsEpsilon)
                    )
                );
            }
            #[test]
            fn __bindgen_test_layout_FuzzyEqualsEpsilon_open0_double_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::FuzzyEqualsEpsilon>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::FuzzyEqualsEpsilon)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::FuzzyEqualsEpsilon>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::FuzzyEqualsEpsilon)
                    )
                );
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct Group {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct CheckConvertibility {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct IgnoreImpl {
                pub _address: u8,
            }
            #[test]
            fn bindgen_test_layout_IgnoreImpl() {
                assert_eq!(
                    ::std::mem::size_of::<IgnoreImpl>(),
                    1usize,
                    concat!("Size of: ", stringify!(IgnoreImpl))
                );
                assert_eq!(
                    ::std::mem::align_of::<IgnoreImpl>(),
                    1usize,
                    concat!("Alignment of ", stringify!(IgnoreImpl))
                );
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct MakeUnsignedChar {
                pub _address: u8,
            }
            pub type MakeUnsignedChar_Type = root::std::make_unsigned_t;
            #[test]
            fn __bindgen_test_layout_MakeUnsignedChar_open0_char16_t_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::MakeUnsignedChar>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::MakeUnsignedChar)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::MakeUnsignedChar>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::MakeUnsignedChar)
                    )
                );
            }
            #[test]
            fn __bindgen_test_layout_MakeUnsignedChar_open0_char32_t_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::mozilla::detail::MakeUnsignedChar>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::mozilla::detail::MakeUnsignedChar)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::mozilla::detail::MakeUnsignedChar>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::mozilla::detail::MakeUnsignedChar)
                    )
                );
            }
        }
        #[doc = " CompactPair is the logical concatenation of an instance of A with an instance\n B. Space is conserved when possible.  Neither A nor B may be a final class.\n\n In general if space conservation is not critical is preferred to use\n std::pair.\n\n It's typically clearer to have individual A and B member fields.  Except if\n you want the space-conserving qualities of CompactPair, you're probably\n better off not using this!\n\n No guarantees are provided about the memory layout of A and B, the order of\n initialization or destruction of A and B, and so on.  (This is approximately\n required to optimize space usage.)  The first/second names are merely\n conceptual!"]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct CompactPair {
            pub _address: u8,
        }
        pub type CompactPair_Base = u8;
        #[doc = " UniquePtr is a smart pointer that wholly owns a resource.  Ownership may be\n transferred out of a UniquePtr through explicit action, but otherwise the\n resource is destroyed when the UniquePtr is destroyed.\n\n UniquePtr is similar to C++98's std::auto_ptr, but it improves upon auto_ptr\n in one crucial way: it's impossible to copy a UniquePtr.  Copying an auto_ptr\n obviously *can't* copy ownership of its singly-owned resource.  So what\n happens if you try to copy one?  Bizarrely, ownership is implicitly\n *transferred*, preserving single ownership but breaking code that assumes a\n copy of an object is identical to the original.  (This is why auto_ptr is\n prohibited in STL containers.)\n\n UniquePtr solves this problem by being *movable* rather than copyable.\n Instead of passing a |UniquePtr u| directly to the constructor or assignment\n operator, you pass |Move(u)|.  In doing so you indicate that you're *moving*\n ownership out of |u|, into the target of the construction/assignment.  After\n the transfer completes, |u| contains |nullptr| and may be safely destroyed.\n This preserves single ownership but also allows UniquePtr to be moved by\n algorithms that have been made move-safe.  (Note: if |u| is instead a\n temporary expression, don't use |Move()|: just pass the expression, because\n it's already move-ready.  For more information see Move.h.)\n\n UniquePtr is also better than std::auto_ptr in that the deletion operation is\n customizable.  An optional second template parameter specifies a class that\n (through its operator()(T*)) implements the desired deletion policy.  If no\n policy is specified, mozilla::DefaultDelete<T> is used -- which will either\n |delete| or |delete[]| the resource, depending whether the resource is an\n array.  Custom deletion policies ideally should be empty classes (no member\n fields, no member fields in base classes, no virtual methods/inheritance),\n because then UniquePtr can be just as efficient as a raw pointer.\n\n Use of UniquePtr proceeds like so:\n\n   UniquePtr<int> g1; // initializes to nullptr\n   g1.reset(new int); // switch resources using reset()\n   g1 = nullptr; // clears g1, deletes the int\n\n   UniquePtr<int> g2(new int); // owns that int\n   int* p = g2.release(); // g2 leaks its int -- still requires deletion\n   delete p; // now freed\n\n   struct S { int x; S(int x) : x(x) {} };\n   UniquePtr<S> g3, g4(new S(5));\n   g3 = std::move(g4); // g3 owns the S, g4 cleared\n   S* p = g3.get(); // g3 still owns |p|\n   assert(g3->x == 5); // operator-> works (if .get() != nullptr)\n   assert((*g3).x == 5); // also operator* (again, if not cleared)\n   std::swap(g3, g4); // g4 now owns the S, g3 cleared\n   g3.swap(g4);  // g3 now owns the S, g4 cleared\n   UniquePtr<S> g5(std::move(g3)); // g5 owns the S, g3 cleared\n   g5.reset(); // deletes the S, g5 cleared\n\n   struct FreePolicy { void operator()(void* p) { free(p); } };\n   UniquePtr<int, FreePolicy> g6(static_cast<int*>(malloc(sizeof(int))));\n   int* ptr = g6.get();\n   g6 = nullptr; // calls free(ptr)\n\n Now, carefully note a few things you *can't* do:\n\n   UniquePtr<int> b1;\n   b1 = new int; // BAD: can only assign another UniquePtr\n   int* ptr = b1; // BAD: no auto-conversion to pointer, use get()\n\n   UniquePtr<int> b2(b1); // BAD: can't copy a UniquePtr\n   UniquePtr<int> b3 = b1; // BAD: can't copy-assign a UniquePtr\n\n (Note that changing a UniquePtr to store a direct |new| expression is\n permitted, but usually you should use MakeUnique, defined at the end of this\n header.)\n\n A few miscellaneous notes:\n\n UniquePtr, when not instantiated for an array type, can be move-constructed\n and move-assigned, not only from itself but from \"derived\" UniquePtr<U, E>\n instantiations where U converts to T and E converts to D.  If you want to use\n this, you're going to have to specify a deletion policy for both UniquePtr\n instantations, and T pretty much has to have a virtual destructor.  In other\n words, this doesn't work:\n\n   struct Base { virtual ~Base() {} };\n   struct Derived : Base {};\n\n   UniquePtr<Base> b1;\n   // BAD: DefaultDelete<Base> and DefaultDelete<Derived> don't interconvert\n   UniquePtr<Derived> d1(std::move(b));\n\n   UniquePtr<Base> b2;\n   UniquePtr<Derived, DefaultDelete<Base>> d2(std::move(b2)); // okay\n\n UniquePtr is specialized for array types.  Specializing with an array type\n creates a smart-pointer version of that array -- not a pointer to such an\n array.\n\n   UniquePtr<int[]> arr(new int[5]);\n   arr[0] = 4;\n\n What else is different?  Deletion of course uses |delete[]|.  An operator[]\n is provided.  Functionality that doesn't make sense for arrays is removed.\n The constructors and mutating methods only accept array pointers (not T*, U*\n that converts to T*, or UniquePtr<U[]> or UniquePtr<U>) or |nullptr|.\n\n It's perfectly okay for a function to return a UniquePtr. This transfers\n the UniquePtr's sole ownership of the data, to the fresh UniquePtr created\n in the calling function, that will then solely own that data. Such functions\n can return a local variable UniquePtr, |nullptr|, |UniquePtr(ptr)| where\n |ptr| is a |T*|, or a UniquePtr |Move()|'d from elsewhere.\n\n UniquePtr will commonly be a member of a class, with lifetime equivalent to\n that of that class.  If you want to expose the related resource, you could\n expose a raw pointer via |get()|, but ownership of a raw pointer is\n inherently unclear.  So it's better to expose a |const UniquePtr&| instead.\n This prohibits mutation but still allows use of |get()| when needed (but\n operator-> is preferred).  Of course, you can only use this smart pointer as\n long as the enclosing class instance remains live -- no different than if you\n exposed the |get()| raw pointer.\n\n To pass a UniquePtr-managed resource as a pointer, use a |const UniquePtr&|\n argument.  To specify an inout parameter (where the method may or may not\n take ownership of the resource, or reset it), or to specify an out parameter\n (where simply returning a |UniquePtr| isn't possible), use a |UniquePtr&|\n argument.  To unconditionally transfer ownership of a UniquePtr\n into a method, use a |UniquePtr| argument.  To conditionally transfer\n ownership of a resource into a method, should the method want it, use a\n |UniquePtr&&| argument."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct UniquePtr {
            pub _address: u8,
        }
        pub type UniquePtr_ElementType = u8;
        pub type UniquePtr_DeleterType = u8;
        pub type UniquePtr_Pointer = u8;
        #[doc = " A default deletion policy using plain old operator delete.\n\n Note that this type can be specialized, but authors should beware of the risk\n that the specialization may at some point cease to match (either because it\n gets moved to a different compilation unit or the signature changes). If the\n non-specialized (|delete|-based) version compiles for that type but does the\n wrong thing, bad things could happen.\n\n This is a non-issue for types which are always incomplete (i.e. opaque handle\n types), since |delete|-ing such a type will always trigger a compilation\n error."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct DefaultDelete {
            pub _address: u8,
        }
        pub mod span_details {
            #[allow(unused_imports)]
            use self::super::super::super::root;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct is_span_oracle {
                pub _base: root::std::false_type,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct is_span {
                pub _base: root::mozilla::span_details::is_span_oracle,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct is_std_array_oracle {
                pub _base: root::std::false_type,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct is_std_array {
                pub _base: root::mozilla::span_details::is_std_array_oracle,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct is_allowed_element_type_conversion {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct SpanKnownBounds {
                pub _address: u8,
            }
            #[test]
            fn bindgen_test_layout_SpanKnownBounds() {
                assert_eq!(
                    ::std::mem::size_of::<SpanKnownBounds>(),
                    1usize,
                    concat!("Size of: ", stringify!(SpanKnownBounds))
                );
                assert_eq!(
                    ::std::mem::align_of::<SpanKnownBounds>(),
                    1usize,
                    concat!("Alignment of ", stringify!(SpanKnownBounds))
                );
            }
            pub type span_iterator_element_type_ = [u8; 0usize];
            pub type span_iterator_iterator_category = root::std::random_access_iterator_tag;
            pub type span_iterator_value_type = root::std::remove_const_t;
            pub type span_iterator_difference_type = [u8; 0usize];
            pub type span_iterator_reference = *mut root::std::conditional_t;
            pub type span_iterator_pointer = root::std::add_pointer_t;
            pub type extent_type_index_type = usize;
        }
        pub type Span_element_type<ElementType> = ElementType;
        pub type Span_index_type = usize;
        pub type Span_pointer<ElementType> = *mut root::mozilla::Span_element_type<ElementType>;
        pub type Span_reference<ElementType> = *mut root::mozilla::Span_element_type<ElementType>;
        pub type Span_iterator = u8;
        pub type Span_const_iterator = u8;
        pub type Span_reverse_iterator = root::std::reverse_iterator<root::mozilla::Span_iterator>;
        pub type Span_const_reverse_iterator =
            root::std::reverse_iterator<root::mozilla::Span_const_iterator>;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct Span_storage_type<ElementType, ExtentType> {
            pub _base: ExtentType,
            pub data_: root::mozilla::Span_pointer<ElementType>,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<ElementType>>,
            pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<ExtentType>>,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct AlignmentFinder {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug)]
        pub struct AlignmentFinder_Aligner<T> {
            pub mChar: ::std::os::raw::c_char,
            pub mT: T,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<T>>,
        }
        #[repr(C)]
        pub struct AlignedStorage2 {
            pub u: root::mozilla::AlignedStorage2_U,
        }
        #[repr(C)]
        pub union AlignedStorage2_U {
            pub mBytes: *mut ::std::os::raw::c_char,
            pub mDummy: u64,
        }
        pub mod tl {
            #[allow(unused_imports)]
            use self::super::super::super::root;
            extern "C" {
                #[link_name = "\u{1}value"]
                pub static Min_value: usize;
            }
            extern "C" {
                #[link_name = "\u{1}value"]
                pub static Max_value: usize;
            }
            extern "C" {
                #[link_name = "\u{1}value"]
                pub static FloorLog2_value: usize;
            }
            extern "C" {
                #[link_name = "\u{1}value"]
                pub static CeilingLog2_value: usize;
            }
            extern "C" {
                #[link_name = "\u{1}value"]
                pub static RoundUpPow2_value: usize;
            }
            #[doc = " Compute the number of bits in the given unsigned type."]
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct BitSize {
                pub _address: u8,
            }
            extern "C" {
                #[link_name = "\u{1}checkPrecondition"]
                pub static NBitMask_checkPrecondition: usize;
            }
            extern "C" {
                #[link_name = "\u{1}value"]
                pub static NBitMask_value: usize;
            }
            extern "C" {
                #[link_name = "\u{1}value"]
                pub static MulOverflowMask_value: usize;
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct MallocAllocPolicy {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_MallocAllocPolicy() {
            assert_eq!(
                ::std::mem::size_of::<MallocAllocPolicy>(),
                1usize,
                concat!("Size of: ", stringify!(MallocAllocPolicy))
            );
            assert_eq!(
                ::std::mem::align_of::<MallocAllocPolicy>(),
                1usize,
                concat!("Alignment of ", stringify!(MallocAllocPolicy))
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct NeverAllocPolicy {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_NeverAllocPolicy() {
            assert_eq!(
                ::std::mem::size_of::<NeverAllocPolicy>(),
                1usize,
                concat!("Size of: ", stringify!(NeverAllocPolicy))
            );
            assert_eq!(
                ::std::mem::align_of::<NeverAllocPolicy>(),
                1usize,
                concat!("Alignment of ", stringify!(NeverAllocPolicy))
            );
        }
        pub type MallocSizeOf =
            ::std::option::Option<unsafe extern "C" fn(p: *const ::std::os::raw::c_void) -> usize>;
        #[repr(u32)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub enum NotNullTag {
            KnownNotNull = 0,
        }
        #[repr(C)]
        #[derive(Debug)]
        pub struct ReentrancyGuard {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_ReentrancyGuard() {
            assert_eq!(
                ::std::mem::size_of::<ReentrancyGuard>(),
                1usize,
                concat!("Size of: ", stringify!(ReentrancyGuard))
            );
            assert_eq!(
                ::std::mem::align_of::<ReentrancyGuard>(),
                1usize,
                concat!("Alignment of ", stringify!(ReentrancyGuard))
            );
        }
        #[doc = " Traits class for identifying POD types.  Until C++11 there's no automatic\n way to detect PODs, so for the moment this is done manually.  Users may\n define specializations of this class that inherit from std::true_type and\n std::false_type (or equivalently std::integral_constant<bool, true or\n false>, or conveniently from mozilla::IsPod for composite types) as needed to\n ensure correct IsPod behavior."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct IsPod {
            pub _base: root::std::false_type,
        }
        #[test]
        fn __bindgen_test_layout_IsPod_open0_char_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_IsPod_open0_signed_char_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_IsPod_open0_unsigned_char_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_IsPod_open0_short_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_IsPod_open0_unsigned_short_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_IsPod_open0_int_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_IsPod_open0_unsigned_int_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_IsPod_open0_long_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_IsPod_open0_unsigned_long_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_IsPod_open0_long_long_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_IsPod_open0_unsigned_long_long_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_IsPod_open0_bool__close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_IsPod_open0_float_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_IsPod_open0_double_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_IsPod_open0_wchar_t_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_IsPod_open0_char16_t_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::mozilla::IsPod>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::mozilla::IsPod)
                )
            );
        }
        #[doc = " IsDestructible determines whether a type has a public destructor.\n\n struct S0 {};                    // Implicit default destructor.\n struct S1 { ~S1(); };\n class C2 { ~C2(); };             // private destructor.\n\n mozilla::IsDestructible<S0>::value is true;\n mozilla::IsDestructible<S1>::value is true;\n mozilla::IsDestructible<C2>::value is false."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct IsDestructible {
            pub _address: u8,
        }
        pub type Vector_Impl = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct Vector_CapacityAndReserved {
            pub mCapacity: usize,
        }
        pub type Vector_ElementType<T> = T;
        pub const Vector_InlineLength: root::mozilla::Vector__bindgen_ty_1 =
            Vector__bindgen_ty_1::InlineLength;
        #[repr(i32)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub enum Vector__bindgen_ty_1 {
            InlineLength = 0,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct Vector_Range<T> {
            pub mCur: *mut T,
            pub mEnd: *mut T,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<T>>,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct Vector_ConstRange<T> {
            pub mCur: *const T,
            pub mEnd: *const T,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<T>>,
        }
        #[doc = " DebugOnly contains a value of type T, but only in debug builds.  In release\n builds, it does not contain a value.  This helper is intended to be used with\n MOZ_ASSERT()-style macros, allowing one to write:\n\n   DebugOnly<bool> check = func();\n   MOZ_ASSERT(check);\n\n more concisely than declaring |check| conditional on #ifdef DEBUG.\n\n DebugOnly instances can only be coerced to T in debug builds.  In release\n builds they don't have a value, so type coercion is not well defined.\n\n NOTE: DebugOnly instances still take up one byte of space, plus padding, even\n in optimized, non-DEBUG builds (see bug 1253094 comment 37 for more info).\n For this reason the class is MOZ_STACK_CLASS to prevent consumers using\n DebugOnly for struct/class members and unwittingly inflating the size of\n their objects in release builds."]
        #[repr(C)]
        #[derive(Debug)]
        pub struct DebugOnly {
            pub _address: u8,
        }
        pub type Array_ElementType<T> = T;
        pub type Array_iterator<T> = *mut T;
        pub type Array_const_iterator<T> = *const T;
        pub type Array_reverse_iterator<T> = root::std::reverse_iterator<T>;
        pub type Array_const_reverse_iterator<T> = root::std::reverse_iterator<T>;
        pub type EnumeratedArray_ArrayType = u8;
        pub type EnumeratedArray_iterator = root::mozilla::EnumeratedArray_ArrayType;
        pub type EnumeratedArray_const_iterator = root::mozilla::EnumeratedArray_ArrayType;
        pub type EnumeratedArray_reverse_iterator = root::mozilla::EnumeratedArray_ArrayType;
        pub type EnumeratedArray_const_reverse_iterator = root::mozilla::EnumeratedArray_ArrayType;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct unused_t {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct OwningNonNull {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct StaticLocalRefPtr {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct StaticRefPtr {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct RefPtrTraits {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug)]
        pub struct LinkedListElement {
            pub mNext: *mut root::mozilla::LinkedListElement,
            pub mPrev: *mut root::mozilla::LinkedListElement,
            pub mIsSentinel: bool,
        }
        #[doc = " LinkedList supports refcounted elements using this adapter class. Clients\n using LinkedList<RefPtr<T>> will get a data structure that holds a strong\n reference to T as long as T is in the list."]
        pub type LinkedListElement_Traits = root::mozilla::detail::LinkedListElementTraits;
        pub type LinkedListElement_RawType = root::mozilla::LinkedListElement_Traits;
        pub type LinkedListElement_ConstRawType = root::mozilla::LinkedListElement_Traits;
        pub type LinkedListElement_ClientType = root::mozilla::LinkedListElement_Traits;
        pub type LinkedListElement_ConstClientType = root::mozilla::LinkedListElement_Traits;
        impl root::mozilla::LinkedListElement_NodeKind {
            pub const Sentinel: root::mozilla::LinkedListElement_NodeKind =
                LinkedListElement_NodeKind::Normal;
        }
        #[repr(i32)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub enum LinkedListElement_NodeKind {
            Normal = 0,
        }
        #[repr(C)]
        #[derive(Debug)]
        pub struct LinkedList {
            pub sentinel: root::mozilla::LinkedListElement,
        }
        #[doc = " LinkedList supports refcounted elements using this adapter class. Clients\n using LinkedList<RefPtr<T>> will get a data structure that holds a strong\n reference to T as long as T is in the list."]
        pub type LinkedList_Traits = root::mozilla::detail::LinkedListElementTraits;
        pub type LinkedList_RawType = root::mozilla::LinkedList_Traits;
        pub type LinkedList_ConstRawType = root::mozilla::LinkedList_Traits;
        pub type LinkedList_ClientType = root::mozilla::LinkedList_Traits;
        pub type LinkedList_ConstClientType = root::mozilla::LinkedList_Traits;
        pub type LinkedList_ElementType = *mut root::mozilla::LinkedListElement;
        pub type LinkedList_ConstElementType = *const root::mozilla::LinkedListElement;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct LinkedList_Iterator<Type> {
            pub mCurrent: Type,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<Type>>,
        }
        pub type LinkedList_Iterator_iterator_category = root::std::forward_iterator_tag;
        pub type LinkedList_Iterator_value_type<T> = T;
        pub type LinkedList_Iterator_difference_type = isize;
        pub type LinkedList_Iterator_pointer<T> = *mut T;
        pub type LinkedList_Iterator_reference<T> = *mut T;
        #[repr(C)]
        #[derive(Debug)]
        pub struct AutoCleanLinkedList {
            pub _base: root::mozilla::LinkedList,
        }
        #[doc = " LinkedList supports refcounted elements using this adapter class. Clients\n using LinkedList<RefPtr<T>> will get a data structure that holds a strong\n reference to T as long as T is in the list."]
        pub type AutoCleanLinkedList_Traits = root::mozilla::detail::LinkedListElementTraits;
        pub type AutoCleanLinkedList_ClientType = root::mozilla::detail::LinkedListElementTraits;
        #[doc = " A version of CorruptionCanary that is suitable as a member of objects that\n are statically allocated."]
        #[repr(C)]
        #[derive(Debug)]
        pub struct CorruptionCanaryForStatics {
            pub mValue: usize,
        }
        pub const CorruptionCanaryForStatics_kCanarySet: usize = 252382987;
        #[test]
        fn bindgen_test_layout_CorruptionCanaryForStatics() {
            const UNINIT: ::std::mem::MaybeUninit<CorruptionCanaryForStatics> =
                ::std::mem::MaybeUninit::uninit();
            let ptr = UNINIT.as_ptr();
            assert_eq!(
                ::std::mem::size_of::<CorruptionCanaryForStatics>(),
                8usize,
                concat!("Size of: ", stringify!(CorruptionCanaryForStatics))
            );
            assert_eq!(
                ::std::mem::align_of::<CorruptionCanaryForStatics>(),
                8usize,
                concat!("Alignment of ", stringify!(CorruptionCanaryForStatics))
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).mValue) as usize - ptr as usize },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(CorruptionCanaryForStatics),
                    "::",
                    stringify!(mValue)
                )
            );
        }
        #[doc = " This class is designed to cause crashes when various kinds of memory\n corruption are observed. For instance, let's say we have a class C where we\n suspect out-of-bounds writes to some members.  We can insert a member of type\n Poison near the members we suspect are being corrupted by out-of-bounds\n writes.  Or perhaps we have a class K we suspect is subject to use-after-free\n violations, in which case it doesn't particularly matter where in the class\n we add the member of type Poison.\n\n In either case, we then insert calls to Check() throughout the code.  Doing\n so enables us to narrow down the location where the corruption is occurring.\n A pleasant side-effect of these additional Check() calls is that crash\n signatures may become more regular, as crashes will ideally occur\n consolidated at the point of a Check(), rather than scattered about at\n various uses of the corrupted memory."]
        #[repr(C)]
        #[derive(Debug)]
        pub struct CorruptionCanary {
            pub _base: root::mozilla::CorruptionCanaryForStatics,
        }
        #[test]
        fn bindgen_test_layout_CorruptionCanary() {
            assert_eq!(
                ::std::mem::size_of::<CorruptionCanary>(),
                8usize,
                concat!("Size of: ", stringify!(CorruptionCanary))
            );
            assert_eq!(
                ::std::mem::align_of::<CorruptionCanary>(),
                8usize,
                concat!("Alignment of ", stringify!(CorruptionCanary))
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct Nothing {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_Nothing() {
            assert_eq!(
                ::std::mem::size_of::<Nothing>(),
                1usize,
                concat!("Size of: ", stringify!(Nothing))
            );
            assert_eq!(
                ::std::mem::align_of::<Nothing>(),
                1usize,
                concat!("Alignment of ", stringify!(Nothing))
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct Maybe {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct Maybe_SomeGuard {
            pub _address: u8,
        }
        pub type Maybe_ValueType = u8;
        #[doc = " Empty struct, indicating success for operations that have no return value.\n For example, if you declare another empty struct `struct OutOfMemory {};`,\n then `Result<Ok, OutOfMemory>` represents either success or OOM."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct Ok {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_Ok() {
            assert_eq!(
                ::std::mem::size_of::<Ok>(),
                1usize,
                concat!("Size of: ", stringify!(Ok))
            );
            assert_eq!(
                ::std::mem::align_of::<Ok>(),
                1usize,
                concat!("Alignment of ", stringify!(Ok))
            );
        }
        #[doc = " A tag used to differentiate between GenericErrorResult created by the Err\n function (completely new error) and GenericErrorResult created by the\n Result::propagateErr function (propagated error). This can be used to track\n error propagation and eventually produce error stacks for logging/debugging\n purposes."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct ErrorPropagationTag {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_ErrorPropagationTag() {
            assert_eq!(
                ::std::mem::size_of::<ErrorPropagationTag>(),
                1usize,
                concat!("Size of: ", stringify!(ErrorPropagationTag))
            );
            assert_eq!(
                ::std::mem::align_of::<ErrorPropagationTag>(),
                1usize,
                concat!("Alignment of ", stringify!(ErrorPropagationTag))
            );
        }
        #[doc = " Result<V, E> represents the outcome of an operation that can either succeed\n or fail. It contains either a success value of type V or an error value of\n type E.\n\n All Result methods are const, so results are basically immutable.\n This is just like Variant<V, E> but with a slightly different API, and the\n following cases are optimized so Result can be stored more efficiently:\n\n - If both the success and error types do not use their least significant bit,\n are trivially copyable and destructible, Result<V, E> is guaranteed to be as\n large as the larger type. This is determined via the HasFreeLSB trait. By\n default, empty classes (in particular Ok) and aligned pointer types are\n assumed to have a free LSB, but you can specialize this trait for other\n types. If the success type is empty, the representation is guaranteed to be\n all zero bits on success. Do not change this representation! There is JIT\n code that depends on it. (Implementation note: The lowest bit is used as a\n tag bit: 0 to indicate the Result's bits are a success value, 1 to indicate\n the Result's bits (with the 1 masked out) encode an error value)\n\n - Else, if the error type can't have a all-zero bits representation and is\n not larger than a pointer, a CompactPair is used to represent this rather\n than a Variant. This has shown to be better optimizable, and the template\n code is much simpler than that of Variant, so it should also compile faster.\n Whether an error type can't be all-zero bits, is determined via the\n UnusedZero trait. MFBT doesn't declare any public type UnusedZero, but\n nsresult is declared UnusedZero in XPCOM.\n\n The purpose of Result is to reduce the screwups caused by using `false` or\n `nullptr` to indicate errors.\n What screwups? See <https://bugzilla.mozilla.org/show_bug.cgi?id=912928> for\n a partial list.\n\n Result<const V, E> or Result<V, const E> are not meaningful. The success or\n error values in a Result instance are non-modifiable in-place anyway. This\n guarantee must also be maintained when evolving Result. They can be\n unwrap()ped, but this loses const qualification. However, Result<const V, E>\n or Result<V, const E> may be misleading and prevent movability. Just use\n Result<V, E>. (Result<const V*, E> may make sense though, just Result<const\n V* const, E> is not possible.)"]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct Result {
            pub mImpl: root::mozilla::Result_Impl,
        }
        pub type Result_Impl = root::mozilla::detail::SelectResultImpl;
        pub type Result_ok_type<V> = V;
        pub type Result_err_type<E> = E;
        #[doc = " A type that auto-converts to an error Result. This is like a Result without\n a success type. It's the best return type for functions that always return\n an error--functions designed to build and populate error objects. It's also\n useful in error-handling macros; see MOZ_TRY for an example."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct GenericErrorResult<E> {
            pub mErrorValue: E,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<E>>,
        }
        #[repr(u32)]
        #[doc = " An enum of memory ordering possibilities for atomics.\n\n Memory ordering is the observable state of distinct values in memory.\n (It's a separate concept from atomicity, which concerns whether an\n operation can ever be observed in an intermediate state.  Don't\n conflate the two!)  Given a sequence of operations in source code on\n memory, it is *not* always the case that, at all times and on all\n cores, those operations will appear to have occurred in that exact\n sequence.  First, the compiler might reorder that sequence, if it\n thinks another ordering will be more efficient.  Second, the CPU may\n not expose so consistent a view of memory.  CPUs will often perform\n their own instruction reordering, above and beyond that performed by\n the compiler.  And each core has its own memory caches, and accesses\n (reads and writes both) to \"memory\" may only resolve to out-of-date\n cache entries -- not to the \"most recently\" performed operation in\n some global sense.  Any access to a value that may be used by\n multiple threads, potentially across multiple cores, must therefore\n have a memory ordering imposed on it, for all code on all\n threads/cores to have a sufficiently coherent worldview.\n\n http://gcc.gnu.org/wiki/Atomic/GCCMM/AtomicSync and\n http://en.cppreference.com/w/cpp/atomic/memory_order go into more\n detail on all this, including examples of how each mode works.\n\n Note that for simplicity and practicality, not all of the modes in\n C++11 are supported.  The missing C++11 modes are either subsumed by\n the modes we provide below, or not relevant for the CPUs we support\n in Gecko.  These three modes are confusing enough as it is!"]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub enum MemoryOrdering {
            Relaxed = 0,
            ReleaseAcquire = 1,
            SequentiallyConsistent = 2,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct NotNull {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct BitSet_Reference {
            pub mBitSet: *mut u8,
            pub mPos: usize,
        }
        pub type HashNumber = u32;
        #[doc = " A pseudorandom function mapping 32-bit integers to 32-bit integers.\n\n This is for when you're feeding private data (like pointer values or credit\n card numbers) to a non-crypto hash function (like HashBytes) and then using\n the hash code for something that untrusted parties could observe (like a JS\n Map). Plug in a HashCodeScrambler before that last step to avoid leaking the\n private data.\n\n By itself, this does not prevent hash-flooding DoS attacks, because an\n attacker can still generate many values with exactly equal hash codes by\n attacking the non-crypto hash function alone. Equal hash codes will, of\n course, still be equal however much you scramble them.\n\n The algorithm is SipHash-1-3. See <https://131002.net/siphash/>."]
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone)]
        pub struct HashCodeScrambler {
            pub _bindgen_opaque_blob: [u64; 2usize],
        }
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Debug, Copy, Clone)]
        pub struct HashCodeScrambler_SipHasher {
            pub _bindgen_opaque_blob: [u64; 4usize],
        }
        #[test]
        fn bindgen_test_layout_HashCodeScrambler_SipHasher() {
            assert_eq!(
                ::std::mem::size_of::<HashCodeScrambler_SipHasher>(),
                32usize,
                concat!("Size of: ", stringify!(HashCodeScrambler_SipHasher))
            );
            assert_eq!(
                ::std::mem::align_of::<HashCodeScrambler_SipHasher>(),
                8usize,
                concat!("Alignment of ", stringify!(HashCodeScrambler_SipHasher))
            );
        }
        #[test]
        fn bindgen_test_layout_HashCodeScrambler() {
            assert_eq!(
                ::std::mem::size_of::<HashCodeScrambler>(),
                16usize,
                concat!("Size of: ", stringify!(HashCodeScrambler))
            );
            assert_eq!(
                ::std::mem::align_of::<HashCodeScrambler>(),
                8usize,
                concat!("Alignment of ", stringify!(HashCodeScrambler))
            );
        }
        #[doc = " Opaque<T> is a replacement for integral T in cases where only comparisons\n must be supported, and it's desirable to prevent accidental dependency on\n exact values."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct Opaque<T> {
            pub mValue: T,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<T>>,
        }
        #[doc = " Opaque<T> is a replacement for integral T in cases where only comparisons\n must be supported, and it's desirable to prevent accidental dependency on\n exact values."]
        pub type Generation = root::mozilla::Opaque<u64>;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct HashMap {
            pub _address: u8,
        }
        pub type HashMap_TableEntry = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct HashMap_MapHashPolicy {
            pub _address: u8,
        }
        pub type HashMap_MapHashPolicy_Base = u8;
        pub type HashMap_MapHashPolicy_KeyType = u8;
        pub type HashMap_Impl = u8;
        pub type HashMap_Lookup = u8;
        pub type HashMap_Entry = u8;
        pub type HashMap_Ptr = u8;
        pub type HashMap_AddPtr = u8;
        pub type HashMap_Iterator = u8;
        pub type HashMap_ModIterator = u8;
        pub type HashMap_Range = u8;
        pub type HashMap_Enum = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct HashSet {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct HashSet_SetHashPolicy {
            pub _address: u8,
        }
        pub type HashSet_SetHashPolicy_Base = u8;
        pub type HashSet_SetHashPolicy_KeyType = u8;
        pub type HashSet_Impl = u8;
        pub type HashSet_Lookup = u8;
        pub type HashSet_Entry = u8;
        pub type HashSet_Ptr = u8;
        pub type HashSet_AddPtr = u8;
        pub type HashSet_Iterator = u8;
        pub type HashSet_ModIterator = u8;
        pub type HashSet_Range = u8;
        pub type HashSet_Enum = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct PointerHasher {
            pub _address: u8,
        }
        pub type PointerHasher_Lookup<Key> = Key;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct DefaultHasher {
            pub _address: u8,
        }
        pub type DefaultHasher_Lookup<Key> = Key;
        #[test]
        fn __bindgen_test_layout_DefaultHasher_open0_double_void_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::mozilla::DefaultHasher>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::mozilla::DefaultHasher)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::mozilla::DefaultHasher>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::mozilla::DefaultHasher)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_DefaultHasher_open0_float_void_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::mozilla::DefaultHasher>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::mozilla::DefaultHasher)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::mozilla::DefaultHasher>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::mozilla::DefaultHasher)
                )
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct CStringHasher {
            pub _address: u8,
        }
        pub type CStringHasher_Key = *const ::std::os::raw::c_char;
        pub type CStringHasher_Lookup = *const ::std::os::raw::c_char;
        #[test]
        fn bindgen_test_layout_CStringHasher() {
            assert_eq!(
                ::std::mem::size_of::<CStringHasher>(),
                1usize,
                concat!("Size of: ", stringify!(CStringHasher))
            );
            assert_eq!(
                ::std::mem::align_of::<CStringHasher>(),
                1usize,
                concat!("Alignment of ", stringify!(CStringHasher))
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct FallibleHashMethods {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct HashMapEntry {
            pub _address: u8,
        }
        pub type HashMapEntry_KeyType = u8;
        pub type HashMapEntry_ValueType = u8;
        pub mod ipc {
            #[allow(unused_imports)]
            use self::super::super::super::root;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct IPDLParamTraits {
                pub _address: u8,
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct VariantType {
            pub _address: u8,
        }
        pub type VariantType_Type<T> = T;
        extern "C" {
            #[link_name = "\u{1}index"]
            pub static VariantIndex_index: usize;
        }
        #[doc = " # mozilla::Variant\n\n A variant / tagged union / heterogenous disjoint union / sum-type template\n class. Similar in concept to (but not derived from) `boost::variant`.\n\n Sometimes, you may wish to use a C union with non-POD types. However, this is\n forbidden in C++ because it is not clear which type in the union should have\n its constructor and destructor run on creation and deletion\n respectively. This is the problem that `mozilla::Variant` solves.\n\n ## Usage\n\n A `mozilla::Variant` instance is constructed (via move or copy) from one of\n its variant types (ignoring const and references). It does *not* support\n construction from subclasses of variant types or types that coerce to one of\n the variant types.\n\n     Variant<char, uint32_t> v1('a');\n     Variant<UniquePtr<A>, B, C> v2(MakeUnique<A>());\n     Variant<bool, char> v3(VariantType<char>, 0); // disambiguation needed\n     Variant<int, int> v4(VariantIndex<1>, 0); // 2nd int\n\n Because specifying the full type of a Variant value is often verbose,\n there are two easier ways to construct values:\n\n A. AsVariant() can be used to construct a Variant value using type inference\n in contexts such as expressions or when returning values from functions.\n Because AsVariant() must copy or move the value into a temporary and this\n cannot necessarily be elided by the compiler, it's mostly appropriate only\n for use with primitive or very small types.\n\n     Variant<char, uint32_t> Foo() { return AsVariant('x'); }\n     // ...\n     Variant<char, uint32_t> v1 = Foo();  // v1 holds char('x').\n\n B. Brace-construction with VariantType or VariantIndex; this also allows\n in-place construction with any number of arguments.\n\n     struct AB { AB(int, int){...} };\n     static Variant<AB, bool> foo()\n     {\n       return {VariantIndex<0>{}, 1, 2};\n     }\n     // ...\n     Variant<AB, bool> v0 = Foo();  // v0 holds AB(1,2).\n\n All access to the contained value goes through type-safe accessors.\n Either the stored type, or the type index may be provided.\n\n     void\n     Foo(Variant<A, B, C> v)\n     {\n       if (v.is<A>()) {\n         A& ref = v.as<A>();\n         ...\n       } else (v.is<1>()) { // Instead of v.is<B>.\n         ...\n       } else {\n         ...\n       }\n     }\n\n In some situation, a Variant may be constructed from templated types, in\n which case it is possible that the same type could be given multiple times by\n an external developer. Or seemingly-different types could be aliases.\n In this case, repeated types can only be accessed through their index, to\n prevent ambiguous access by type.\n\n    // Bad!\n    template <typename T>\n    struct ResultOrError\n    {\n      Variant<T, int> m;\n      ResultOrError() : m(int(0)) {} // Error '0' by default\n      ResultOrError(const T& r) : m(r) {}\n      bool IsResult() const { return m.is<T>(); }\n      bool IsError() const { return m.is<int>(); }\n    };\n    // Now instantiante with the result being an int too:\n    ResultOrError<int> myResult(123); // Fail!\n    // In Variant<int, int>, which 'int' are we refering to, from inside\n    // ResultOrError functions?\n\n    // Good!\n    template <typename T>\n    struct ResultOrError\n    {\n      Variant<T, int> m;\n      ResultOrError() : m(VariantIndex<1>{}, 0) {} // Error '0' by default\n      ResultOrError(const T& r) : m(VariantIndex<0>{}, r) {}\n      bool IsResult() const { return m.is<0>(); } // 0 -> T\n      bool IsError() const { return m.is<1>(); } // 1 -> int\n    };\n    // Now instantiante with the result being an int too:\n    ResultOrError<int> myResult(123); // It now works!\n\n Attempting to use the contained value as type `T1` when the `Variant`\n instance contains a value of type `T2` causes an assertion failure.\n\n     A a;\n     Variant<A, B, C> v(a);\n     v.as<B>(); // <--- Assertion failure!\n\n Trying to use a `Variant<Ts...>` instance as some type `U` that is not a\n member of the set of `Ts...` is a compiler error.\n\n     A a;\n     Variant<A, B, C> v(a);\n     v.as<SomeRandomType>(); // <--- Compiler error!\n\n Additionally, you can turn a `Variant` that `is<T>` into a `T` by moving it\n out of the containing `Variant` instance with the `extract<T>` method:\n\n     Variant<UniquePtr<A>, B, C> v(MakeUnique<A>());\n     auto ptr = v.extract<UniquePtr<A>>();\n\n Finally, you can exhaustively match on the contained variant and branch into\n different code paths depending on which type is contained. This is preferred\n to manually checking every variant type T with is<T>() because it provides\n compile-time checking that you handled every type, rather than runtime\n assertion failures.\n\n     // Bad!\n     char* foo(Variant<A, B, C, D>& v) {\n       if (v.is<A>()) {\n         return ...;\n       } else if (v.is<B>()) {\n         return ...;\n       } else {\n         return doSomething(v.as<C>()); // Forgot about case D!\n       }\n     }\n\n     // Instead, a single function object (that can deal with all possible\n     // options) may be provided:\n     struct FooMatcher\n     {\n       // The return type of all matchers must be identical.\n       char* operator()(A& a) { ... }\n       char* operator()(B& b) { ... }\n       char* operator()(C& c) { ... }\n       char* operator()(D& d) { ... } // Compile-time error to forget D!\n     }\n     char* foo(Variant<A, B, C, D>& v) {\n       return v.match(FooMatcher());\n     }\n\n     // In some situations, a single generic lambda may also be appropriate:\n     char* foo(Variant<A, B, C, D>& v) {\n       return v.match([](auto&) {...});\n     }\n\n     // Alternatively, multiple function objects may be provided, each one\n     // corresponding to an option, in the same order:\n     char* foo(Variant<A, B, C, D>& v) {\n       return v.match([](A&) { ... },\n                      [](B&) { ... },\n                      [](C&) { ... },\n                      [](D&) { ... });\n     }\n\n     // In rare cases, the index of the currently-active alternative is\n     // needed, it may be obtained by adding a first parameter in the matcner\n     // callback, which will receive the index in its most compact type (just\n     // use `size_t` if the exact type is not important), e.g.:\n     char* foo(Variant<A, B, C, D>& v) {\n       return v.match([](auto aIndex, auto& aAlternative) {...});\n       // --OR--\n       return v.match([](size_t aIndex, auto& aAlternative) {...});\n     }\n\n ## Examples\n\n A tree is either an empty leaf, or a node with a value and two children:\n\n     struct Leaf { };\n\n     template<typename T>\n     struct Node\n     {\n       T value;\n       Tree<T>* left;\n       Tree<T>* right;\n     };\n\n     template<typename T>\n     using Tree = Variant<Leaf, Node<T>>;\n\n A copy-on-write string is either a non-owning reference to some existing\n string, or an owning reference to our copy:\n\n     class CopyOnWriteString\n     {\n       Variant<const char*, UniquePtr<char[]>> string;\n\n       ...\n     };\n\n Because Variant must be aligned suitable to hold any value stored within it,\n and because |alignas| requirements don't affect platform ABI with respect to\n how parameters are laid out in memory, Variant can't be used as the type of a\n function parameter.  Pass Variant to functions by pointer or reference\n instead."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct Variant {
            pub _address: u8,
        }
        pub type Variant_Tag = root::mozilla::detail::VariantTag;
        pub type Variant_Impl = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct FloatingPoint {
            pub _address: u8,
        }
        pub type FloatingPoint_Base = root::mozilla::detail::FloatingPointTrait;
        #[doc = " An unsigned integral type suitable for accessing the bitwise representation\n of T."]
        pub type FloatingPoint_Bits = root::mozilla::FloatingPoint_Base;
        pub type InfinityBits_Traits = root::mozilla::FloatingPoint;
        pub type SpecificNaNBits_Traits = root::mozilla::FloatingPoint;
        #[doc = " EnumSet<T, U> is a set of values defined by an enumeration. It is implemented\n using a bit mask with the size of U for each value. It works both for enum\n and enum class types. EnumSet also works with U being a BitSet."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct EnumSet<Serialized> {
            pub mBitField: Serialized,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<Serialized>>,
        }
        pub type EnumSet_valueType<T> = T;
        pub type EnumSet_serializedType<Serialized> = Serialized;
        #[repr(C)]
        #[derive(Debug)]
        pub struct EnumSet_ConstIterator<Serialized> {
            pub mSet: *const root::mozilla::EnumSet<Serialized>,
            pub mPos: u32,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<Serialized>>,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct RangedPtr<T> {
            pub mPtr: *mut T,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<T>>,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct Range<T> {
            pub mStart: root::mozilla::RangedPtr<T>,
            pub mEnd: root::mozilla::RangedPtr<T>,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<T>>,
        }
        #[doc = " Tuple is a class that stores zero or more objects, whose types are specified\n as template parameters. It can be thought of as a generalization of\n std::pair, (which can be thought of as a 2-tuple).\n\n Tuple allows index-based access to its elements (with the index having to be\n known at compile time) via the non-member function 'Get<N>(tuple)'."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct Tuple {
            pub _address: u8,
        }
        pub type Tuple_Impl = u8;
        #[test]
        fn __bindgen_test_layout_Tuple_open0_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::mozilla::Tuple>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::mozilla::Tuple)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::mozilla::Tuple>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::mozilla::Tuple)
                )
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct BufferList {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct BufferList_Segment {
            pub mData: *mut ::std::os::raw::c_char,
            pub mSize: usize,
            pub mCapacity: usize,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct BufferList_IterImpl {
            pub mSegment: usize,
            pub mData: *mut ::std::os::raw::c_char,
            pub mDataEnd: *mut ::std::os::raw::c_char,
            pub mAbsoluteOffset: usize,
        }
        #[doc = " A code unit within a UTF-8 encoded string.  (A code unit is the smallest\n unit within the Unicode encoding of a string.  For UTF-8 this is an 8-bit\n number; for UTF-16 it would be a 16-bit number.)\n\n This is *not* the same as a single code point: in UTF-8, non-ASCII code\n points are constituted by multiple code units."]
        #[repr(C)]
        #[derive(Copy, Clone)]
        pub union Utf8Unit {
            pub mValue: ::std::os::raw::c_char,
        }
        #[test]
        fn bindgen_test_layout_Utf8Unit() {
            const UNINIT: ::std::mem::MaybeUninit<Utf8Unit> = ::std::mem::MaybeUninit::uninit();
            let ptr = UNINIT.as_ptr();
            assert_eq!(
                ::std::mem::size_of::<Utf8Unit>(),
                1usize,
                concat!("Size of: ", stringify!(Utf8Unit))
            );
            assert_eq!(
                ::std::mem::align_of::<Utf8Unit>(),
                1usize,
                concat!("Alignment of ", stringify!(Utf8Unit))
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).mValue) as usize - ptr as usize },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(Utf8Unit),
                    "::",
                    stringify!(mValue)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_RefPtrTraits_open0_CompilationStencil_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::mozilla::RefPtrTraits>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::mozilla::RefPtrTraits)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::mozilla::RefPtrTraits>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::mozilla::RefPtrTraits)
                )
            );
        }
        pub type TimeStampValue = u64;
        #[doc = " Platform-specific implementation details of BaseTimeDuration."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct BaseTimeDurationPlatformUtils {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_BaseTimeDurationPlatformUtils() {
            assert_eq!(
                ::std::mem::size_of::<BaseTimeDurationPlatformUtils>(),
                1usize,
                concat!("Size of: ", stringify!(BaseTimeDurationPlatformUtils))
            );
            assert_eq!(
                ::std::mem::align_of::<BaseTimeDurationPlatformUtils>(),
                1usize,
                concat!("Alignment of ", stringify!(BaseTimeDurationPlatformUtils))
            );
        }
        #[doc = " Instances of this class represent the length of an interval of time.\n Negative durations are allowed, meaning the end is before the start.\n\n Internally the duration is stored as a int64_t in units of\n PR_TicksPerSecond() when building with NSPR interval timers, or a\n system-dependent unit when building with system clocks.  The\n system-dependent unit must be constant, otherwise the semantics of\n this class would be broken.\n\n The ValueCalculator template parameter determines how arithmetic\n operations are performed on the integer count of ticks (mValue)."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct BaseTimeDuration {
            pub mValue: i64,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct BaseTimeDuration__SomethingVeryRandomHere {
            _unused: [u8; 0],
        }
        #[doc = " Perform arithmetic operations on the value of a BaseTimeDuration without\n doing strict checks on the range of values."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct TimeDurationValueCalculator {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_TimeDurationValueCalculator() {
            assert_eq!(
                ::std::mem::size_of::<TimeDurationValueCalculator>(),
                1usize,
                concat!("Size of: ", stringify!(TimeDurationValueCalculator))
            );
            assert_eq!(
                ::std::mem::align_of::<TimeDurationValueCalculator>(),
                1usize,
                concat!("Alignment of ", stringify!(TimeDurationValueCalculator))
            );
        }
        #[doc = " Specialization of BaseTimeDuration that uses TimeDurationValueCalculator for\n arithmetic on the mValue member.\n\n Use this class for time durations that are *not* expected to hold values of\n Forever (or the negative equivalent) or when such time duration are *not*\n expected to be used in arithmetic operations."]
        pub type TimeDuration = root::mozilla::BaseTimeDuration;
        #[doc = " Instances of this class represent moments in time, or a special\n \"null\" moment. We do not use the non-monotonic system clock or\n local time, since they can be reset, causing apparent backward\n travel in time, which can confuse algorithms. Instead we measure\n elapsed time according to the system.  This time can never go\n backwards (i.e. it never wraps around, at least not in less than\n five million years of system elapsed time). It might not advance\n while the system is sleeping. If TimeStamp::SetNow() is not called\n at all for hours or days, we might not notice the passage of some\n of that time.\n\n We deliberately do not expose a way to convert TimeStamps to some\n particular unit. All you can do is compute a difference between two\n TimeStamps to get a TimeDuration. You can also add a TimeDuration\n to a TimeStamp to get a new TimeStamp. You can't do something\n meaningless like add two TimeStamps.\n\n Internally this is implemented as either a wrapper around\n   - high-resolution, monotonic, system clocks if they exist on this\n     platform\n   - PRIntervalTime otherwise.  We detect wraparounds of\n     PRIntervalTime and work around them.\n\n This class is similar to C++11's time_point, however it is\n explicitly nullable and provides an IsNull() method. time_point\n is initialized to the clock's epoch and provides a\n time_since_epoch() method that functions similiarly. i.e.\n t.IsNull() is equivalent to t.time_since_epoch() ==\n decltype(t)::duration::zero();\n\n Note that, since TimeStamp objects are small, prefer to pass them by value\n unless there is a specific reason not to do so."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct TimeStamp {
            #[doc = " When built with PRIntervalTime, a value of 0 means this instance\n is \"null\". Otherwise, the low 32 bits represent a PRIntervalTime,\n and the high 32 bits represent a counter of the number of\n rollovers of PRIntervalTime that we've seen. This counter starts\n at 1 to avoid a real time colliding with the \"null\" value.\n\n PR_INTERVAL_MAX is set at 100,000 ticks per second. So the minimum\n time to wrap around is about 2^64/100000 seconds, i.e. about\n 5,849,424 years.\n\n When using a system clock, a value is system dependent."]
            pub mValue: root::mozilla::TimeStampValue,
        }
        #[test]
        fn bindgen_test_layout_TimeStamp() {
            const UNINIT: ::std::mem::MaybeUninit<TimeStamp> = ::std::mem::MaybeUninit::uninit();
            let ptr = UNINIT.as_ptr();
            assert_eq!(
                ::std::mem::size_of::<TimeStamp>(),
                8usize,
                concat!("Size of: ", stringify!(TimeStamp))
            );
            assert_eq!(
                ::std::mem::align_of::<TimeStamp>(),
                8usize,
                concat!("Alignment of ", stringify!(TimeStamp))
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).mValue) as usize - ptr as usize },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(TimeStamp),
                    "::",
                    stringify!(mValue)
                )
            );
        }
    }
    pub mod js {
        #[allow(unused_imports)]
        use self::super::super::root;
        pub mod detail {
            #[allow(unused_imports)]
            use self::super::super::super::root;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct TypeIsGCThing {
                pub _base: root::std::false_type,
            }
            #[test]
            fn __bindgen_test_layout_TypeIsGCThing_open0_Value_close0_instantiation() {
                assert_eq!(
                    ::std::mem::size_of::<root::js::detail::TypeIsGCThing>(),
                    1usize,
                    concat!(
                        "Size of template specialization: ",
                        stringify!(root::js::detail::TypeIsGCThing)
                    )
                );
                assert_eq!(
                    ::std::mem::align_of::<root::js::detail::TypeIsGCThing>(),
                    1usize,
                    concat!(
                        "Alignment of template specialization: ",
                        stringify!(root::js::detail::TypeIsGCThing)
                    )
                );
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct UniqueSelector {
                pub _address: u8,
            }
            #[doc = " UniquePtr is a smart pointer that wholly owns a resource.  Ownership may be\n transferred out of a UniquePtr through explicit action, but otherwise the\n resource is destroyed when the UniquePtr is destroyed.\n\n UniquePtr is similar to C++98's std::auto_ptr, but it improves upon auto_ptr\n in one crucial way: it's impossible to copy a UniquePtr.  Copying an auto_ptr\n obviously *can't* copy ownership of its singly-owned resource.  So what\n happens if you try to copy one?  Bizarrely, ownership is implicitly\n *transferred*, preserving single ownership but breaking code that assumes a\n copy of an object is identical to the original.  (This is why auto_ptr is\n prohibited in STL containers.)\n\n UniquePtr solves this problem by being *movable* rather than copyable.\n Instead of passing a |UniquePtr u| directly to the constructor or assignment\n operator, you pass |Move(u)|.  In doing so you indicate that you're *moving*\n ownership out of |u|, into the target of the construction/assignment.  After\n the transfer completes, |u| contains |nullptr| and may be safely destroyed.\n This preserves single ownership but also allows UniquePtr to be moved by\n algorithms that have been made move-safe.  (Note: if |u| is instead a\n temporary expression, don't use |Move()|: just pass the expression, because\n it's already move-ready.  For more information see Move.h.)\n\n UniquePtr is also better than std::auto_ptr in that the deletion operation is\n customizable.  An optional second template parameter specifies a class that\n (through its operator()(T*)) implements the desired deletion policy.  If no\n policy is specified, mozilla::DefaultDelete<T> is used -- which will either\n |delete| or |delete[]| the resource, depending whether the resource is an\n array.  Custom deletion policies ideally should be empty classes (no member\n fields, no member fields in base classes, no virtual methods/inheritance),\n because then UniquePtr can be just as efficient as a raw pointer.\n\n Use of UniquePtr proceeds like so:\n\n   UniquePtr<int> g1; // initializes to nullptr\n   g1.reset(new int); // switch resources using reset()\n   g1 = nullptr; // clears g1, deletes the int\n\n   UniquePtr<int> g2(new int); // owns that int\n   int* p = g2.release(); // g2 leaks its int -- still requires deletion\n   delete p; // now freed\n\n   struct S { int x; S(int x) : x(x) {} };\n   UniquePtr<S> g3, g4(new S(5));\n   g3 = std::move(g4); // g3 owns the S, g4 cleared\n   S* p = g3.get(); // g3 still owns |p|\n   assert(g3->x == 5); // operator-> works (if .get() != nullptr)\n   assert((*g3).x == 5); // also operator* (again, if not cleared)\n   std::swap(g3, g4); // g4 now owns the S, g3 cleared\n   g3.swap(g4);  // g3 now owns the S, g4 cleared\n   UniquePtr<S> g5(std::move(g3)); // g5 owns the S, g3 cleared\n   g5.reset(); // deletes the S, g5 cleared\n\n   struct FreePolicy { void operator()(void* p) { free(p); } };\n   UniquePtr<int, FreePolicy> g6(static_cast<int*>(malloc(sizeof(int))));\n   int* ptr = g6.get();\n   g6 = nullptr; // calls free(ptr)\n\n Now, carefully note a few things you *can't* do:\n\n   UniquePtr<int> b1;\n   b1 = new int; // BAD: can only assign another UniquePtr\n   int* ptr = b1; // BAD: no auto-conversion to pointer, use get()\n\n   UniquePtr<int> b2(b1); // BAD: can't copy a UniquePtr\n   UniquePtr<int> b3 = b1; // BAD: can't copy-assign a UniquePtr\n\n (Note that changing a UniquePtr to store a direct |new| expression is\n permitted, but usually you should use MakeUnique, defined at the end of this\n header.)\n\n A few miscellaneous notes:\n\n UniquePtr, when not instantiated for an array type, can be move-constructed\n and move-assigned, not only from itself but from \"derived\" UniquePtr<U, E>\n instantiations where U converts to T and E converts to D.  If you want to use\n this, you're going to have to specify a deletion policy for both UniquePtr\n instantations, and T pretty much has to have a virtual destructor.  In other\n words, this doesn't work:\n\n   struct Base { virtual ~Base() {} };\n   struct Derived : Base {};\n\n   UniquePtr<Base> b1;\n   // BAD: DefaultDelete<Base> and DefaultDelete<Derived> don't interconvert\n   UniquePtr<Derived> d1(std::move(b));\n\n   UniquePtr<Base> b2;\n   UniquePtr<Derived, DefaultDelete<Base>> d2(std::move(b2)); // okay\n\n UniquePtr is specialized for array types.  Specializing with an array type\n creates a smart-pointer version of that array -- not a pointer to such an\n array.\n\n   UniquePtr<int[]> arr(new int[5]);\n   arr[0] = 4;\n\n What else is different?  Deletion of course uses |delete[]|.  An operator[]\n is provided.  Functionality that doesn't make sense for arrays is removed.\n The constructors and mutating methods only accept array pointers (not T*, U*\n that converts to T*, or UniquePtr<U[]> or UniquePtr<U>) or |nullptr|.\n\n It's perfectly okay for a function to return a UniquePtr. This transfers\n the UniquePtr's sole ownership of the data, to the fresh UniquePtr created\n in the calling function, that will then solely own that data. Such functions\n can return a local variable UniquePtr, |nullptr|, |UniquePtr(ptr)| where\n |ptr| is a |T*|, or a UniquePtr |Move()|'d from elsewhere.\n\n UniquePtr will commonly be a member of a class, with lifetime equivalent to\n that of that class.  If you want to expose the related resource, you could\n expose a raw pointer via |get()|, but ownership of a raw pointer is\n inherently unclear.  So it's better to expose a |const UniquePtr&| instead.\n This prohibits mutation but still allows use of |get()| when needed (but\n operator-> is preferred).  Of course, you can only use this smart pointer as\n long as the enclosing class instance remains live -- no different than if you\n exposed the |get()| raw pointer.\n\n To pass a UniquePtr-managed resource as a pointer, use a |const UniquePtr&|\n argument.  To specify an inout parameter (where the method may or may not\n take ownership of the resource, or reset it), or to specify an out parameter\n (where simply returning a |UniquePtr| isn't possible), use a |UniquePtr&|\n argument.  To unconditionally transfer ownership of a UniquePtr\n into a method, use a |UniquePtr| argument.  To conditionally transfer\n ownership of a resource into a method, should the method want it, use a\n |UniquePtr&&| argument."]
            pub type UniqueSelector_SingleObject = u8;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct PtrBarrierMethodsBase {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct ProxyReservedSlots {
                pub slots: [root::JS::Value; 1usize],
            }
            #[test]
            fn bindgen_test_layout_ProxyReservedSlots() {
                const UNINIT: ::std::mem::MaybeUninit<ProxyReservedSlots> =
                    ::std::mem::MaybeUninit::uninit();
                let ptr = UNINIT.as_ptr();
                assert_eq!(
                    ::std::mem::size_of::<ProxyReservedSlots>(),
                    8usize,
                    concat!("Size of: ", stringify!(ProxyReservedSlots))
                );
                assert_eq!(
                    ::std::mem::align_of::<ProxyReservedSlots>(),
                    8usize,
                    concat!("Alignment of ", stringify!(ProxyReservedSlots))
                );
                assert_eq!(
                    unsafe { ::std::ptr::addr_of!((*ptr).slots) as usize - ptr as usize },
                    0usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(ProxyReservedSlots),
                        "::",
                        stringify!(slots)
                    )
                );
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct ProxyValueArray {
                pub expandoSlot: root::JS::Value,
                pub privateSlot: root::JS::Value,
                pub reservedSlots: root::js::detail::ProxyReservedSlots,
            }
            #[test]
            fn bindgen_test_layout_ProxyValueArray() {
                const UNINIT: ::std::mem::MaybeUninit<ProxyValueArray> =
                    ::std::mem::MaybeUninit::uninit();
                let ptr = UNINIT.as_ptr();
                assert_eq!(
                    ::std::mem::size_of::<ProxyValueArray>(),
                    24usize,
                    concat!("Size of: ", stringify!(ProxyValueArray))
                );
                assert_eq!(
                    ::std::mem::align_of::<ProxyValueArray>(),
                    8usize,
                    concat!("Alignment of ", stringify!(ProxyValueArray))
                );
                assert_eq!(
                    unsafe { ::std::ptr::addr_of!((*ptr).expandoSlot) as usize - ptr as usize },
                    0usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(ProxyValueArray),
                        "::",
                        stringify!(expandoSlot)
                    )
                );
                assert_eq!(
                    unsafe { ::std::ptr::addr_of!((*ptr).privateSlot) as usize - ptr as usize },
                    8usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(ProxyValueArray),
                        "::",
                        stringify!(privateSlot)
                    )
                );
                assert_eq!(
                    unsafe { ::std::ptr::addr_of!((*ptr).reservedSlots) as usize - ptr as usize },
                    16usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(ProxyValueArray),
                        "::",
                        stringify!(reservedSlots)
                    )
                );
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct ProxyDataLayout {
                pub reservedSlots: *mut root::js::detail::ProxyReservedSlots,
                pub handler: *const root::js::BaseProxyHandler,
            }
            #[test]
            fn bindgen_test_layout_ProxyDataLayout() {
                const UNINIT: ::std::mem::MaybeUninit<ProxyDataLayout> =
                    ::std::mem::MaybeUninit::uninit();
                let ptr = UNINIT.as_ptr();
                assert_eq!(
                    ::std::mem::size_of::<ProxyDataLayout>(),
                    16usize,
                    concat!("Size of: ", stringify!(ProxyDataLayout))
                );
                assert_eq!(
                    ::std::mem::align_of::<ProxyDataLayout>(),
                    8usize,
                    concat!("Alignment of ", stringify!(ProxyDataLayout))
                );
                assert_eq!(
                    unsafe { ::std::ptr::addr_of!((*ptr).reservedSlots) as usize - ptr as usize },
                    0usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(ProxyDataLayout),
                        "::",
                        stringify!(reservedSlots)
                    )
                );
                assert_eq!(
                    unsafe { ::std::ptr::addr_of!((*ptr).handler) as usize - ptr as usize },
                    8usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(ProxyDataLayout),
                        "::",
                        stringify!(handler)
                    )
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN2js6detail15SetValueInProxyEPN2JS5ValueERKS2_"]
                pub fn SetValueInProxy(slot: *mut root::JS::Value, value: *const root::JS::Value);
            }
            extern "C" {
                #[link_name = "\u{1}_ZN2js6detail12IsWindowSlowEP8JSObject"]
                pub fn IsWindowSlow(obj: *mut root::JSObject) -> bool;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN2js6detail25ToWindowProxyIfWindowSlowEP8JSObject"]
                pub fn ToWindowProxyIfWindowSlow(obj: *mut root::JSObject) -> *mut root::JSObject;
            }
        }
        pub type Vector = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct BaseScript {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct BaseShape {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct GetterSetter {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct PropMap {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct RegExpShared {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct Shape {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct Scope {
            _unused: [u8; 0],
        }
        pub mod jit {
            #[allow(unused_imports)]
            use self::super::super::super::root;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct JitCode {
                _unused: [u8; 0],
            }
            #[repr(u16)]
            #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
            pub enum InlinableNative {
                __bindgen_cannot_repr_c_on_empty_enum = 0,
            }
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js29CurrentThreadCanAccessRuntimeEPK9JSRuntime"]
            pub fn CurrentThreadCanAccessRuntime(rt: *const root::JSRuntime) -> bool;
        }
        pub mod gc {
            #[allow(unused_imports)]
            use self::super::super::super::root;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct Cell {
                _unused: [u8; 0],
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct Arena {
                _unused: [u8; 0],
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct TenuredChunk {
                _unused: [u8; 0],
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct StoreBuffer {
                _unused: [u8; 0],
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct TenuredCell {
                _unused: [u8; 0],
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct ChunkBase {
                pub storeBuffer: *mut root::js::gc::StoreBuffer,
                pub runtime: *mut root::JSRuntime,
            }
            #[test]
            fn bindgen_test_layout_ChunkBase() {
                const UNINIT: ::std::mem::MaybeUninit<ChunkBase> =
                    ::std::mem::MaybeUninit::uninit();
                let ptr = UNINIT.as_ptr();
                assert_eq!(
                    ::std::mem::size_of::<ChunkBase>(),
                    16usize,
                    concat!("Size of: ", stringify!(ChunkBase))
                );
                assert_eq!(
                    ::std::mem::align_of::<ChunkBase>(),
                    8usize,
                    concat!("Alignment of ", stringify!(ChunkBase))
                );
                assert_eq!(
                    unsafe { ::std::ptr::addr_of!((*ptr).storeBuffer) as usize - ptr as usize },
                    0usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(ChunkBase),
                        "::",
                        stringify!(storeBuffer)
                    )
                );
                assert_eq!(
                    unsafe { ::std::ptr::addr_of!((*ptr).runtime) as usize - ptr as usize },
                    8usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(ChunkBase),
                        "::",
                        stringify!(runtime)
                    )
                );
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct TenuredChunkInfo {
                pub next: *mut root::js::gc::TenuredChunk,
                pub prev: *mut root::js::gc::TenuredChunk,
                pub numArenasFree: u32,
                pub numArenasFreeCommitted: u32,
            }
            #[test]
            fn bindgen_test_layout_TenuredChunkInfo() {
                const UNINIT: ::std::mem::MaybeUninit<TenuredChunkInfo> =
                    ::std::mem::MaybeUninit::uninit();
                let ptr = UNINIT.as_ptr();
                assert_eq!(
                    ::std::mem::size_of::<TenuredChunkInfo>(),
                    24usize,
                    concat!("Size of: ", stringify!(TenuredChunkInfo))
                );
                assert_eq!(
                    ::std::mem::align_of::<TenuredChunkInfo>(),
                    8usize,
                    concat!("Alignment of ", stringify!(TenuredChunkInfo))
                );
                assert_eq!(
                    unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
                    0usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(TenuredChunkInfo),
                        "::",
                        stringify!(next)
                    )
                );
                assert_eq!(
                    unsafe { ::std::ptr::addr_of!((*ptr).prev) as usize - ptr as usize },
                    8usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(TenuredChunkInfo),
                        "::",
                        stringify!(prev)
                    )
                );
                assert_eq!(
                    unsafe { ::std::ptr::addr_of!((*ptr).numArenasFree) as usize - ptr as usize },
                    16usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(TenuredChunkInfo),
                        "::",
                        stringify!(numArenasFree)
                    )
                );
                assert_eq!(
                    unsafe {
                        ::std::ptr::addr_of!((*ptr).numArenasFreeCommitted) as usize - ptr as usize
                    },
                    20usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(TenuredChunkInfo),
                        "::",
                        stringify!(numArenasFreeCommitted)
                    )
                );
            }
            #[doc = " Atomic<T> implementation for integral types.\n\n In addition to atomic store and load operations, compound assignment and\n increment/decrement operators are implemented which perform the\n corresponding read-modify-write operation atomically.  Finally, an atomic\n swap method is provided."]
            pub type MarkBitmapWord = u64;
            #[repr(u32)]
            #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
            pub enum ColorBit {
                BlackBit = 0,
                GrayOrBlackBit = 1,
            }
            #[repr(u8)]
            #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
            pub enum MarkColor {
                Gray = 1,
                Black = 2,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct MarkBitmap {
                pub bitmap: [root::js::gc::MarkBitmapWord; 2016usize],
            }
            pub const MarkBitmap_WordCount: usize = 2016;
            #[test]
            fn bindgen_test_layout_MarkBitmap() {
                const UNINIT: ::std::mem::MaybeUninit<MarkBitmap> =
                    ::std::mem::MaybeUninit::uninit();
                let ptr = UNINIT.as_ptr();
                assert_eq!(
                    ::std::mem::size_of::<MarkBitmap>(),
                    16128usize,
                    concat!("Size of: ", stringify!(MarkBitmap))
                );
                assert_eq!(
                    ::std::mem::align_of::<MarkBitmap>(),
                    8usize,
                    concat!("Alignment of ", stringify!(MarkBitmap))
                );
                assert_eq!(
                    unsafe { ::std::ptr::addr_of!((*ptr).bitmap) as usize - ptr as usize },
                    0usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(MarkBitmap),
                        "::",
                        stringify!(bitmap)
                    )
                );
            }
            #[doc = " An object like std::bitset but which provides access to the underlying\n storage.\n\n The limited API is due to expedience only; feel free to flesh out any\n std::bitset-like members."]
            pub type ChunkPageBitmap = [u32; 8usize];
            #[doc = " An object like std::bitset but which provides access to the underlying\n storage.\n\n The limited API is due to expedience only; feel free to flesh out any\n std::bitset-like members."]
            pub type ChunkArenaBitmap = [u32; 8usize];
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct TenuredChunkBase {
                pub _base: root::js::gc::ChunkBase,
                pub info: root::js::gc::TenuredChunkInfo,
                pub markBits: root::js::gc::MarkBitmap,
                pub freeCommittedArenas: root::js::gc::ChunkArenaBitmap,
                pub decommittedPages: root::js::gc::ChunkPageBitmap,
            }
            #[test]
            fn bindgen_test_layout_TenuredChunkBase() {
                const UNINIT: ::std::mem::MaybeUninit<TenuredChunkBase> =
                    ::std::mem::MaybeUninit::uninit();
                let ptr = UNINIT.as_ptr();
                assert_eq!(
                    ::std::mem::size_of::<TenuredChunkBase>(),
                    16232usize,
                    concat!("Size of: ", stringify!(TenuredChunkBase))
                );
                assert_eq!(
                    ::std::mem::align_of::<TenuredChunkBase>(),
                    8usize,
                    concat!("Alignment of ", stringify!(TenuredChunkBase))
                );
                assert_eq!(
                    unsafe { ::std::ptr::addr_of!((*ptr).info) as usize - ptr as usize },
                    16usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(TenuredChunkBase),
                        "::",
                        stringify!(info)
                    )
                );
                assert_eq!(
                    unsafe { ::std::ptr::addr_of!((*ptr).markBits) as usize - ptr as usize },
                    40usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(TenuredChunkBase),
                        "::",
                        stringify!(markBits)
                    )
                );
                assert_eq!(
                    unsafe {
                        ::std::ptr::addr_of!((*ptr).freeCommittedArenas) as usize - ptr as usize
                    },
                    16168usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(TenuredChunkBase),
                        "::",
                        stringify!(freeCommittedArenas)
                    )
                );
                assert_eq!(
                    unsafe {
                        ::std::ptr::addr_of!((*ptr).decommittedPages) as usize - ptr as usize
                    },
                    16200usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(TenuredChunkBase),
                        "::",
                        stringify!(decommittedPages)
                    )
                );
            }
            pub mod detail {
                #[allow(unused_imports)]
                use self::super::super::super::super::root;
                extern "C" {
                    #[link_name = "\u{1}_ZN2js2gc6detail16CanCheckGrayBitsEPKNS0_11TenuredCellE"]
                    pub fn CanCheckGrayBits(cell: *const root::js::gc::TenuredCell) -> bool;
                }
                extern "C" {
                    #[link_name = "\u{1}_ZN2js2gc6detail23CellIsMarkedGrayIfKnownEPKNS0_11TenuredCellE"]
                    pub fn CellIsMarkedGrayIfKnown(cell: *const root::js::gc::TenuredCell) -> bool;
                }
            }
            extern "C" {
                #[link_name = "\u{1}_ZN2js2gc29PerformIncrementalReadBarrierEN2JS9GCCellPtrE"]
                pub fn PerformIncrementalReadBarrier(thing: root::JS::GCCellPtr);
            }
            extern "C" {
                #[link_name = "\u{1}_ZN2js2gc17TraceExternalEdgeEP8JSTracerPPN2JS6BigIntEPKc"]
                pub fn TraceExternalEdge(
                    trc: *mut root::JSTracer,
                    thingp: *mut *mut root::JS::BigInt,
                    name: *const ::std::os::raw::c_char,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN2js2gc17TraceExternalEdgeEP8JSTracerPPN2JS6SymbolEPKc"]
                pub fn TraceExternalEdge1(
                    trc: *mut root::JSTracer,
                    thingp: *mut *mut root::JS::Symbol,
                    name: *const ::std::os::raw::c_char,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN2js2gc17TraceExternalEdgeEP8JSTracerPP6JSAtomPKc"]
                pub fn TraceExternalEdge2(
                    trc: *mut root::JSTracer,
                    thingp: *mut *mut root::JSAtom,
                    name: *const ::std::os::raw::c_char,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN2js2gc17TraceExternalEdgeEP8JSTracerPP10JSFunctionPKc"]
                pub fn TraceExternalEdge3(
                    trc: *mut root::JSTracer,
                    thingp: *mut *mut root::JSFunction,
                    name: *const ::std::os::raw::c_char,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN2js2gc17TraceExternalEdgeEP8JSTracerPP14JSLinearStringPKc"]
                pub fn TraceExternalEdge4(
                    trc: *mut root::JSTracer,
                    thingp: *mut *mut root::JSLinearString,
                    name: *const ::std::os::raw::c_char,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN2js2gc17TraceExternalEdgeEP8JSTracerPP8JSObjectPKc"]
                pub fn TraceExternalEdge5(
                    trc: *mut root::JSTracer,
                    thingp: *mut *mut root::JSObject,
                    name: *const ::std::os::raw::c_char,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN2js2gc17TraceExternalEdgeEP8JSTracerPP8JSScriptPKc"]
                pub fn TraceExternalEdge6(
                    trc: *mut root::JSTracer,
                    thingp: *mut *mut root::JSScript,
                    name: *const ::std::os::raw::c_char,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN2js2gc17TraceExternalEdgeEP8JSTracerPP8JSStringPKc"]
                pub fn TraceExternalEdge7(
                    trc: *mut root::JSTracer,
                    thingp: *mut *mut root::JSString,
                    name: *const ::std::os::raw::c_char,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN2js2gc17TraceExternalEdgeEP8JSTracerPN2JS5ValueEPKc"]
                pub fn TraceExternalEdge8(
                    trc: *mut root::JSTracer,
                    thingp: *mut root::JS::Value,
                    name: *const ::std::os::raw::c_char,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN2js2gc17TraceExternalEdgeEP8JSTracerPN2JS11PropertyKeyEPKc"]
                pub fn TraceExternalEdge9(
                    trc: *mut root::JSTracer,
                    thingp: *mut root::JS::PropertyKey,
                    name: *const ::std::os::raw::c_char,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN2js2gc10TraceRealmEP8JSTracerPN2JS5RealmEPKc"]
                pub fn TraceRealm(
                    trc: *mut root::JSTracer,
                    realm: *mut root::JS::Realm,
                    name: *const ::std::os::raw::c_char,
                );
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct GCRuntime {
                _unused: [u8; 0],
            }
            extern "C" {
                #[doc = " Create an object providing access to the garbage collector's internal notion\n of the current state of memory (both GC heap memory and GCthing-controlled\n malloc memory."]
                #[link_name = "\u{1}_ZN2js2gc19NewMemoryInfoObjectEP9JSContext"]
                pub fn NewMemoryInfoObject(cx: *mut root::JSContext) -> *mut root::JSObject;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN2js2gc25FinalizeDeadNurseryObjectEP9JSContextP8JSObject"]
                pub fn FinalizeDeadNurseryObject(
                    cx: *mut root::JSContext,
                    obj: *mut root::JSObject,
                );
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct NurseryDecommitTask {
            _unused: [u8; 0],
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js26CurrentThreadCanAccessZoneEPN2JS4ZoneE"]
            pub fn CurrentThreadCanAccessZone(zone: *mut root::JS::Zone) -> bool;
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct GenericTracerImpl {
            pub _base: root::JSTracer,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct AbstractGeneratorObject {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct SavedFrame {
            _unused: [u8; 0],
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js32UnsafeTraceManuallyBarrieredEdgeEP8JSTracerPP8JSObjectPKc"]
            pub fn UnsafeTraceManuallyBarrieredEdge(
                trc: *mut root::JSTracer,
                edgep: *mut *mut root::JSObject,
                name: *const ::std::os::raw::c_char,
            );
        }
        pub type HashNumber = root::mozilla::HashNumber;
        pub type DefaultHasher = root::mozilla::DefaultHasher;
        pub type PointerHasher = root::mozilla::PointerHasher;
        pub type HashSet = u8;
        pub type HashMap = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct ProfilingStackFrame {
            pub label_: u64,
            pub dynamicString_: u64,
            pub spOrScript: u64,
            pub realmID_: u64,
            pub pcOffsetIfJS_: u32,
            pub flagsAndCategoryPair_: u32,
        }
        impl root::js::ProfilingStackFrame_Flags {
            pub const FLAGS_BITCOUNT: root::js::ProfilingStackFrame_Flags =
                ProfilingStackFrame_Flags::STRING_TEMPLATE_METHOD;
        }
        #[repr(u32)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub enum ProfilingStackFrame_Flags {
            IS_LABEL_FRAME = 1,
            IS_SP_MARKER_FRAME = 2,
            IS_JS_FRAME = 4,
            JS_OSR = 8,
            STRING_TEMPLATE_METHOD = 16,
            STRING_TEMPLATE_GETTER = 32,
            STRING_TEMPLATE_SETTER = 64,
            RELEVANT_FOR_JS = 128,
            LABEL_DETERMINED_BY_CATEGORY_PAIR = 256,
            NONSENSITIVE = 512,
            IS_BLINTERP_FRAME = 1024,
            FLAGS_MASK = 65535,
        }
        pub const ProfilingStackFrame_NullPCOffset: i32 = -1;
        #[test]
        fn bindgen_test_layout_ProfilingStackFrame() {
            const UNINIT: ::std::mem::MaybeUninit<ProfilingStackFrame> =
                ::std::mem::MaybeUninit::uninit();
            let ptr = UNINIT.as_ptr();
            assert_eq!(
                ::std::mem::size_of::<ProfilingStackFrame>(),
                40usize,
                concat!("Size of: ", stringify!(ProfilingStackFrame))
            );
            assert_eq!(
                ::std::mem::align_of::<ProfilingStackFrame>(),
                8usize,
                concat!("Alignment of ", stringify!(ProfilingStackFrame))
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).label_) as usize - ptr as usize },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ProfilingStackFrame),
                    "::",
                    stringify!(label_)
                )
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).dynamicString_) as usize - ptr as usize },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ProfilingStackFrame),
                    "::",
                    stringify!(dynamicString_)
                )
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).spOrScript) as usize - ptr as usize },
                16usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ProfilingStackFrame),
                    "::",
                    stringify!(spOrScript)
                )
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).realmID_) as usize - ptr as usize },
                24usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ProfilingStackFrame),
                    "::",
                    stringify!(realmID_)
                )
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).pcOffsetIfJS_) as usize - ptr as usize },
                32usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ProfilingStackFrame),
                    "::",
                    stringify!(pcOffsetIfJS_)
                )
            );
            assert_eq!(
                unsafe {
                    ::std::ptr::addr_of!((*ptr).flagsAndCategoryPair_) as usize - ptr as usize
                },
                36usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ProfilingStackFrame),
                    "::",
                    stringify!(flagsAndCategoryPair_)
                )
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js24SetContextProfilingStackEP9JSContextP14ProfilingStack"]
            pub fn SetContextProfilingStack(
                cx: *mut root::JSContext,
                profilingStack: *mut root::ProfilingStack,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js27EnableContextProfilingStackEP9JSContextb"]
            pub fn EnableContextProfilingStack(cx: *mut root::JSContext, enabled: bool);
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js35RegisterContextProfilingEventMarkerEP9JSContextPFvPKcS3_E"]
            pub fn RegisterContextProfilingEventMarker(
                cx: *mut root::JSContext,
                fn_: ::std::option::Option<
                    unsafe extern "C" fn(
                        arg1: *const ::std::os::raw::c_char,
                        arg2: *const ::std::os::raw::c_char,
                    ),
                >,
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct AutoGeckoProfilerEntry {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct GeckoProfilerEntryMarker {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct GeckoProfilerBaselineOSRMarker {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct GeckoProfilerThread {
            pub profilingStack_: *mut root::ProfilingStack,
            pub profilingStackIfEnabled_: *mut root::ProfilingStack,
        }
        #[test]
        fn bindgen_test_layout_GeckoProfilerThread() {
            const UNINIT: ::std::mem::MaybeUninit<GeckoProfilerThread> =
                ::std::mem::MaybeUninit::uninit();
            let ptr = UNINIT.as_ptr();
            assert_eq!(
                ::std::mem::size_of::<GeckoProfilerThread>(),
                16usize,
                concat!("Size of: ", stringify!(GeckoProfilerThread))
            );
            assert_eq!(
                ::std::mem::align_of::<GeckoProfilerThread>(),
                8usize,
                concat!("Alignment of ", stringify!(GeckoProfilerThread))
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).profilingStack_) as usize - ptr as usize },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(GeckoProfilerThread),
                    "::",
                    stringify!(profilingStack_)
                )
            );
            assert_eq!(
                unsafe {
                    ::std::ptr::addr_of!((*ptr).profilingStackIfEnabled_) as usize - ptr as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(GeckoProfilerThread),
                    "::",
                    stringify!(profilingStackIfEnabled_)
                )
            );
        }
        #[repr(i32)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub enum StackFormat {
            SpiderMonkey = 0,
            V8 = 1,
            Default = 2,
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js14SetStackFormatEP9JSContextNS_11StackFormatE"]
            pub fn SetStackFormat(cx: *mut root::JSContext, format: root::js::StackFormat);
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js14GetStackFormatEP9JSContext"]
            pub fn GetStackFormat(cx: *mut root::JSContext) -> root::js::StackFormat;
        }
        #[repr(u32)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub enum ThreadType {
            THREAD_TYPE_NONE = 0,
            THREAD_TYPE_MAIN = 1,
            THREAD_TYPE_WASM_COMPILE_TIER1 = 2,
            THREAD_TYPE_WASM_COMPILE_TIER2 = 3,
            THREAD_TYPE_ION = 4,
            THREAD_TYPE_PARSE = 5,
            THREAD_TYPE_COMPRESS = 6,
            THREAD_TYPE_GCPARALLEL = 7,
            THREAD_TYPE_PROMISE_TASK = 8,
            THREAD_TYPE_ION_FREE = 9,
            THREAD_TYPE_WASM_GENERATOR_TIER2 = 10,
            THREAD_TYPE_WORKER = 11,
            THREAD_TYPE_DELAZIFY = 12,
            THREAD_TYPE_DELAZIFY_FREE = 13,
            THREAD_TYPE_MAX = 14,
        }
        pub mod oom {
            #[allow(unused_imports)]
            use self::super::super::super::root;
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct AutoEnterOOMUnsafeRegion {
            pub _address: u8,
        }
        pub type AutoEnterOOMUnsafeRegion_AnnotateOOMAllocationSizeCallback =
            ::std::option::Option<unsafe extern "C" fn(arg1: usize)>;
        extern "C" {
            #[link_name = "\u{1}_ZN2js24AutoEnterOOMUnsafeRegion23annotateOOMSizeCallbackE"]
            pub static mut AutoEnterOOMUnsafeRegion_annotateOOMSizeCallback: u64;
        }
        #[test]
        fn bindgen_test_layout_AutoEnterOOMUnsafeRegion() {
            assert_eq!(
                ::std::mem::size_of::<AutoEnterOOMUnsafeRegion>(),
                1usize,
                concat!("Size of: ", stringify!(AutoEnterOOMUnsafeRegion))
            );
            assert_eq!(
                ::std::mem::align_of::<AutoEnterOOMUnsafeRegion>(),
                1usize,
                concat!("Alignment of ", stringify!(AutoEnterOOMUnsafeRegion))
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js19InitMallocAllocatorEv"]
            pub fn InitMallocAllocator();
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js23ShutDownMallocAllocatorEv"]
            pub fn ShutDownMallocAllocator();
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js34AssertJSStringBufferInCorrectArenaEPKv"]
            pub fn AssertJSStringBufferInCorrectArena(ptr: *const ::std::os::raw::c_void);
        }
        pub type UniquePtr = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct BarrierMethods {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct WrappedPtrOperations {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct MutableWrappedPtrOperations {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct RootedOperations {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct HandleOperations {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct MutableHandleOperations {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct HeapOperations {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct IsHeapConstructibleType {
            pub _base: root::std::false_type,
        }
        #[test]
        fn __bindgen_test_layout_IsHeapConstructibleType_open0_ptr_BigInt_void_close0_instantiation(
        ) {
            assert_eq!(
                ::std::mem::size_of::<root::js::IsHeapConstructibleType>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::js::IsHeapConstructibleType)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::js::IsHeapConstructibleType>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::js::IsHeapConstructibleType)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_IsHeapConstructibleType_open0_ptr_Symbol_void_close0_instantiation(
        ) {
            assert_eq!(
                ::std::mem::size_of::<root::js::IsHeapConstructibleType>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::js::IsHeapConstructibleType)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::js::IsHeapConstructibleType>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::js::IsHeapConstructibleType)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_IsHeapConstructibleType_open0_ptr_JSAtom_void_close0_instantiation(
        ) {
            assert_eq!(
                ::std::mem::size_of::<root::js::IsHeapConstructibleType>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::js::IsHeapConstructibleType)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::js::IsHeapConstructibleType>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::js::IsHeapConstructibleType)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_IsHeapConstructibleType_open0_ptr_JSFunction_void_close0_instantiation(
        ) {
            assert_eq!(
                ::std::mem::size_of::<root::js::IsHeapConstructibleType>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::js::IsHeapConstructibleType)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::js::IsHeapConstructibleType>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::js::IsHeapConstructibleType)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_IsHeapConstructibleType_open0_ptr_JSLinearString_void_close0_instantiation(
        ) {
            assert_eq!(
                ::std::mem::size_of::<root::js::IsHeapConstructibleType>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::js::IsHeapConstructibleType)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::js::IsHeapConstructibleType>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::js::IsHeapConstructibleType)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_IsHeapConstructibleType_open0_ptr_JSObject_void_close0_instantiation(
        ) {
            assert_eq!(
                ::std::mem::size_of::<root::js::IsHeapConstructibleType>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::js::IsHeapConstructibleType)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::js::IsHeapConstructibleType>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::js::IsHeapConstructibleType)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_IsHeapConstructibleType_open0_ptr_JSScript_void_close0_instantiation(
        ) {
            assert_eq!(
                ::std::mem::size_of::<root::js::IsHeapConstructibleType>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::js::IsHeapConstructibleType)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::js::IsHeapConstructibleType>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::js::IsHeapConstructibleType)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_IsHeapConstructibleType_open0_ptr_JSString_void_close0_instantiation(
        ) {
            assert_eq!(
                ::std::mem::size_of::<root::js::IsHeapConstructibleType>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::js::IsHeapConstructibleType)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::js::IsHeapConstructibleType>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::js::IsHeapConstructibleType)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_IsHeapConstructibleType_open0_Value_void_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::js::IsHeapConstructibleType>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::js::IsHeapConstructibleType)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::js::IsHeapConstructibleType>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::js::IsHeapConstructibleType)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_IsHeapConstructibleType_open0_PropertyKey_void_close0_instantiation(
        ) {
            assert_eq!(
                ::std::mem::size_of::<root::js::IsHeapConstructibleType>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::js::IsHeapConstructibleType)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::js::IsHeapConstructibleType>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::js::IsHeapConstructibleType)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_BarrierMethods_open0_ptr_JSObject_void_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::js::BarrierMethods>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::js::BarrierMethods)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::js::BarrierMethods>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::js::BarrierMethods)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_BarrierMethods_open0_ptr_JSFunction_void_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::js::BarrierMethods>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::js::BarrierMethods)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::js::BarrierMethods>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::js::BarrierMethods)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_BarrierMethods_open0_ptr_JSString_void_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::js::BarrierMethods>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::js::BarrierMethods)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::js::BarrierMethods>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::js::BarrierMethods)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_BarrierMethods_open0_ptr_BigInt_void_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::js::BarrierMethods>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::js::BarrierMethods)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::js::BarrierMethods>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::js::BarrierMethods)
                )
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct MovableCellHasher {
            pub _address: u8,
        }
        pub type MovableCellHasher_Key<T> = T;
        pub type MovableCellHasher_Lookup<T> = T;
        #[repr(C)]
        pub struct VirtualTraceable__bindgen_vtable(::std::os::raw::c_void);
        #[repr(C)]
        #[derive(Debug)]
        pub struct VirtualTraceable {
            pub vtable_: *const VirtualTraceable__bindgen_vtable,
        }
        #[test]
        fn bindgen_test_layout_VirtualTraceable() {
            assert_eq!(
                ::std::mem::size_of::<VirtualTraceable>(),
                8usize,
                concat!("Size of: ", stringify!(VirtualTraceable))
            );
            assert_eq!(
                ::std::mem::align_of::<VirtualTraceable>(),
                8usize,
                concat!("Alignment of ", stringify!(VirtualTraceable))
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct StackRootedBase {
            pub stack: *mut *mut root::js::StackRootedBase,
            pub prev: *mut root::js::StackRootedBase,
        }
        #[test]
        fn bindgen_test_layout_StackRootedBase() {
            const UNINIT: ::std::mem::MaybeUninit<StackRootedBase> =
                ::std::mem::MaybeUninit::uninit();
            let ptr = UNINIT.as_ptr();
            assert_eq!(
                ::std::mem::size_of::<StackRootedBase>(),
                16usize,
                concat!("Size of: ", stringify!(StackRootedBase))
            );
            assert_eq!(
                ::std::mem::align_of::<StackRootedBase>(),
                8usize,
                concat!("Alignment of ", stringify!(StackRootedBase))
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).stack) as usize - ptr as usize },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(StackRootedBase),
                    "::",
                    stringify!(stack)
                )
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).prev) as usize - ptr as usize },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(StackRootedBase),
                    "::",
                    stringify!(prev)
                )
            );
        }
        #[repr(C)]
        #[derive(Debug)]
        pub struct PersistentRootedBase {
            pub _base: root::mozilla::LinkedListElement,
        }
        #[test]
        fn bindgen_test_layout_PersistentRootedBase() {
            assert_eq!(
                ::std::mem::size_of::<PersistentRootedBase>(),
                24usize,
                concat!("Size of: ", stringify!(PersistentRootedBase))
            );
            assert_eq!(
                ::std::mem::align_of::<PersistentRootedBase>(),
                8usize,
                concat!("Alignment of ", stringify!(PersistentRootedBase))
            );
        }
        #[repr(C)]
        #[derive(Debug)]
        pub struct StackRootedTraceableBase {
            pub _base: root::js::StackRootedBase,
            pub _base_1: root::js::VirtualTraceable,
        }
        #[test]
        fn bindgen_test_layout_StackRootedTraceableBase() {
            assert_eq!(
                ::std::mem::size_of::<StackRootedTraceableBase>(),
                24usize,
                concat!("Size of: ", stringify!(StackRootedTraceableBase))
            );
            assert_eq!(
                ::std::mem::align_of::<StackRootedTraceableBase>(),
                8usize,
                concat!("Alignment of ", stringify!(StackRootedTraceableBase))
            );
        }
        #[repr(C)]
        #[derive(Debug)]
        pub struct PersistentRootedTraceableBase {
            pub _base: root::js::PersistentRootedBase,
            pub _base_1: root::js::VirtualTraceable,
        }
        #[test]
        fn bindgen_test_layout_PersistentRootedTraceableBase() {
            assert_eq!(
                ::std::mem::size_of::<PersistentRootedTraceableBase>(),
                32usize,
                concat!("Size of: ", stringify!(PersistentRootedTraceableBase))
            );
            assert_eq!(
                ::std::mem::align_of::<PersistentRootedTraceableBase>(),
                8usize,
                concat!("Alignment of ", stringify!(PersistentRootedTraceableBase))
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct TypedRootedGCThingBase<Base> {
            pub _base: Base,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<Base>>,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct TypedRootedTraceableBase<Base> {
            pub _base: Base,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<Base>>,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct RootedTraceableTraits {
            pub _address: u8,
        }
        pub type RootedTraceableTraits_StackBase =
            root::js::TypedRootedTraceableBase<root::js::StackRootedTraceableBase>;
        pub type RootedTraceableTraits_PersistentBase =
            root::js::TypedRootedTraceableBase<root::js::PersistentRootedTraceableBase>;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct RootedGCThingTraits {
            pub _address: u8,
        }
        pub type RootedGCThingTraits_StackBase =
            root::js::TypedRootedGCThingBase<root::js::StackRootedBase>;
        pub type RootedGCThingTraits_PersistentBase =
            root::js::TypedRootedGCThingBase<root::js::PersistentRootedBase>;
        #[test]
        fn __bindgen_test_layout_BarrierMethods_open0_Value_void_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::js::BarrierMethods>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::js::BarrierMethods)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::js::BarrierMethods>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::js::BarrierMethods)
                )
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct MutableValueOperations {
            pub _address: u8,
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js26ReportBadValueTypeAndCrashERKN2JS5ValueE"]
            pub fn ReportBadValueTypeAndCrash(val: *const root::JS::Value) -> !;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js13ToBooleanSlowEN2JS6HandleINS0_5ValueEEE"]
            pub fn ToBooleanSlow(v: root::JS::HandleValue) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js12ToNumberSlowEP9JSContextN2JS6HandleINS2_5ValueEEEPd"]
            pub fn ToNumberSlow(
                cx: *mut root::JSContext,
                v: root::JS::HandleValue,
                dp: *mut f64,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js10ToInt8SlowEP9JSContextN2JS6HandleINS2_5ValueEEEPa"]
            pub fn ToInt8Slow(
                cx: *mut root::JSContext,
                v: root::JS::HandleValue,
                out: *mut i8,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js11ToUint8SlowEP9JSContextN2JS6HandleINS2_5ValueEEEPh"]
            pub fn ToUint8Slow(
                cx: *mut root::JSContext,
                v: root::JS::HandleValue,
                out: *mut u8,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js11ToInt16SlowEP9JSContextN2JS6HandleINS2_5ValueEEEPs"]
            pub fn ToInt16Slow(
                cx: *mut root::JSContext,
                v: root::JS::HandleValue,
                out: *mut i16,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js11ToInt32SlowEP9JSContextN2JS6HandleINS2_5ValueEEEPi"]
            pub fn ToInt32Slow(
                cx: *mut root::JSContext,
                v: root::JS::HandleValue,
                out: *mut i32,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js12ToUint32SlowEP9JSContextN2JS6HandleINS2_5ValueEEEPj"]
            pub fn ToUint32Slow(
                cx: *mut root::JSContext,
                v: root::JS::HandleValue,
                out: *mut u32,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js12ToUint16SlowEP9JSContextN2JS6HandleINS2_5ValueEEEPt"]
            pub fn ToUint16Slow(
                cx: *mut root::JSContext,
                v: root::JS::HandleValue,
                out: *mut u16,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js11ToInt64SlowEP9JSContextN2JS6HandleINS2_5ValueEEEPl"]
            pub fn ToInt64Slow(
                cx: *mut root::JSContext,
                v: root::JS::HandleValue,
                out: *mut i64,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js12ToUint64SlowEP9JSContextN2JS6HandleINS2_5ValueEEEPm"]
            pub fn ToUint64Slow(
                cx: *mut root::JSContext,
                v: root::JS::HandleValue,
                out: *mut u64,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js12ToStringSlowEP9JSContextN2JS6HandleINS2_5ValueEEE"]
            pub fn ToStringSlow(
                cx: *mut root::JSContext,
                v: root::JS::HandleValue,
            ) -> *mut root::JSString;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js12ToObjectSlowEP9JSContextN2JS6HandleINS2_5ValueEEEb"]
            pub fn ToObjectSlow(
                cx: *mut root::JSContext,
                v: root::JS::HandleValue,
                reportScanStack: bool,
            ) -> *mut root::JSObject;
        }
        #[test]
        fn __bindgen_test_layout_BarrierMethods_open0_PropertyKey_void_close0_instantiation() {
            assert_eq!(
                ::std::mem::size_of::<root::js::BarrierMethods>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::js::BarrierMethods)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<root::js::BarrierMethods>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::js::BarrierMethods)
                )
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct ErrorContext {
            _unused: [u8; 0],
        }
        #[repr(i32)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub enum AllocFunction {
            Malloc = 0,
            Calloc = 1,
            Realloc = 2,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct AllocPolicyBase {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_AllocPolicyBase() {
            assert_eq!(
                ::std::mem::size_of::<AllocPolicyBase>(),
                1usize,
                concat!("Size of: ", stringify!(AllocPolicyBase))
            );
            assert_eq!(
                ::std::mem::align_of::<AllocPolicyBase>(),
                1usize,
                concat!("Alignment of ", stringify!(AllocPolicyBase))
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct SystemAllocPolicy {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_SystemAllocPolicy() {
            assert_eq!(
                ::std::mem::size_of::<SystemAllocPolicy>(),
                1usize,
                concat!("Size of: ", stringify!(SystemAllocPolicy))
            );
            assert_eq!(
                ::std::mem::align_of::<SystemAllocPolicy>(),
                1usize,
                concat!("Alignment of ", stringify!(SystemAllocPolicy))
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js17ReportOutOfMemoryEP9JSContext"]
            pub fn ReportOutOfMemory(cx: *mut root::JSContext);
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js17ReportOutOfMemoryEPNS_12ErrorContextE"]
            pub fn ReportOutOfMemory1(ec: *mut root::js::ErrorContext);
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct TempAllocPolicy {
            pub cx_: *mut root::JSContext,
        }
        #[test]
        fn bindgen_test_layout_TempAllocPolicy() {
            const UNINIT: ::std::mem::MaybeUninit<TempAllocPolicy> =
                ::std::mem::MaybeUninit::uninit();
            let ptr = UNINIT.as_ptr();
            assert_eq!(
                ::std::mem::size_of::<TempAllocPolicy>(),
                8usize,
                concat!("Size of: ", stringify!(TempAllocPolicy))
            );
            assert_eq!(
                ::std::mem::align_of::<TempAllocPolicy>(),
                8usize,
                concat!("Alignment of ", stringify!(TempAllocPolicy))
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).cx_) as usize - ptr as usize },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(TempAllocPolicy),
                    "::",
                    stringify!(cx_)
                )
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct MallocAllocPolicy {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_MallocAllocPolicy() {
            assert_eq!(
                ::std::mem::size_of::<MallocAllocPolicy>(),
                1usize,
                concat!("Size of: ", stringify!(MallocAllocPolicy))
            );
            assert_eq!(
                ::std::mem::align_of::<MallocAllocPolicy>(),
                1usize,
                concat!("Alignment of ", stringify!(MallocAllocPolicy))
            );
        }
        extern "C" {
            #[doc = " In memory reporting, we have concept of \"sundries\", line items which are too\n small to be worth reporting individually.  Under some circumstances, a memory\n reporter gets tossed into the sundries bucket if it's smaller than\n MemoryReportingSundriesThreshold() bytes.\n\n We need to define this value here, rather than in the code which actually\n generates the memory reports, because NotableStringInfo uses this value."]
            #[link_name = "\u{1}_ZN2js32MemoryReportingSundriesThresholdEv"]
            pub fn MemoryReportingSundriesThreshold() -> usize;
        }
        #[doc = " This hash policy avoids flattening ropes (which perturbs the site being\n measured and requires a JSContext) at the expense of doing a FULL ROPE COPY\n on every hash and match! Beware."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct InefficientNonFlatteningStringHashPolicy {
            pub _address: u8,
        }
        pub type InefficientNonFlatteningStringHashPolicy_Lookup = *mut root::JSString;
        #[test]
        fn bindgen_test_layout_InefficientNonFlatteningStringHashPolicy() {
            assert_eq!(
                ::std::mem::size_of::<InefficientNonFlatteningStringHashPolicy>(),
                1usize,
                concat!(
                    "Size of: ",
                    stringify!(InefficientNonFlatteningStringHashPolicy)
                )
            );
            assert_eq!(
                ::std::mem::align_of::<InefficientNonFlatteningStringHashPolicy>(),
                1usize,
                concat!(
                    "Alignment of ",
                    stringify!(InefficientNonFlatteningStringHashPolicy)
                )
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct PropertyResult {
            _unused: [u8; 0],
        }
        pub type LookupPropertyOp = ::std::option::Option<
            unsafe extern "C" fn(
                cx: *mut root::JSContext,
                obj: root::JS::HandleObject,
                id: root::JS::HandleId,
                objp: root::JS::MutableHandleObject,
                propp: *mut root::js::PropertyResult,
            ) -> bool,
        >;
        pub type DefinePropertyOp = ::std::option::Option<
            unsafe extern "C" fn(
                cx: *mut root::JSContext,
                obj: root::JS::HandleObject,
                id: root::JS::HandleId,
                desc: root::JS::Handle<root::JS::PropertyDescriptor>,
                result: *mut root::JS::ObjectOpResult,
            ) -> bool,
        >;
        pub type HasPropertyOp = ::std::option::Option<
            unsafe extern "C" fn(
                cx: *mut root::JSContext,
                obj: root::JS::HandleObject,
                id: root::JS::HandleId,
                foundp: *mut bool,
            ) -> bool,
        >;
        pub type GetPropertyOp = ::std::option::Option<
            unsafe extern "C" fn(
                cx: *mut root::JSContext,
                obj: root::JS::HandleObject,
                receiver: root::JS::HandleValue,
                id: root::JS::HandleId,
                vp: root::JS::MutableHandleValue,
            ) -> bool,
        >;
        pub type SetPropertyOp = ::std::option::Option<
            unsafe extern "C" fn(
                cx: *mut root::JSContext,
                obj: root::JS::HandleObject,
                id: root::JS::HandleId,
                v: root::JS::HandleValue,
                receiver: root::JS::HandleValue,
                result: *mut root::JS::ObjectOpResult,
            ) -> bool,
        >;
        pub type GetOwnPropertyOp = ::std::option::Option<
            unsafe extern "C" fn(
                cx: *mut root::JSContext,
                obj: root::JS::HandleObject,
                id: root::JS::HandleId,
                desc: u8,
            ) -> bool,
        >;
        pub type DeletePropertyOp = ::std::option::Option<
            unsafe extern "C" fn(
                cx: *mut root::JSContext,
                obj: root::JS::HandleObject,
                id: root::JS::HandleId,
                result: *mut root::JS::ObjectOpResult,
            ) -> bool,
        >;
        #[repr(C)]
        pub struct ElementAdder {
            pub resObj_: root::JS::RootedObject,
            pub vp_: *mut root::JS::Value,
            pub index_: u32,
            pub getBehavior_: root::js::ElementAdder_GetBehavior,
        }
        #[repr(u32)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub enum ElementAdder_GetBehavior {
            CheckHasElemPreserveHoles = 0,
            GetElement = 1,
        }
        #[test]
        fn bindgen_test_layout_ElementAdder() {
            const UNINIT: ::std::mem::MaybeUninit<ElementAdder> = ::std::mem::MaybeUninit::uninit();
            let ptr = UNINIT.as_ptr();
            assert_eq!(
                ::std::mem::size_of::<ElementAdder>(),
                40usize,
                concat!("Size of: ", stringify!(ElementAdder))
            );
            assert_eq!(
                ::std::mem::align_of::<ElementAdder>(),
                8usize,
                concat!("Alignment of ", stringify!(ElementAdder))
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).resObj_) as usize - ptr as usize },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ElementAdder),
                    "::",
                    stringify!(resObj_)
                )
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).vp_) as usize - ptr as usize },
                24usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ElementAdder),
                    "::",
                    stringify!(vp_)
                )
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).index_) as usize - ptr as usize },
                32usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ElementAdder),
                    "::",
                    stringify!(index_)
                )
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).getBehavior_) as usize - ptr as usize },
                36usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ElementAdder),
                    "::",
                    stringify!(getBehavior_)
                )
            );
        }
        pub type GetElementsOp = ::std::option::Option<
            unsafe extern "C" fn(
                cx: *mut root::JSContext,
                obj: root::JS::HandleObject,
                begin: u32,
                end: u32,
                adder: *mut root::js::ElementAdder,
            ) -> bool,
        >;
        #[doc = " Callback for the creation of constructor and prototype objects."]
        pub type ClassObjectCreationOp = ::std::option::Option<
            unsafe extern "C" fn(
                cx: *mut root::JSContext,
                key: root::JSProtoKey,
            ) -> *mut root::JSObject,
        >;
        #[doc = " Callback for custom post-processing after class initialization via\n ClassSpec."]
        pub type FinishClassInitOp = ::std::option::Option<
            unsafe extern "C" fn(
                cx: *mut root::JSContext,
                ctor: root::JS::HandleObject,
                proto: root::JS::HandleObject,
            ) -> bool,
        >;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct ClassSpec {
            pub createConstructor: root::js::ClassObjectCreationOp,
            pub createPrototype: root::js::ClassObjectCreationOp,
            pub constructorFunctions: *const root::JSFunctionSpec,
            pub constructorProperties: *const root::JSPropertySpec,
            pub prototypeFunctions: *const root::JSFunctionSpec,
            pub prototypeProperties: *const root::JSPropertySpec,
            pub finishInit: root::js::FinishClassInitOp,
            pub flags: usize,
        }
        pub const ClassSpec_ProtoKeyWidth: usize = 7;
        pub const ClassSpec_ProtoKeyMask: usize = 127;
        pub const ClassSpec_DontDefineConstructor: usize = 128;
        #[test]
        fn bindgen_test_layout_ClassSpec() {
            const UNINIT: ::std::mem::MaybeUninit<ClassSpec> = ::std::mem::MaybeUninit::uninit();
            let ptr = UNINIT.as_ptr();
            assert_eq!(
                ::std::mem::size_of::<ClassSpec>(),
                64usize,
                concat!("Size of: ", stringify!(ClassSpec))
            );
            assert_eq!(
                ::std::mem::align_of::<ClassSpec>(),
                8usize,
                concat!("Alignment of ", stringify!(ClassSpec))
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).createConstructor) as usize - ptr as usize },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ClassSpec),
                    "::",
                    stringify!(createConstructor)
                )
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).createPrototype) as usize - ptr as usize },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ClassSpec),
                    "::",
                    stringify!(createPrototype)
                )
            );
            assert_eq!(
                unsafe {
                    ::std::ptr::addr_of!((*ptr).constructorFunctions) as usize - ptr as usize
                },
                16usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ClassSpec),
                    "::",
                    stringify!(constructorFunctions)
                )
            );
            assert_eq!(
                unsafe {
                    ::std::ptr::addr_of!((*ptr).constructorProperties) as usize - ptr as usize
                },
                24usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ClassSpec),
                    "::",
                    stringify!(constructorProperties)
                )
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).prototypeFunctions) as usize - ptr as usize },
                32usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ClassSpec),
                    "::",
                    stringify!(prototypeFunctions)
                )
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).prototypeProperties) as usize - ptr as usize },
                40usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ClassSpec),
                    "::",
                    stringify!(prototypeProperties)
                )
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).finishInit) as usize - ptr as usize },
                48usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ClassSpec),
                    "::",
                    stringify!(finishInit)
                )
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
                56usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ClassSpec),
                    "::",
                    stringify!(flags)
                )
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct ClassExtension {
            #[doc = " Optional hook called when an object is moved by generational or\n compacting GC.\n\n There may exist weak pointers to an object that are not traced through\n when the normal trace APIs are used, for example objects in the wrapper\n cache. This hook allows these pointers to be updated.\n\n Note that this hook can be called before JS_NewObject() returns if a GC\n is triggered during construction of the object. This can happen for\n global objects for example.\n\n The function should return the difference between nursery bytes used and\n tenured bytes used, which may be nonzero e.g. if some nursery-allocated\n data beyond the actual GC thing is moved into malloced memory.\n\n This is used to compute the nursery promotion rate."]
            pub objectMovedOp: root::JSObjectMovedOp,
        }
        #[test]
        fn bindgen_test_layout_ClassExtension() {
            const UNINIT: ::std::mem::MaybeUninit<ClassExtension> =
                ::std::mem::MaybeUninit::uninit();
            let ptr = UNINIT.as_ptr();
            assert_eq!(
                ::std::mem::size_of::<ClassExtension>(),
                8usize,
                concat!("Size of: ", stringify!(ClassExtension))
            );
            assert_eq!(
                ::std::mem::align_of::<ClassExtension>(),
                8usize,
                concat!("Alignment of ", stringify!(ClassExtension))
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).objectMovedOp) as usize - ptr as usize },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ClassExtension),
                    "::",
                    stringify!(objectMovedOp)
                )
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct ObjectOps {
            pub lookupProperty: root::js::LookupPropertyOp,
            pub defineProperty: root::js::DefinePropertyOp,
            pub hasProperty: root::js::HasPropertyOp,
            pub getProperty: root::js::GetPropertyOp,
            pub setProperty: root::js::SetPropertyOp,
            pub getOwnPropertyDescriptor: root::js::GetOwnPropertyOp,
            pub deleteProperty: root::js::DeletePropertyOp,
            pub getElements: root::js::GetElementsOp,
            pub funToString: root::JSFunToStringOp,
        }
        #[test]
        fn bindgen_test_layout_ObjectOps() {
            const UNINIT: ::std::mem::MaybeUninit<ObjectOps> = ::std::mem::MaybeUninit::uninit();
            let ptr = UNINIT.as_ptr();
            assert_eq!(
                ::std::mem::size_of::<ObjectOps>(),
                72usize,
                concat!("Size of: ", stringify!(ObjectOps))
            );
            assert_eq!(
                ::std::mem::align_of::<ObjectOps>(),
                8usize,
                concat!("Alignment of ", stringify!(ObjectOps))
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).lookupProperty) as usize - ptr as usize },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ObjectOps),
                    "::",
                    stringify!(lookupProperty)
                )
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).defineProperty) as usize - ptr as usize },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ObjectOps),
                    "::",
                    stringify!(defineProperty)
                )
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).hasProperty) as usize - ptr as usize },
                16usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ObjectOps),
                    "::",
                    stringify!(hasProperty)
                )
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).getProperty) as usize - ptr as usize },
                24usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ObjectOps),
                    "::",
                    stringify!(getProperty)
                )
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).setProperty) as usize - ptr as usize },
                32usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ObjectOps),
                    "::",
                    stringify!(setProperty)
                )
            );
            assert_eq!(
                unsafe {
                    ::std::ptr::addr_of!((*ptr).getOwnPropertyDescriptor) as usize - ptr as usize
                },
                40usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ObjectOps),
                    "::",
                    stringify!(getOwnPropertyDescriptor)
                )
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).deleteProperty) as usize - ptr as usize },
                48usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ObjectOps),
                    "::",
                    stringify!(deleteProperty)
                )
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).getElements) as usize - ptr as usize },
                56usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ObjectOps),
                    "::",
                    stringify!(getElements)
                )
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).funToString) as usize - ptr as usize },
                64usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ObjectOps),
                    "::",
                    stringify!(funToString)
                )
            );
        }
        #[repr(i32)]
        #[doc = " Enumeration describing possible values of the [[Class]] internal property\n value of objects."]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub enum ESClass {
            Object = 0,
            Array = 1,
            Number = 2,
            String = 3,
            Boolean = 4,
            RegExp = 5,
            ArrayBuffer = 6,
            SharedArrayBuffer = 7,
            Date = 8,
            Set = 9,
            Map = 10,
            Promise = 11,
            MapIterator = 12,
            SetIterator = 13,
            Arguments = 14,
            Error = 15,
            BigInt = 16,
            Function = 17,
            #[doc = " None of the above."]
            Other = 18,
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js5UnboxEP9JSContextN2JS6HandleIP8JSObjectEENS2_13MutableHandleINS2_5ValueEEE"]
            pub fn Unbox(
                cx: *mut root::JSContext,
                obj: root::JS::HandleObject,
                vp: root::JS::MutableHandleValue,
            ) -> bool;
        }
        #[repr(C)]
        pub struct BaseProxyHandler__bindgen_vtable(::std::os::raw::c_void);
        #[repr(C, packed)]
        #[derive(Debug, Copy, Clone)]
        pub struct BaseProxyHandler {
            pub vtable_: *const BaseProxyHandler__bindgen_vtable,
            pub mFamily: *const ::std::os::raw::c_void,
            pub mHasPrototype: bool,
            pub mHasSecurityPolicy: bool,
        }
        pub type BaseProxyHandler_Action = u32;
        pub const BaseProxyHandler_NONE: root::js::BaseProxyHandler__bindgen_ty_1 =
            BaseProxyHandler__bindgen_ty_1::NONE;
        pub const BaseProxyHandler_GET: root::js::BaseProxyHandler__bindgen_ty_1 =
            BaseProxyHandler__bindgen_ty_1::GET;
        pub const BaseProxyHandler_SET: root::js::BaseProxyHandler__bindgen_ty_1 =
            BaseProxyHandler__bindgen_ty_1::SET;
        pub const BaseProxyHandler_CALL: root::js::BaseProxyHandler__bindgen_ty_1 =
            BaseProxyHandler__bindgen_ty_1::CALL;
        pub const BaseProxyHandler_ENUMERATE: root::js::BaseProxyHandler__bindgen_ty_1 =
            BaseProxyHandler__bindgen_ty_1::ENUMERATE;
        pub const BaseProxyHandler_GET_PROPERTY_DESCRIPTOR:
            root::js::BaseProxyHandler__bindgen_ty_1 =
            BaseProxyHandler__bindgen_ty_1::GET_PROPERTY_DESCRIPTOR;
        #[repr(u32)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub enum BaseProxyHandler__bindgen_ty_1 {
            NONE = 0,
            GET = 1,
            SET = 2,
            CALL = 4,
            ENUMERATE = 8,
            GET_PROPERTY_DESCRIPTOR = 16,
        }
        #[test]
        fn bindgen_test_layout_BaseProxyHandler() {
            const UNINIT: ::std::mem::MaybeUninit<BaseProxyHandler> =
                ::std::mem::MaybeUninit::uninit();
            let ptr = UNINIT.as_ptr();
            assert_eq!(
                ::std::mem::size_of::<BaseProxyHandler>(),
                18usize,
                concat!("Size of: ", stringify!(BaseProxyHandler))
            );
            assert_eq!(
                ::std::mem::align_of::<BaseProxyHandler>(),
                1usize,
                concat!("Alignment of ", stringify!(BaseProxyHandler))
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).mFamily) as usize - ptr as usize },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(BaseProxyHandler),
                    "::",
                    stringify!(mFamily)
                )
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).mHasPrototype) as usize - ptr as usize },
                16usize,
                concat!(
                    "Offset of field: ",
                    stringify!(BaseProxyHandler),
                    "::",
                    stringify!(mHasPrototype)
                )
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).mHasSecurityPolicy) as usize - ptr as usize },
                17usize,
                concat!(
                    "Offset of field: ",
                    stringify!(BaseProxyHandler),
                    "::",
                    stringify!(mHasSecurityPolicy)
                )
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js10ProxyClassE"]
            pub static ProxyClass: root::JSClass;
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct ProxyOptions {
            pub lazyProto_: bool,
            pub clasp_: *const root::JSClass,
        }
        #[test]
        fn bindgen_test_layout_ProxyOptions() {
            const UNINIT: ::std::mem::MaybeUninit<ProxyOptions> = ::std::mem::MaybeUninit::uninit();
            let ptr = UNINIT.as_ptr();
            assert_eq!(
                ::std::mem::size_of::<ProxyOptions>(),
                16usize,
                concat!("Size of: ", stringify!(ProxyOptions))
            );
            assert_eq!(
                ::std::mem::align_of::<ProxyOptions>(),
                8usize,
                concat!("Alignment of ", stringify!(ProxyOptions))
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).lazyProto_) as usize - ptr as usize },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ProxyOptions),
                    "::",
                    stringify!(lazyProto_)
                )
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).clasp_) as usize - ptr as usize },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(ProxyOptions),
                    "::",
                    stringify!(clasp_)
                )
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js14NewProxyObjectEP9JSContextPKNS_16BaseProxyHandlerEN2JS6HandleINS5_5ValueEEEP8JSObjectRKNS_12ProxyOptionsE"]
            pub fn NewProxyObject(
                cx: *mut root::JSContext,
                handler: *const root::js::BaseProxyHandler,
                priv_: root::JS::HandleValue,
                proto: *mut root::JSObject,
                options: *const root::js::ProxyOptions,
            ) -> *mut root::JSObject;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js16RenewProxyObjectEP9JSContextP8JSObjectPNS_16BaseProxyHandlerERKN2JS5ValueE"]
            pub fn RenewProxyObject(
                cx: *mut root::JSContext,
                obj: *mut root::JSObject,
                handler: *mut root::js::BaseProxyHandler,
                priv_: *const root::JS::Value,
            ) -> *mut root::JSObject;
        }
        #[repr(C)]
        pub struct AutoEnterPolicy__bindgen_vtable(::std::os::raw::c_void);
        #[repr(C)]
        #[derive(Debug)]
        pub struct AutoEnterPolicy {
            pub vtable_: *const AutoEnterPolicy__bindgen_vtable,
            pub allow: bool,
            pub rv: bool,
        }
        pub type AutoEnterPolicy_Action = root::js::BaseProxyHandler_Action;
        #[test]
        fn bindgen_test_layout_AutoEnterPolicy() {
            const UNINIT: ::std::mem::MaybeUninit<AutoEnterPolicy> =
                ::std::mem::MaybeUninit::uninit();
            let ptr = UNINIT.as_ptr();
            assert_eq!(
                ::std::mem::size_of::<AutoEnterPolicy>(),
                16usize,
                concat!("Size of: ", stringify!(AutoEnterPolicy))
            );
            assert_eq!(
                ::std::mem::align_of::<AutoEnterPolicy>(),
                8usize,
                concat!("Alignment of ", stringify!(AutoEnterPolicy))
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).allow) as usize - ptr as usize },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(AutoEnterPolicy),
                    "::",
                    stringify!(allow)
                )
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).rv) as usize - ptr as usize },
                9usize,
                concat!(
                    "Offset of field: ",
                    stringify!(AutoEnterPolicy),
                    "::",
                    stringify!(rv)
                )
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct AutoWaivePolicy {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_AutoWaivePolicy() {
            assert_eq!(
                ::std::mem::size_of::<AutoWaivePolicy>(),
                1usize,
                concat!("Size of: ", stringify!(AutoWaivePolicy))
            );
            assert_eq!(
                ::std::mem::align_of::<AutoWaivePolicy>(),
                1usize,
                concat!("Alignment of ", stringify!(AutoWaivePolicy))
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js13ProxyClassOpsE"]
            pub static ProxyClassOps: root::JSClassOps;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js19ProxyClassExtensionE"]
            pub static ProxyClassExtension: root::js::ClassExtension;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js14ProxyObjectOpsE"]
            pub static ProxyObjectOps: root::js::ObjectOps;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js15NukeNonCCWProxyEP9JSContextN2JS6HandleIP8JSObjectEE"]
            pub fn NukeNonCCWProxy(cx: *mut root::JSContext, proxy: root::JS::HandleObject);
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js34NukeRemovedCrossCompartmentWrapperEP9JSContextP8JSObject"]
            pub fn NukeRemovedCrossCompartmentWrapper(
                cx: *mut root::JSContext,
                wrapper: *mut root::JSObject,
            );
        }
        extern "C" {
            #[doc = " Get the first SavedFrame object in this SavedFrame stack whose principals are\n subsumed by the given |principals|. If there is no such frame, return\n nullptr.\n\n Do NOT pass a non-SavedFrame object here."]
            #[link_name = "\u{1}_ZN2js26GetFirstSubsumedSavedFrameEP9JSContextP12JSPrincipalsN2JS6HandleIP8JSObjectEENS4_20SavedFrameSelfHostedE"]
            pub fn GetFirstSubsumedSavedFrame(
                cx: *mut root::JSContext,
                principals: *mut root::JSPrincipals,
                savedFrame: root::JS::Handle<*mut root::JSObject>,
                selfHosted: root::JS::SavedFrameSelfHosted,
            ) -> *mut root::JSObject;
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct SharedArrayRawBuffer {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug)]
        pub struct SharedArrayRawBufferRefs {
            pub refs_: [u64; 3usize],
        }
        #[test]
        fn bindgen_test_layout_SharedArrayRawBufferRefs() {
            const UNINIT: ::std::mem::MaybeUninit<SharedArrayRawBufferRefs> =
                ::std::mem::MaybeUninit::uninit();
            let ptr = UNINIT.as_ptr();
            assert_eq!(
                ::std::mem::size_of::<SharedArrayRawBufferRefs>(),
                24usize,
                concat!("Size of: ", stringify!(SharedArrayRawBufferRefs))
            );
            assert_eq!(
                ::std::mem::align_of::<SharedArrayRawBufferRefs>(),
                8usize,
                concat!("Alignment of ", stringify!(SharedArrayRawBufferRefs))
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).refs_) as usize - ptr as usize },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(SharedArrayRawBufferRefs),
                    "::",
                    stringify!(refs_)
                )
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct BufferIterator {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug)]
        pub struct RefCounted {
            pub mRefCnt: root::MozRefCountType,
        }
        #[repr(C)]
        #[derive(Debug)]
        pub struct AtomicRefCounted {
            pub mRefCnt: u64,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct ParseTask {
            _unused: [u8; 0],
        }
        pub mod frontend {
            #[allow(unused_imports)]
            use self::super::super::super::root;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct CompilationStencil {
                _unused: [u8; 0],
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct CompilationGCOutput {
                _unused: [u8; 0],
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct WrapperOptions {
            pub _base: root::js::ProxyOptions,
            pub proto_: [u64; 4usize],
        }
        #[test]
        fn bindgen_test_layout_WrapperOptions() {
            const UNINIT: ::std::mem::MaybeUninit<WrapperOptions> =
                ::std::mem::MaybeUninit::uninit();
            let ptr = UNINIT.as_ptr();
            assert_eq!(
                ::std::mem::size_of::<WrapperOptions>(),
                48usize,
                concat!("Size of: ", stringify!(WrapperOptions))
            );
            assert_eq!(
                ::std::mem::align_of::<WrapperOptions>(),
                8usize,
                concat!("Alignment of ", stringify!(WrapperOptions))
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).proto_) as usize - ptr as usize },
                16usize,
                concat!(
                    "Offset of field: ",
                    stringify!(WrapperOptions),
                    "::",
                    stringify!(proto_)
                )
            );
        }
        #[repr(C, packed)]
        #[derive(Debug, Copy, Clone)]
        pub struct ForwardingProxyHandler {
            pub _base: root::js::BaseProxyHandler,
        }
        #[test]
        fn bindgen_test_layout_ForwardingProxyHandler() {
            assert_eq!(
                ::std::mem::size_of::<ForwardingProxyHandler>(),
                18usize,
                concat!("Size of: ", stringify!(ForwardingProxyHandler))
            );
            assert_eq!(
                ::std::mem::align_of::<ForwardingProxyHandler>(),
                1usize,
                concat!("Alignment of ", stringify!(ForwardingProxyHandler))
            );
        }
        #[repr(C, packed)]
        #[derive(Debug, Copy, Clone)]
        pub struct Wrapper {
            pub _base: root::js::ForwardingProxyHandler,
            pub mFlags: ::std::os::raw::c_uint,
        }
        impl root::js::Wrapper_Flags {
            pub const LAST_USED_FLAG: root::js::Wrapper_Flags = Wrapper_Flags::CROSS_COMPARTMENT;
        }
        #[repr(u32)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub enum Wrapper_Flags {
            CROSS_COMPARTMENT = 1,
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js7Wrapper6familyE"]
            pub static Wrapper_family: ::std::os::raw::c_char;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js7Wrapper9singletonE"]
            pub static Wrapper_singleton: root::js::Wrapper;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js7Wrapper22singletonWithPrototypeE"]
            pub static Wrapper_singletonWithPrototype: root::js::Wrapper;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js7Wrapper12defaultProtoE"]
            pub static Wrapper_defaultProto: *mut root::JSObject;
        }
        #[test]
        fn bindgen_test_layout_Wrapper() {
            const UNINIT: ::std::mem::MaybeUninit<Wrapper> = ::std::mem::MaybeUninit::uninit();
            let ptr = UNINIT.as_ptr();
            assert_eq!(
                ::std::mem::size_of::<Wrapper>(),
                22usize,
                concat!("Size of: ", stringify!(Wrapper))
            );
            assert_eq!(
                ::std::mem::align_of::<Wrapper>(),
                1usize,
                concat!("Alignment of ", stringify!(Wrapper))
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).mFlags) as usize - ptr as usize },
                18usize,
                concat!(
                    "Offset of field: ",
                    stringify!(Wrapper),
                    "::",
                    stringify!(mFlags)
                )
            );
        }
        #[repr(C, packed)]
        #[derive(Debug, Copy, Clone)]
        pub struct CrossCompartmentWrapper {
            pub _base: root::js::Wrapper,
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js23CrossCompartmentWrapper9singletonE"]
            pub static CrossCompartmentWrapper_singleton: root::js::CrossCompartmentWrapper;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js23CrossCompartmentWrapper22singletonWithPrototypeE"]
            pub static CrossCompartmentWrapper_singletonWithPrototype:
                root::js::CrossCompartmentWrapper;
        }
        #[test]
        fn bindgen_test_layout_CrossCompartmentWrapper() {
            assert_eq!(
                ::std::mem::size_of::<CrossCompartmentWrapper>(),
                22usize,
                concat!("Size of: ", stringify!(CrossCompartmentWrapper))
            );
            assert_eq!(
                ::std::mem::align_of::<CrossCompartmentWrapper>(),
                1usize,
                concat!("Alignment of ", stringify!(CrossCompartmentWrapper))
            );
        }
        #[repr(C, packed)]
        #[derive(Debug, Copy, Clone)]
        pub struct OpaqueCrossCompartmentWrapper {
            pub _base: root::js::CrossCompartmentWrapper,
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js29OpaqueCrossCompartmentWrapper9singletonE"]
            pub static OpaqueCrossCompartmentWrapper_singleton:
                root::js::OpaqueCrossCompartmentWrapper;
        }
        #[test]
        fn bindgen_test_layout_OpaqueCrossCompartmentWrapper() {
            assert_eq!(
                ::std::mem::size_of::<OpaqueCrossCompartmentWrapper>(),
                22usize,
                concat!("Size of: ", stringify!(OpaqueCrossCompartmentWrapper))
            );
            assert_eq!(
                ::std::mem::align_of::<OpaqueCrossCompartmentWrapper>(),
                1usize,
                concat!("Alignment of ", stringify!(OpaqueCrossCompartmentWrapper))
            );
        }
        #[repr(C)]
        pub struct SecurityWrapper__bindgen_vtable(::std::os::raw::c_void);
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct SecurityWrapper<Base> {
            pub vtable_: *const SecurityWrapper__bindgen_vtable,
            pub _base: Base,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<Base>>,
        }
        pub type SecurityWrapper_Permissive<Base> = Base;
        pub type SecurityWrapper_Restrictive<Base> = root::js::SecurityWrapper<Base>;
        pub type CrossCompartmentSecurityWrapper =
            root::js::SecurityWrapper<root::js::CrossCompartmentWrapper>;
        extern "C" {
            #[link_name = "\u{1}_ZN2js24TransparentObjectWrapperEP9JSContextN2JS6HandleIP8JSObjectEES6_"]
            pub fn TransparentObjectWrapper(
                cx: *mut root::JSContext,
                existing: root::JS::HandleObject,
                obj: root::JS::HandleObject,
            ) -> *mut root::JSObject;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js15UncheckedUnwrapEP8JSObjectbPj"]
            pub fn UncheckedUnwrap(
                obj: *mut root::JSObject,
                stopAtWindowProxy: bool,
                flagsp: *mut ::std::os::raw::c_uint,
            ) -> *mut root::JSObject;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js19CheckedUnwrapStaticEP8JSObject"]
            pub fn CheckedUnwrapStatic(obj: *mut root::JSObject) -> *mut root::JSObject;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js22UnwrapOneCheckedStaticEP8JSObject"]
            pub fn UnwrapOneCheckedStatic(obj: *mut root::JSObject) -> *mut root::JSObject;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js20CheckedUnwrapDynamicEP8JSObjectP9JSContextb"]
            pub fn CheckedUnwrapDynamic(
                obj: *mut root::JSObject,
                cx: *mut root::JSContext,
                stopAtWindowProxy: bool,
            ) -> *mut root::JSObject;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js23UnwrapOneCheckedDynamicEN2JS6HandleIP8JSObjectEEP9JSContextb"]
            pub fn UnwrapOneCheckedDynamic(
                obj: root::JS::HandleObject,
                cx: *mut root::JSContext,
                stopAtWindowProxy: bool,
            ) -> *mut root::JSObject;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js28UncheckedUnwrapWithoutExposeEP8JSObject"]
            pub fn UncheckedUnwrapWithoutExpose(obj: *mut root::JSObject) -> *mut root::JSObject;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js18ReportAccessDeniedEP9JSContext"]
            pub fn ReportAccessDenied(cx: *mut root::JSContext);
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js27NukeCrossCompartmentWrapperEP9JSContextP8JSObject"]
            pub fn NukeCrossCompartmentWrapper(
                cx: *mut root::JSContext,
                wrapper: *mut root::JSObject,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js35NukeCrossCompartmentWrapperIfExistsEP9JSContextPN2JS11CompartmentEP8JSObject"]
            pub fn NukeCrossCompartmentWrapperIfExists(
                cx: *mut root::JSContext,
                source: *mut root::JS::Compartment,
                target: *mut root::JSObject,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js12RemapWrapperEP9JSContextP8JSObjectS3_"]
            pub fn RemapWrapper(
                cx: *mut root::JSContext,
                wobj: *mut root::JSObject,
                newTarget: *mut root::JSObject,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js16RemapDeadWrapperEP9JSContextN2JS6HandleIP8JSObjectEES6_"]
            pub fn RemapDeadWrapper(
                cx: *mut root::JSContext,
                wobj: root::JS::HandleObject,
                newTarget: root::JS::HandleObject,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js25RemapAllWrappersForObjectEP9JSContextN2JS6HandleIP8JSObjectEES6_"]
            pub fn RemapAllWrappersForObject(
                cx: *mut root::JSContext,
                oldTarget: root::JS::HandleObject,
                newTarget: root::JS::HandleObject,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js17RecomputeWrappersEP9JSContextRKNS_17CompartmentFilterES4_"]
            pub fn RecomputeWrappers(
                cx: *mut root::JSContext,
                sourceFilter: *const root::js::CompartmentFilter,
                targetFilter: *const root::js::CompartmentFilter,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js21UnwrapArrayBufferViewEP8JSObject"]
            pub fn UnwrapArrayBufferView(obj: *mut root::JSObject) -> *mut root::JSObject;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js20UnwrapReadableStreamEP8JSObject"]
            pub fn UnwrapReadableStream(obj: *mut root::JSObject) -> *mut root::JSObject;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js31GetArrayBufferViewLengthAndDataEP8JSObjectPmPbPPh"]
            pub fn GetArrayBufferViewLengthAndData(
                obj: *mut root::JSObject,
                length: *mut usize,
                isSharedMemory: *mut bool,
                data: *mut *mut u8,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js15UnwrapInt8ArrayEP8JSObject"]
            pub fn UnwrapInt8Array(maybeWrapped: *mut root::JSObject) -> *mut root::JSObject;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js16UnwrapUint8ArrayEP8JSObject"]
            pub fn UnwrapUint8Array(maybeWrapped: *mut root::JSObject) -> *mut root::JSObject;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js16UnwrapInt16ArrayEP8JSObject"]
            pub fn UnwrapInt16Array(maybeWrapped: *mut root::JSObject) -> *mut root::JSObject;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js17UnwrapUint16ArrayEP8JSObject"]
            pub fn UnwrapUint16Array(maybeWrapped: *mut root::JSObject) -> *mut root::JSObject;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js16UnwrapInt32ArrayEP8JSObject"]
            pub fn UnwrapInt32Array(maybeWrapped: *mut root::JSObject) -> *mut root::JSObject;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js17UnwrapUint32ArrayEP8JSObject"]
            pub fn UnwrapUint32Array(maybeWrapped: *mut root::JSObject) -> *mut root::JSObject;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js18UnwrapFloat32ArrayEP8JSObject"]
            pub fn UnwrapFloat32Array(maybeWrapped: *mut root::JSObject) -> *mut root::JSObject;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js18UnwrapFloat64ArrayEP8JSObject"]
            pub fn UnwrapFloat64Array(maybeWrapped: *mut root::JSObject) -> *mut root::JSObject;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js23UnwrapUint8ClampedArrayEP8JSObject"]
            pub fn UnwrapUint8ClampedArray(
                maybeWrapped: *mut root::JSObject,
            ) -> *mut root::JSObject;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js19UnwrapBigInt64ArrayEP8JSObject"]
            pub fn UnwrapBigInt64Array(maybeWrapped: *mut root::JSObject) -> *mut root::JSObject;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js20UnwrapBigUint64ArrayEP8JSObject"]
            pub fn UnwrapBigUint64Array(maybeWrapped: *mut root::JSObject) -> *mut root::JSObject;
        }
        pub type EnableIfABOVType = root::std::enable_if_t;
        extern "C" {
            #[doc = " A JSErrorCallback suitable for passing to |JS_ReportErrorNumberASCII| and\n similar functions in concert with one of the |JSErrNum| error numbers.\n\n This function is a function only of |errorNumber|: |userRef| and ambient\n state have no effect on its behavior."]
            #[link_name = "\u{1}_ZN2js15GetErrorMessageEPvj"]
            pub fn GetErrorMessage(
                userRef: *mut ::std::os::raw::c_void,
                errorNumber: ::std::os::raw::c_uint,
            ) -> *const root::JSErrorFormatString;
        }
        extern "C" {
            #[doc = " Tell the JS engine which Class is used for WindowProxy objects. Used by the\n functions below."]
            #[link_name = "\u{1}_ZN2js19SetWindowProxyClassEP9JSContextPK7JSClass"]
            pub fn SetWindowProxyClass(cx: *mut root::JSContext, clasp: *const root::JSClass);
        }
        extern "C" {
            #[doc = " Associates a WindowProxy with a Window (global object). `windowProxy` must\n have the Class set by SetWindowProxyClass."]
            #[link_name = "\u{1}_ZN2js14SetWindowProxyEP9JSContextN2JS6HandleIP8JSObjectEES6_"]
            pub fn SetWindowProxy(
                cx: *mut root::JSContext,
                global: root::JS::Handle<*mut root::JSObject>,
                windowProxy: root::JS::Handle<*mut root::JSObject>,
            );
        }
        extern "C" {
            #[doc = " Returns true iff `obj` has the WindowProxy Class (see SetWindowProxyClass)."]
            #[link_name = "\u{1}_ZN2js13IsWindowProxyEP8JSObject"]
            pub fn IsWindowProxy(obj: *mut root::JSObject) -> bool;
        }
        extern "C" {
            #[doc = " If `obj` is a WindowProxy, get its associated Window (the compartment's\n global), else return `obj`. This function is infallible and never returns\n nullptr."]
            #[link_name = "\u{1}_ZN2js21ToWindowIfWindowProxyEP8JSObject"]
            pub fn ToWindowIfWindowProxy(obj: *mut root::JSObject) -> *mut root::JSObject;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js15TraceValueArrayEP8JSTracermPN2JS5ValueE"]
            pub fn TraceValueArray(
                trc: *mut root::JSTracer,
                length: usize,
                elements: *mut root::JS::Value,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js16AssertHeapIsIdleEv"]
            pub fn AssertHeapIsIdle();
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct TimeBudget {
            pub budget: root::mozilla::TimeDuration,
            pub deadline: root::mozilla::TimeStamp,
        }
        #[test]
        fn bindgen_test_layout_TimeBudget() {
            const UNINIT: ::std::mem::MaybeUninit<TimeBudget> = ::std::mem::MaybeUninit::uninit();
            let ptr = UNINIT.as_ptr();
            assert_eq!(
                ::std::mem::size_of::<TimeBudget>(),
                16usize,
                concat!("Size of: ", stringify!(TimeBudget))
            );
            assert_eq!(
                ::std::mem::align_of::<TimeBudget>(),
                8usize,
                concat!("Alignment of ", stringify!(TimeBudget))
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).budget) as usize - ptr as usize },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(TimeBudget),
                    "::",
                    stringify!(budget)
                )
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).deadline) as usize - ptr as usize },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(TimeBudget),
                    "::",
                    stringify!(deadline)
                )
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct WorkBudget {
            pub budget: i64,
        }
        #[test]
        fn bindgen_test_layout_WorkBudget() {
            const UNINIT: ::std::mem::MaybeUninit<WorkBudget> = ::std::mem::MaybeUninit::uninit();
            let ptr = UNINIT.as_ptr();
            assert_eq!(
                ::std::mem::size_of::<WorkBudget>(),
                8usize,
                concat!("Size of: ", stringify!(WorkBudget))
            );
            assert_eq!(
                ::std::mem::align_of::<WorkBudget>(),
                8usize,
                concat!("Alignment of ", stringify!(WorkBudget))
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).budget) as usize - ptr as usize },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(WorkBudget),
                    "::",
                    stringify!(budget)
                )
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct UnlimitedBudget {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_UnlimitedBudget() {
            assert_eq!(
                ::std::mem::size_of::<UnlimitedBudget>(),
                1usize,
                concat!("Size of: ", stringify!(UnlimitedBudget))
            );
            assert_eq!(
                ::std::mem::align_of::<UnlimitedBudget>(),
                1usize,
                concat!("Alignment of ", stringify!(UnlimitedBudget))
            );
        }
        #[repr(C)]
        #[derive(Debug)]
        pub struct SliceBudget {
            pub idle: bool,
            pub extended: bool,
            pub budget: [u64; 3usize],
            pub interruptRequested: *mut root::js::SliceBudget_InterruptRequestFlag,
            pub counter: i64,
            pub interrupted: bool,
        }
        pub type SliceBudget_InterruptRequestFlag = u8;
        pub const SliceBudget_UnlimitedCounter: isize = isize::MAX;
        pub const SliceBudget_StepsPerExpensiveCheck: isize = 1000;
        #[test]
        fn bindgen_test_layout_SliceBudget() {
            const UNINIT: ::std::mem::MaybeUninit<SliceBudget> = ::std::mem::MaybeUninit::uninit();
            let ptr = UNINIT.as_ptr();
            assert_eq!(
                ::std::mem::size_of::<SliceBudget>(),
                56usize,
                concat!("Size of: ", stringify!(SliceBudget))
            );
            assert_eq!(
                ::std::mem::align_of::<SliceBudget>(),
                8usize,
                concat!("Alignment of ", stringify!(SliceBudget))
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).idle) as usize - ptr as usize },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(SliceBudget),
                    "::",
                    stringify!(idle)
                )
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).extended) as usize - ptr as usize },
                1usize,
                concat!(
                    "Offset of field: ",
                    stringify!(SliceBudget),
                    "::",
                    stringify!(extended)
                )
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).budget) as usize - ptr as usize },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(SliceBudget),
                    "::",
                    stringify!(budget)
                )
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).interruptRequested) as usize - ptr as usize },
                32usize,
                concat!(
                    "Offset of field: ",
                    stringify!(SliceBudget),
                    "::",
                    stringify!(interruptRequested)
                )
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).counter) as usize - ptr as usize },
                40usize,
                concat!(
                    "Offset of field: ",
                    stringify!(SliceBudget),
                    "::",
                    stringify!(counter)
                )
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).interrupted) as usize - ptr as usize },
                48usize,
                concat!(
                    "Offset of field: ",
                    stringify!(SliceBudget),
                    "::",
                    stringify!(interrupted)
                )
            );
        }
        pub mod gcstats {
            #[allow(unused_imports)]
            use self::super::super::super::root;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct Statistics {
                _unused: [u8; 0],
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct Debugger {
            _unused: [u8; 0],
        }
        #[repr(u32)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub enum ErrorArgumentsType {
            ArgumentsAreUnicode = 0,
            ArgumentsAreASCII = 1,
            ArgumentsAreLatin1 = 2,
            ArgumentsAreUTF8 = 3,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct ScriptSource {
            _unused: [u8; 0],
        }
        extern "C" {
            #[doc = " Hint that we expect a crash. Currently, the only thing that cares is the\n breakpad injector, which (if loaded) will suppress minidump generation."]
            #[link_name = "\u{1}_ZN2js20NoteIntentionalCrashEv"]
            pub fn NoteIntentionalCrash();
        }
        extern "C" {
            #[doc = " Get the script private value associated with an object, if any.\n\n The private value is set with SetScriptPrivate() or SetModulePrivate() and is\n internally stored on the relevant ScriptSourceObject.\n\n This is used by the cycle collector to trace through\n ScriptSourceObjects. This allows private values to contain an nsISupports\n pointer and hence support references to cycle collected C++ objects."]
            #[link_name = "\u{1}_ZN2js21MaybeGetScriptPrivateEP8JSObject"]
            pub fn MaybeGetScriptPrivate(object: *mut root::JSObject) -> root::JS::Value;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js17IsArgumentsObjectEN2JS6HandleIP8JSObjectEE"]
            pub fn IsArgumentsObject(obj: root::JS::HandleObject) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js15AddRawValueRootEP9JSContextPN2JS5ValueEPKc"]
            pub fn AddRawValueRoot(
                cx: *mut root::JSContext,
                vp: *mut root::JS::Value,
                name: *const ::std::os::raw::c_char,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js18RemoveRawValueRootEP9JSContextPN2JS5ValueE"]
            pub fn RemoveRawValueRoot(cx: *mut root::JSContext, vp: *mut root::JS::Value);
        }
        extern "C" {
            #[doc = " Use the runtime's internal handling of job queues for Promise jobs.\n\n Most embeddings, notably web browsers, will have their own task scheduling\n systems and need to integrate handling of Promise jobs into that, so they\n will want to manage job queues themselves. For basic embeddings such as the\n JS shell that don't have an event loop of their own, it's easier to have\n SpiderMonkey handle job queues internally.\n\n Note that the embedding still has to trigger processing of job queues at\n right time(s), such as after evaluation of a script has run to completion."]
            #[link_name = "\u{1}_ZN2js20UseInternalJobQueuesEP9JSContext"]
            pub fn UseInternalJobQueues(cx: *mut root::JSContext) -> bool;
        }
        extern "C" {
            #[doc = " Enqueue |job| on the internal job queue.\n\n This is useful in tests for creating situations where a call occurs with no\n other JavaScript on the stack."]
            #[link_name = "\u{1}_ZN2js10EnqueueJobEP9JSContextN2JS6HandleIP8JSObjectEE"]
            pub fn EnqueueJob(cx: *mut root::JSContext, job: root::JS::HandleObject) -> bool;
        }
        extern "C" {
            #[doc = " Instruct the runtime to stop draining the internal job queue.\n\n Useful if the embedding is in the process of quitting in reaction to a\n builtin being called, or if it wants to resume executing jobs later on."]
            #[link_name = "\u{1}_ZN2js20StopDrainingJobQueueEP9JSContext"]
            pub fn StopDrainingJobQueue(cx: *mut root::JSContext);
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js7RunJobsEP9JSContext"]
            pub fn RunJobs(cx: *mut root::JSContext);
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js12GetRealmZoneEPN2JS5RealmE"]
            pub fn GetRealmZone(realm: *mut root::JS::Realm) -> *mut root::JS::Zone;
        }
        pub type PreserveWrapperCallback = ::std::option::Option<
            unsafe extern "C" fn(arg1: *mut root::JSContext, arg2: root::JS::HandleObject) -> bool,
        >;
        pub type HasReleasedWrapperCallback =
            ::std::option::Option<unsafe extern "C" fn(arg1: root::JS::HandleObject) -> bool>;
        extern "C" {
            #[link_name = "\u{1}_ZN2js13IsSystemRealmEPN2JS5RealmE"]
            pub fn IsSystemRealm(realm: *mut root::JS::Realm) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js19IsSystemCompartmentEPN2JS11CompartmentE"]
            pub fn IsSystemCompartment(comp: *mut root::JS::Compartment) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js12IsSystemZoneEPN2JS4ZoneE"]
            pub fn IsSystemZone(zone: *mut root::JS::Zone) -> bool;
        }
        #[repr(C)]
        pub struct WeakMapTracer__bindgen_vtable(::std::os::raw::c_void);
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct WeakMapTracer {
            pub vtable_: *const WeakMapTracer__bindgen_vtable,
            pub runtime: *mut root::JSRuntime,
        }
        #[test]
        fn bindgen_test_layout_WeakMapTracer() {
            const UNINIT: ::std::mem::MaybeUninit<WeakMapTracer> =
                ::std::mem::MaybeUninit::uninit();
            let ptr = UNINIT.as_ptr();
            assert_eq!(
                ::std::mem::size_of::<WeakMapTracer>(),
                16usize,
                concat!("Size of: ", stringify!(WeakMapTracer))
            );
            assert_eq!(
                ::std::mem::align_of::<WeakMapTracer>(),
                8usize,
                concat!("Alignment of ", stringify!(WeakMapTracer))
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).runtime) as usize - ptr as usize },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(WeakMapTracer),
                    "::",
                    stringify!(runtime)
                )
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js13TraceWeakMapsEPNS_13WeakMapTracerE"]
            pub fn TraceWeakMaps(trc: *mut root::js::WeakMapTracer);
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js18AreGCGrayBitsValidEP9JSRuntime"]
            pub fn AreGCGrayBitsValid(rt: *mut root::JSRuntime) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js21ZoneGlobalsAreAllGrayEPN2JS4ZoneE"]
            pub fn ZoneGlobalsAreAllGray(zone: *mut root::JS::Zone) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js37IsCompartmentZoneSweepingOrCompactingEPN2JS11CompartmentE"]
            pub fn IsCompartmentZoneSweepingOrCompacting(comp: *mut root::JS::Compartment) -> bool;
        }
        pub type IterateGCThingCallback = ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::std::os::raw::c_void,
                arg2: root::JS::GCCellPtr,
                arg3: *const root::JS::AutoRequireNoGC,
            ),
        >;
        extern "C" {
            #[link_name = "\u{1}_ZN2js23TraceGrayWrapperTargetsEP8JSTracerPN2JS4ZoneE"]
            pub fn TraceGrayWrapperTargets(trc: *mut root::JSTracer, zone: *mut root::JS::Zone);
        }
        extern "C" {
            #[doc = " Invoke cellCallback on every gray JSObject in the given zone."]
            #[link_name = "\u{1}_ZN2js18IterateGrayObjectsEPN2JS4ZoneEPFvPvNS0_9GCCellPtrERKNS0_15AutoRequireNoGCEES3_"]
            pub fn IterateGrayObjects(
                zone: *mut root::JS::Zone,
                cellCallback: root::js::IterateGCThingCallback,
                data: *mut ::std::os::raw::c_void,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js17GetAnyRealmInZoneEPN2JS4ZoneE"]
            pub fn GetAnyRealmInZone(zone: *mut root::JS::Zone) -> *mut root::JS::Realm;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js27GetFirstGlobalInCompartmentEPN2JS11CompartmentE"]
            pub fn GetFirstGlobalInCompartment(
                comp: *mut root::JS::Compartment,
            ) -> *mut root::JSObject;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js24CompartmentHasLiveGlobalEPN2JS11CompartmentE"]
            pub fn CompartmentHasLiveGlobal(comp: *mut root::JS::Compartment) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js21IsSharableCompartmentEPN2JS11CompartmentE"]
            pub fn IsSharableCompartment(comp: *mut root::JS::Compartment) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js15ProtoKeyToClassE10JSProtoKey"]
            pub fn ProtoKeyToClass(key: root::JSProtoKey) -> *const root::JSClass;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js30ShouldIgnorePropertyDefinitionEP9JSContext10JSProtoKeyN2JS11PropertyKeyE"]
            pub fn ShouldIgnorePropertyDefinition(
                cx: *mut root::JSContext,
                key: root::JSProtoKey,
                id: root::jsid,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js16IsFunctionObjectEP8JSObject"]
            pub fn IsFunctionObject(obj: *mut root::JSObject) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js34UninlinedIsCrossCompartmentWrapperEPK8JSObject"]
            pub fn UninlinedIsCrossCompartmentWrapper(obj: *const root::JSObject) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js21AssertSameCompartmentEP9JSContextP8JSObject"]
            pub fn AssertSameCompartment(cx: *mut root::JSContext, obj: *mut root::JSObject);
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js21AssertSameCompartmentEP9JSContextN2JS6HandleINS2_5ValueEEE"]
            pub fn AssertSameCompartment1(cx: *mut root::JSContext, v: root::JS::HandleValue);
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js23NotifyAnimationActivityEP8JSObject"]
            pub fn NotifyAnimationActivity(obj: *mut root::JSObject);
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js26DefineFunctionWithReservedEP9JSContextP8JSObjectPKcPFbS1_jPN2JS5ValueEEjj"]
            pub fn DefineFunctionWithReserved(
                cx: *mut root::JSContext,
                obj: *mut root::JSObject,
                name: *const ::std::os::raw::c_char,
                call: root::JSNative,
                nargs: ::std::os::raw::c_uint,
                attrs: ::std::os::raw::c_uint,
            ) -> *mut root::JSFunction;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js23NewFunctionWithReservedEP9JSContextPFbS1_jPN2JS5ValueEEjjPKc"]
            pub fn NewFunctionWithReserved(
                cx: *mut root::JSContext,
                call: root::JSNative,
                nargs: ::std::os::raw::c_uint,
                flags: ::std::os::raw::c_uint,
                name: *const ::std::os::raw::c_char,
            ) -> *mut root::JSFunction;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js27NewFunctionByIdWithReservedEP9JSContextPFbS1_jPN2JS5ValueEEjjNS2_11PropertyKeyE"]
            pub fn NewFunctionByIdWithReserved(
                cx: *mut root::JSContext,
                native: root::JSNative,
                nargs: ::std::os::raw::c_uint,
                flags: ::std::os::raw::c_uint,
                id: root::jsid,
            ) -> *mut root::JSFunction;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js25GetFunctionNativeReservedEP8JSObjectm"]
            pub fn GetFunctionNativeReserved(
                fun: *mut root::JSObject,
                which: usize,
            ) -> *const root::JS::Value;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js25SetFunctionNativeReservedEP8JSObjectmRKN2JS5ValueE"]
            pub fn SetFunctionNativeReserved(
                fun: *mut root::JSObject,
                which: usize,
                val: *const root::JS::Value,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js25FunctionHasNativeReservedEP8JSObject"]
            pub fn FunctionHasNativeReserved(fun: *mut root::JSObject) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js14GetObjectProtoEP9JSContextN2JS6HandleIP8JSObjectEENS2_13MutableHandleIS5_EE"]
            pub fn GetObjectProto(
                cx: *mut root::JSContext,
                obj: root::JS::HandleObject,
                proto: root::JS::MutableHandleObject,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js18GetStaticPrototypeEP8JSObject"]
            pub fn GetStaticPrototype(obj: *mut root::JSObject) -> *mut root::JSObject;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js20GetRealmOriginalEvalEP9JSContextN2JS13MutableHandleIP8JSObjectEE"]
            pub fn GetRealmOriginalEval(
                cx: *mut root::JSContext,
                eval: root::JS::MutableHandleObject,
            ) -> bool;
        }
        extern "C" {
            #[doc = " Add some or all property keys of obj to the id vector *props.\n\n The flags parameter controls which property keys are added. Pass a\n combination of the following bits:\n\n     JSITER_OWNONLY - Don't also search the prototype chain; only consider\n       obj's own properties.\n\n     JSITER_HIDDEN - Include nonenumerable properties.\n\n     JSITER_SYMBOLS - Include property keys that are symbols. The default\n       behavior is to filter out symbols.\n\n     JSITER_SYMBOLSONLY - Exclude non-symbol property keys.\n\n This is the closest C++ API we have to `Reflect.ownKeys(obj)`, or\n equivalently, the ES6 [[OwnPropertyKeys]] internal method. Pass\n `JSITER_OWNONLY | JSITER_HIDDEN | JSITER_SYMBOLS` as flags to get\n results that match the output of Reflect.ownKeys."]
            #[link_name = "\u{1}_ZN2js15GetPropertyKeysEP9JSContextN2JS6HandleIP8JSObjectEEjNS2_13MutableHandleINS2_13StackGCVectorINS2_11PropertyKeyENS_15TempAllocPolicyEEEEE"]
            pub fn GetPropertyKeys(
                cx: *mut root::JSContext,
                obj: root::JS::HandleObject,
                flags: ::std::os::raw::c_uint,
                props: root::JS::MutableHandleIdVector,
            ) -> bool;
        }
        extern "C" {
            #[doc = " Determine whether the given string is an array index in the sense of\n <https://tc39.github.io/ecma262/#array-index>.\n\n If it isn't, returns false.\n\n If it is, returns true and outputs the index in *indexp."]
            #[link_name = "\u{1}_ZN2js18StringIsArrayIndexEP14JSLinearStringPj"]
            pub fn StringIsArrayIndex(str_: *mut root::JSLinearString, indexp: *mut u32) -> bool;
        }
        extern "C" {
            #[doc = " Overload of StringIsArrayIndex taking a (char16_t*,length) pair. Behaves\n the same as the JSLinearString version."]
            #[link_name = "\u{1}_ZN2js18StringIsArrayIndexEPKDsjPj"]
            pub fn StringIsArrayIndex1(str_: *const u16, length: u32, indexp: *mut u32) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js27SetPreserveWrapperCallbacksEP9JSContextPFbS1_N2JS6HandleIP8JSObjectEEEPFbS6_E"]
            pub fn SetPreserveWrapperCallbacks(
                cx: *mut root::JSContext,
                preserveWrapper: root::js::PreserveWrapperCallback,
                hasReleasedWrapper: root::js::HasReleasedWrapperCallback,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js28IsObjectInContextCompartmentEP8JSObjectPK9JSContext"]
            pub fn IsObjectInContextCompartment(
                obj: *mut root::JSObject,
                cx: *const root::JSContext,
            ) -> bool;
        }
        pub type DOMInstanceClassHasProtoAtDepth = ::std::option::Option<
            unsafe extern "C" fn(arg1: *const root::JSClass, arg2: u32, arg3: u32) -> bool,
        >;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct JSDOMCallbacks {
            pub instanceClassMatchesProto: root::js::DOMInstanceClassHasProtoAtDepth,
        }
        #[test]
        fn bindgen_test_layout_JSDOMCallbacks() {
            const UNINIT: ::std::mem::MaybeUninit<JSDOMCallbacks> =
                ::std::mem::MaybeUninit::uninit();
            let ptr = UNINIT.as_ptr();
            assert_eq!(
                ::std::mem::size_of::<JSDOMCallbacks>(),
                8usize,
                concat!("Size of: ", stringify!(JSDOMCallbacks))
            );
            assert_eq!(
                ::std::mem::align_of::<JSDOMCallbacks>(),
                8usize,
                concat!("Alignment of ", stringify!(JSDOMCallbacks))
            );
            assert_eq!(
                unsafe {
                    ::std::ptr::addr_of!((*ptr).instanceClassMatchesProto) as usize - ptr as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(JSDOMCallbacks),
                    "::",
                    stringify!(instanceClassMatchesProto)
                )
            );
        }
        pub type DOMCallbacks = root::js::JSDOMCallbacks;
        extern "C" {
            #[link_name = "\u{1}_ZN2js15SetDOMCallbacksEP9JSContextPKNS_14JSDOMCallbacksE"]
            pub fn SetDOMCallbacks(
                cx: *mut root::JSContext,
                callbacks: *const root::js::DOMCallbacks,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js15GetDOMCallbacksEP9JSContext"]
            pub fn GetDOMCallbacks(cx: *mut root::JSContext) -> *const root::js::DOMCallbacks;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js19GetTestingFunctionsEP9JSContext"]
            pub fn GetTestingFunctions(cx: *mut root::JSContext) -> *mut root::JSObject;
        }
        extern "C" {
            #[doc = " Get an error type name from a JSExnType constant.\n Returns nullptr for invalid arguments and JSEXN_INTERNALERR"]
            #[link_name = "\u{1}_ZN2js16GetErrorTypeNameEP9JSContexts"]
            pub fn GetErrorTypeName(
                cx: *mut root::JSContext,
                exnType: i16,
            ) -> *mut root::JSLinearString;
        }
        #[repr(u32)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub enum NukeReferencesToWindow {
            NukeWindowReferences = 0,
            DontNukeWindowReferences = 1,
        }
        #[repr(u32)]
        #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
        pub enum NukeReferencesFromTarget {
            NukeAllReferences = 0,
            NukeIncomingReferences = 1,
        }
        #[repr(C)]
        pub struct CompartmentFilter__bindgen_vtable(::std::os::raw::c_void);
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct CompartmentFilter {
            pub vtable_: *const CompartmentFilter__bindgen_vtable,
        }
        #[test]
        fn bindgen_test_layout_CompartmentFilter() {
            assert_eq!(
                ::std::mem::size_of::<CompartmentFilter>(),
                8usize,
                concat!("Size of: ", stringify!(CompartmentFilter))
            );
            assert_eq!(
                ::std::mem::align_of::<CompartmentFilter>(),
                8usize,
                concat!("Alignment of ", stringify!(CompartmentFilter))
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct AllCompartments {
            pub _base: root::js::CompartmentFilter,
        }
        #[test]
        fn bindgen_test_layout_AllCompartments() {
            assert_eq!(
                ::std::mem::size_of::<AllCompartments>(),
                8usize,
                concat!("Size of: ", stringify!(AllCompartments))
            );
            assert_eq!(
                ::std::mem::align_of::<AllCompartments>(),
                8usize,
                concat!("Alignment of ", stringify!(AllCompartments))
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct SingleCompartment {
            pub _base: root::js::CompartmentFilter,
            pub ours: *mut root::JS::Compartment,
        }
        #[test]
        fn bindgen_test_layout_SingleCompartment() {
            const UNINIT: ::std::mem::MaybeUninit<SingleCompartment> =
                ::std::mem::MaybeUninit::uninit();
            let ptr = UNINIT.as_ptr();
            assert_eq!(
                ::std::mem::size_of::<SingleCompartment>(),
                16usize,
                concat!("Size of: ", stringify!(SingleCompartment))
            );
            assert_eq!(
                ::std::mem::align_of::<SingleCompartment>(),
                8usize,
                concat!("Alignment of ", stringify!(SingleCompartment))
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).ours) as usize - ptr as usize },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(SingleCompartment),
                    "::",
                    stringify!(ours)
                )
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js28NukeCrossCompartmentWrappersEP9JSContextRKNS_17CompartmentFilterEPN2JS5RealmENS_22NukeReferencesToWindowENS_24NukeReferencesFromTargetE"]
            pub fn NukeCrossCompartmentWrappers(
                cx: *mut root::JSContext,
                sourceFilter: *const root::js::CompartmentFilter,
                target: *mut root::JS::Realm,
                nukeReferencesToWindow: root::js::NukeReferencesToWindow,
                nukeReferencesFromTarget: root::js::NukeReferencesFromTarget,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js15AllowNewWrapperEPN2JS11CompartmentEP8JSObject"]
            pub fn AllowNewWrapper(
                target: *mut root::JS::Compartment,
                obj: *mut root::JSObject,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js16NukedObjectRealmEP8JSObject"]
            pub fn NukedObjectRealm(obj: *mut root::JSObject) -> bool;
        }
        extern "C" {
            #[doc = " Detect whether the internal date value is NaN."]
            #[link_name = "\u{1}_ZN2js11DateIsValidEP9JSContextN2JS6HandleIP8JSObjectEEPb"]
            pub fn DateIsValid(
                cx: *mut root::JSContext,
                obj: root::JS::HandleObject,
                isValid: *mut bool,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js21DateGetMsecSinceEpochEP9JSContextN2JS6HandleIP8JSObjectEEPd"]
            pub fn DateGetMsecSinceEpoch(
                cx: *mut root::JSContext,
                obj: root::JS::HandleObject,
                msecSinceEpoch: *mut f64,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js11GetSCOffsetEP23JSStructuredCloneWriter"]
            pub fn GetSCOffset(writer: *mut root::JSStructuredCloneWriter) -> u64;
        }
        #[repr(C)]
        pub struct ScriptEnvironmentPreparer__bindgen_vtable(::std::os::raw::c_void);
        #[doc = " PrepareScriptEnvironmentAndInvoke asserts the embedder has registered a\n ScriptEnvironmentPreparer and then it calls the preparer's 'invoke' method\n with the given |closure|, with the assumption that the preparer will set up\n any state necessary to run script in |global|, invoke |closure| with a valid\n JSContext*, report any exceptions thrown from the closure, and return.\n\n PrepareScriptEnvironmentAndInvoke will report any exceptions that are thrown\n by the closure.  Consumers who want to propagate back whether the closure\n succeeded should do so via members of the closure itself."]
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct ScriptEnvironmentPreparer {
            pub vtable_: *const ScriptEnvironmentPreparer__bindgen_vtable,
        }
        #[repr(C)]
        pub struct ScriptEnvironmentPreparer_Closure__bindgen_vtable(::std::os::raw::c_void);
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct ScriptEnvironmentPreparer_Closure {
            pub vtable_: *const ScriptEnvironmentPreparer_Closure__bindgen_vtable,
        }
        #[test]
        fn bindgen_test_layout_ScriptEnvironmentPreparer_Closure() {
            assert_eq!(
                ::std::mem::size_of::<ScriptEnvironmentPreparer_Closure>(),
                8usize,
                concat!("Size of: ", stringify!(ScriptEnvironmentPreparer_Closure))
            );
            assert_eq!(
                ::std::mem::align_of::<ScriptEnvironmentPreparer_Closure>(),
                8usize,
                concat!(
                    "Alignment of ",
                    stringify!(ScriptEnvironmentPreparer_Closure)
                )
            );
        }
        #[test]
        fn bindgen_test_layout_ScriptEnvironmentPreparer() {
            assert_eq!(
                ::std::mem::size_of::<ScriptEnvironmentPreparer>(),
                8usize,
                concat!("Size of: ", stringify!(ScriptEnvironmentPreparer))
            );
            assert_eq!(
                ::std::mem::align_of::<ScriptEnvironmentPreparer>(),
                8usize,
                concat!("Alignment of ", stringify!(ScriptEnvironmentPreparer))
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js33PrepareScriptEnvironmentAndInvokeEP9JSContextN2JS6HandleIP8JSObjectEERNS_25ScriptEnvironmentPreparer7ClosureE"]
            pub fn PrepareScriptEnvironmentAndInvoke(
                cx: *mut root::JSContext,
                global: root::JS::HandleObject,
                closure: *mut root::js::ScriptEnvironmentPreparer_Closure,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js28SetScriptEnvironmentPreparerEP9JSContextPNS_25ScriptEnvironmentPreparerE"]
            pub fn SetScriptEnvironmentPreparer(
                cx: *mut root::JSContext,
                preparer: *mut root::js::ScriptEnvironmentPreparer,
            );
        }
        #[repr(C)]
        pub struct AllocationMetadataBuilder__bindgen_vtable(::std::os::raw::c_void);
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct AllocationMetadataBuilder {
            pub vtable_: *const AllocationMetadataBuilder__bindgen_vtable,
        }
        #[test]
        fn bindgen_test_layout_AllocationMetadataBuilder() {
            assert_eq!(
                ::std::mem::size_of::<AllocationMetadataBuilder>(),
                8usize,
                concat!("Size of: ", stringify!(AllocationMetadataBuilder))
            );
            assert_eq!(
                ::std::mem::align_of::<AllocationMetadataBuilder>(),
                8usize,
                concat!("Alignment of ", stringify!(AllocationMetadataBuilder))
            );
        }
        extern "C" {
            #[doc = " Specify a callback to invoke when creating each JS object in the current\n compartment, which may return a metadata object to associate with the\n object."]
            #[link_name = "\u{1}_ZN2js28SetAllocationMetadataBuilderEP9JSContextPKNS_25AllocationMetadataBuilderE"]
            pub fn SetAllocationMetadataBuilder(
                cx: *mut root::JSContext,
                callback: *const root::js::AllocationMetadataBuilder,
            );
        }
        extern "C" {
            #[doc = " Get the metadata associated with an object."]
            #[link_name = "\u{1}_ZN2js21GetAllocationMetadataEP8JSObject"]
            pub fn GetAllocationMetadata(obj: *mut root::JSObject) -> *mut root::JSObject;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js20GetElementsWithAdderEP9JSContextN2JS6HandleIP8JSObjectEES6_jjPNS_12ElementAdderE"]
            pub fn GetElementsWithAdder(
                cx: *mut root::JSContext,
                obj: root::JS::HandleObject,
                receiver: root::JS::HandleObject,
                begin: u32,
                end: u32,
                adder: *mut root::js::ElementAdder,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js15ForwardToNativeEP9JSContextPFbS1_jPN2JS5ValueEERKNS2_8CallArgsE"]
            pub fn ForwardToNative(
                cx: *mut root::JSContext,
                native: root::JSNative,
                args: *const root::JS::CallArgs,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js31ExecuteInFrameScriptEnvironmentEP9JSContextN2JS6HandleIP8JSObjectEENS3_IP8JSScriptEENS2_13MutableHandleIS5_EE"]
            pub fn ExecuteInFrameScriptEnvironment(
                cx: *mut root::JSContext,
                obj: root::JS::HandleObject,
                script: root::JS::HandleScript,
                scope: root::JS::MutableHandleObject,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js12IsSavedFrameEP8JSObject"]
            pub fn IsSavedFrame(obj: *mut root::JSObject) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js19ReportIsNotFunctionEP9JSContextN2JS6HandleINS2_5ValueEEE"]
            pub fn ReportIsNotFunction(cx: *mut root::JSContext, v: root::JS::HandleValue) -> bool;
        }
        #[repr(C)]
        #[derive(Debug)]
        pub struct AutoAssertNoContentJS {
            pub context_: *mut root::JSContext,
            pub prevAllowContentJS_: bool,
        }
        #[test]
        fn bindgen_test_layout_AutoAssertNoContentJS() {
            const UNINIT: ::std::mem::MaybeUninit<AutoAssertNoContentJS> =
                ::std::mem::MaybeUninit::uninit();
            let ptr = UNINIT.as_ptr();
            assert_eq!(
                ::std::mem::size_of::<AutoAssertNoContentJS>(),
                16usize,
                concat!("Size of: ", stringify!(AutoAssertNoContentJS))
            );
            assert_eq!(
                ::std::mem::align_of::<AutoAssertNoContentJS>(),
                8usize,
                concat!("Alignment of ", stringify!(AutoAssertNoContentJS))
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).context_) as usize - ptr as usize },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(AutoAssertNoContentJS),
                    "::",
                    stringify!(context_)
                )
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).prevAllowContentJS_) as usize - ptr as usize },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(AutoAssertNoContentJS),
                    "::",
                    stringify!(prevAllowContentJS_)
                )
            );
        }
        extern "C" {
            #[doc = " This function only reports GC heap memory,\n and not malloc allocated memory associated with GC things."]
            #[link_name = "\u{1}_ZN2js27GetGCHeapUsageForObjectZoneEP8JSObject"]
            pub fn GetGCHeapUsageForObjectZone(obj: *mut root::JSObject) -> u64;
        }
        #[repr(C)]
        pub struct CompartmentTransplantCallback__bindgen_vtable(::std::os::raw::c_void);
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct CompartmentTransplantCallback {
            pub vtable_: *const CompartmentTransplantCallback__bindgen_vtable,
        }
        #[test]
        fn bindgen_test_layout_CompartmentTransplantCallback() {
            assert_eq!(
                ::std::mem::size_of::<CompartmentTransplantCallback>(),
                8usize,
                concat!("Size of: ", stringify!(CompartmentTransplantCallback))
            );
            assert_eq!(
                ::std::mem::align_of::<CompartmentTransplantCallback>(),
                8usize,
                concat!("Alignment of ", stringify!(CompartmentTransplantCallback))
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js24RemapRemoteWindowProxiesEP9JSContextPNS_29CompartmentTransplantCallbackEN2JS13MutableHandleIP8JSObjectEE"]
            pub fn RemapRemoteWindowProxies(
                cx: *mut root::JSContext,
                callback: *mut root::js::CompartmentTransplantCallback,
                newTarget: root::JS::MutableHandleObject,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN2js26GetObjectZoneFromAnyThreadEPK8JSObject"]
            pub fn GetObjectZoneFromAnyThread(obj: *const root::JSObject) -> *mut root::JS::Zone;
        }
    }
    pub type jsbytecode = u8;
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct JSAtom {
        _unused: [u8; 0],
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct JSContext {
        _unused: [u8; 0],
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct JSFunction {
        _unused: [u8; 0],
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct JSObject {
        _unused: [u8; 0],
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct JSRuntime {
        _unused: [u8; 0],
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct JSScript {
        _unused: [u8; 0],
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct JSString {
        _unused: [u8; 0],
    }
    pub mod JS {
        #[allow(unused_imports)]
        use self::super::super::root;
        pub type Heap<T> = crate::jsgc::Heap<T>;
        pub type Rooted<T> = crate::jsgc::Rooted<T>;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct GCContext {
            _unused: [u8; 0],
        }
        pub type Latin1Char = ::std::os::raw::c_uchar;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct Symbol {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct BigInt {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct Compartment {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct Realm {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct Runtime {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct Zone {
            _unused: [u8; 0],
        }
        #[doc = " Reference to a T that has been rooted elsewhere. This is most useful\n as a parameter type, which guarantees that the T lvalue is properly\n rooted. See \"Move GC Stack Rooting\" above.\n\n If you want to add additional methods to Handle for a specific\n specialization, define a HandleOperations<T> specialization containing them."]
        pub type HandleFunction = root::JS::Handle<*mut root::JSFunction>;
        #[doc = " Reference to a T that has been rooted elsewhere. This is most useful\n as a parameter type, which guarantees that the T lvalue is properly\n rooted. See \"Move GC Stack Rooting\" above.\n\n If you want to add additional methods to Handle for a specific\n specialization, define a HandleOperations<T> specialization containing them."]
        pub type HandleId = root::JS::Handle<root::JS::PropertyKey>;
        #[doc = " Reference to a T that has been rooted elsewhere. This is most useful\n as a parameter type, which guarantees that the T lvalue is properly\n rooted. See \"Move GC Stack Rooting\" above.\n\n If you want to add additional methods to Handle for a specific\n specialization, define a HandleOperations<T> specialization containing them."]
        pub type HandleObject = root::JS::Handle<*mut root::JSObject>;
        pub type HandleScript = root::JS::Handle<*mut root::JSScript>;
        pub type HandleString = root::JS::Handle<*mut root::JSString>;
        pub type HandleSymbol = root::JS::Handle<*mut root::JS::Symbol>;
        pub type HandleBigInt = root::JS::Handle<*mut root::JS::BigInt>;
        #[doc = " Reference to a T that has been rooted elsewhere. This is most useful\n as a parameter type, which guarantees that the T lvalue is properly\n rooted. See \"Move GC Stack Rooting\" above.\n\n If you want to add additional methods to Handle for a specific\n specialization, define a HandleOperations<T> specialization containing them."]
        pub type HandleValue = root::JS::Handle<root::JS::Value>;
        pub type HandleValueVector = u8;
        pub type HandleIdVector = u8;
        #[doc = " Similar to a handle, but the underlying storage can be changed. This is\n useful for outparams.\n\n If you want to add additional methods to MutableHandle for a specific\n specialization, define a MutableHandleOperations<T> specialization containing\n them."]
        pub type MutableHandleFunction = root::JS::MutableHandle<*mut root::JSFunction>;
        #[doc = " Similar to a handle, but the underlying storage can be changed. This is\n useful for outparams.\n\n If you want to add additional methods to MutableHandle for a specific\n specialization, define a MutableHandleOperations<T> specialization containing\n them."]
        pub type MutableHandleId = root::JS::MutableHandle<root::JS::PropertyKey>;
        #[doc = " Similar to a handle, but the underlying storage can be changed. This is\n useful for outparams.\n\n If you want to add additional methods to MutableHandle for a specific\n specialization, define a MutableHandleOperations<T> specialization containing\n them."]
        pub type MutableHandleObject = root::JS::MutableHandle<*mut root::JSObject>;
        pub type MutableHandleScript = root::JS::MutableHandle<*mut root::JSScript>;
        pub type MutableHandleString = root::JS::MutableHandle<*mut root::JSString>;
        pub type MutableHandleSymbol = root::JS::MutableHandle<*mut root::JS::Symbol>;
        pub type MutableHandleBigInt = root::JS::MutableHandle<*mut root::JS::BigInt>;
        #[doc = " Similar to a handle, but the underlying storage can be changed. This is\n useful for outparams.\n\n If you want to add additional methods to MutableHandle for a specific\n specialization, define a MutableHandleOperations<T> specialization containing\n them."]
        pub type MutableHandleValue = root::JS::MutableHandle<root::JS::Value>;
        pub type MutableHandleValueVector = u8;
        #[doc = " Local variable of type T whose value is always rooted. This is typically\n used for local variables, or for non-rooted values being passed to a\n function that requires a handle, e.g. Foo(Root<T>(cx, x)).\n\n If you want to add additional methods to Rooted for a specific\n specialization, define a RootedOperations<T> specialization containing them."]
        pub type RootedObject = root::JS::Rooted<*mut root::JSObject>;
        pub type RootedFunction = root::JS::Rooted<*mut root::JSFunction>;
        pub type RootedScript = root::JS::Rooted<*mut root::JSScript>;
        pub type RootedString = root::JS::Rooted<*mut root::JSString>;
        pub type RootedSymbol = root::JS::Rooted<*mut root::JS::Symbol>;
        pub type RootedBigInt = root::JS::Rooted<*mut root::JS::BigInt>;
        pub type RootedId = root::JS::Rooted<root::JS::PropertyKey>;
        #[doc = " Local variable of type T whose value is always rooted. This is typically\n used for local variables, or for non-rooted values being passed to a\n function that requires a handle, e.g. Foo(Root<T>(cx, x)).\n\n If you want to add additional methods to Rooted for a specific\n specialization, define a RootedOperations<T> specialization containing them."]
        pub type RootedValue = root::JS::Rooted<root::JS::Value>;
        pub type PersistentRootedFunction = u8;
        pub type PersistentRootedId = u8;
        #[doc = " A copyable, assignable global GC root type with arbitrary lifetime, an\n infallible constructor, and automatic unrooting on destruction.\n\n These roots can be used in heap-allocated data structures, so they are not\n associated with any particular JSContext or stack. They are registered with\n the JSRuntime itself, without locking. Initialization may take place on\n construction, or in two phases if the no-argument constructor is called\n followed by init().\n\n Note that you must not use an PersistentRooted in an object owned by a JS\n object:\n\n Whenever one object whose lifetime is decided by the GC refers to another\n such object, that edge must be traced only if the owning JS object is traced.\n This applies not only to JS objects (which obviously are managed by the GC)\n but also to C++ objects owned by JS objects.\n\n If you put a PersistentRooted in such a C++ object, that is almost certainly\n a leak. When a GC begins, the referent of the PersistentRooted is treated as\n live, unconditionally (because a PersistentRooted is a *root*), even if the\n JS object that owns it is unreachable. If there is any path from that\n referent back to the JS object, then the C++ object containing the\n PersistentRooted will not be destructed, and the whole blob of objects will\n not be freed, even if there are no references to them from the outside.\n\n In the context of Firefox, this is a severe restriction: almost everything in\n Firefox is owned by some JS object or another, so using PersistentRooted in\n such objects would introduce leaks. For these kinds of edges, Heap<T> or\n TenuredHeap<T> would be better types. It's up to the implementor of the type\n containing Heap<T> or TenuredHeap<T> members to make sure their referents get\n marked when the object itself is marked."]
        pub type PersistentRootedObject = [u64; 4usize];
        pub type PersistentRootedScript = u8;
        pub type PersistentRootedString = u8;
        pub type PersistentRootedSymbol = u8;
        pub type PersistentRootedBigInt = u8;
        pub type PersistentRootedValue = u8;
        pub type PersistentRootedIdVector = u8;
        pub type PersistentRootedObjectVector = u8;
        extern "C" {
            #[doc = " Create a new ArrayBuffer with the given byte length."]
            #[link_name = "\u{1}_ZN2JS14NewArrayBufferEP9JSContextm"]
            pub fn NewArrayBuffer(cx: *mut root::JSContext, nbytes: usize) -> *mut root::JSObject;
        }
        extern "C" {
            #[doc = " Create a new ArrayBuffer with the given |contents|, which may be null only\n if |nbytes == 0|.  |contents| must be allocated compatible with deallocation\n by |JS_free|.\n\n If and only if an ArrayBuffer is successfully created and returned,\n ownership of |contents| is transferred to the new ArrayBuffer.\n\n Care must be taken that |nbytes| bytes of |content| remain valid for the\n duration of this call.  In particular, passing the length/pointer of existing\n typed array or ArrayBuffer data is generally unsafe: if a GC occurs during a\n call to this function, it could move those contents to a different location\n and invalidate the provided pointer."]
            #[link_name = "\u{1}_ZN2JS26NewArrayBufferWithContentsEP9JSContextmPv"]
            pub fn NewArrayBufferWithContents(
                cx: *mut root::JSContext,
                nbytes: usize,
                contents: *mut ::std::os::raw::c_void,
            ) -> *mut root::JSObject;
        }
        extern "C" {
            #[doc = " Create a new ArrayBuffer, whose bytes are set to the values of the bytes in\n the provided ArrayBuffer.\n\n |maybeArrayBuffer| is asserted to be non-null.  An error is thrown if\n |maybeArrayBuffer| would fail the |IsArrayBufferObject| test given further\n below or if |maybeArrayBuffer| is detached.\n\n |maybeArrayBuffer| may store its contents in any fashion (i.e. it doesn't\n matter whether |maybeArrayBuffer| was allocated using |JS::NewArrayBuffer|,\n |JS::NewExternalArrayBuffer|, or any other ArrayBuffer-allocating function).\n\n The newly-created ArrayBuffer is effectively creatd as if by\n |JS::NewArrayBufferWithContents| passing in |maybeArrayBuffer|'s internal\n data pointer and length, in a manner safe against |maybeArrayBuffer|'s data\n being moved around by the GC.  In particular, the new ArrayBuffer will not\n behave like one created for WASM or asm.js, so it *can* be detached."]
            #[link_name = "\u{1}_ZN2JS15CopyArrayBufferEP9JSContextNS_6HandleIP8JSObjectEE"]
            pub fn CopyArrayBuffer(
                cx: *mut root::JSContext,
                maybeArrayBuffer: root::JS::Handle<*mut root::JSObject>,
            ) -> *mut root::JSObject;
        }
        pub type BufferContentsFreeFunc = ::std::option::Option<
            unsafe extern "C" fn(
                contents: *mut ::std::os::raw::c_void,
                userData: *mut ::std::os::raw::c_void,
            ),
        >;
        extern "C" {
